{
	"talks": [
		{
			"id": 1181913,
			"title": {
				"en": "Registration"
			},
			"start": "2025-04-23T06:00:00Z",
			"end": "2025-04-23T10:00:00+02:00",
			"room": 3893
		},
		{
			"id": 1181914,
			"title": {
				"en": "Opening Session"
			},
			"start": "2025-04-23T08:00:00Z",
			"end": "2025-04-23T10:30:00+02:00",
			"room": 3893
		},
		{
			"code": "3MNGN8",
			"id": 1181915,
			"title": "Reasonable AI",
			"abstract": "The relationship between humans and machines, especially in the context of Artificial Intelligence (AI), is shaped by hopes, concerns, and moral questions. On the one hand, advances in AI offer great promise: it can help us solve complex problems, improve healthcare, streamline workflows, and much more. Yet, at the same time, there are legitimate concerns about the control over this technology, its potential impact on jobs and society, and ethical issues related to discrimination and the loss of human autonomy. In the talk I shall will explore and illustrate the complex tension between innovation and moral responsibility in AI research.",
			"speakers": [
				"B37CUN"
			],
			"track": 5223,
			"start": "2025-04-23T10:30:00+02:00",
			"end": "2025-04-23T11:15:00+02:00",
			"room": 3893,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.149398+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"id": 1181923,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-23T09:15:00Z",
			"end": "2025-04-23T11:45:00+02:00",
			"room": 3901
		},
		{
			"id": 1181924,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-23T09:15:00Z",
			"end": "2025-04-23T11:45:00+02:00",
			"room": 3893
		},
		{
			"id": 1181916,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-23T09:15:00Z",
			"end": "2025-04-23T11:45:00+02:00",
			"room": 3897
		},
		{
			"id": 1181919,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-23T09:15:00Z",
			"end": "2025-04-23T11:45:00+02:00",
			"room": 3894
		},
		{
			"id": 1181922,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-23T09:15:00Z",
			"end": "2025-04-23T11:45:00+02:00",
			"room": 3900
		},
		{
			"id": 1181917,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-23T09:15:00Z",
			"end": "2025-04-23T11:45:00+02:00",
			"room": 3895
		},
		{
			"id": 1181921,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-23T09:15:00Z",
			"end": "2025-04-23T11:45:00+02:00",
			"room": 3896
		},
		{
			"id": 1181920,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-23T09:15:00Z",
			"end": "2025-04-23T11:45:00+02:00",
			"room": 3898
		},
		{
			"id": 1181918,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-23T09:15:00Z",
			"end": "2025-04-23T11:45:00+02:00",
			"room": 3899
		},
		{
			"code": "AJDYRL",
			"id": 1181925,
			"title": "Python Performance Unleashed: Essential Optimization Techniques Beyond Libraries",
			"abstract": "Every Python developer faces performance challenges, from slow data processing to memory-intensive operations. While external libraries like Numba or Cython offer solutions, understanding core Python optimization techniques is crucial for writing efficient code. This talk explores practical optimization strategies using Python's built-in capabilities, demonstrating how to achieve significant performance improvements without external dependencies. Through real-world examples from machine learning pipelines and data processing applications, we'll examine common bottlenecks and their solutions. Whether you're building data pipelines, web applications, or ML systems, these techniques will help you write faster, more efficient Python code.",
			"speakers": [
				"HRNBJX"
			],
			"track": 5207,
			"start": "2025-04-23T11:45:00+02:00",
			"end": "2025-04-23T12:15:00+02:00",
			"room": 3893,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.149692+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "CP3TKB",
			"id": 1181926,
			"title": "Power up your Polars code with Polars extention",
			"abstract": "While Polars is written in Rust and has the advantages of speed and multi-threaded functionalities., everything will slow down if a Python function needs to be applied to the DataFrame. To avoid that, a Polar extension can be used to solve the problem. In this workshop, we will look at how to do it.",
			"speakers": [
				"8EGVC9"
			],
			"track": 5211,
			"start": "2025-04-23T11:45:00+02:00",
			"end": "2025-04-23T13:15:00+02:00",
			"room": 3901,
			"duration": 90,
			"updated": "2025-04-09T08:21:33.149709+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "7FV8B3",
			"id": 1181929,
			"title": "Deploy RAG Applications Using Docker: A Step-by-Step Guide",
			"abstract": "Docker is a game-changer for deploying AI applications, offering portable and consistent environments across platforms. In this tutorial, we’ll explore how to build and deploy a Retrieval-Augmented Generation (RAG) application using Docker. RAG applications combine data retrieval with generative AI to produce contextually relevant and accurate responses, making them powerful tools for interactive Q&A systems.\r\n\r\nWe will build a document-based Q&A application that allows users to upload files, retrieve context from them, and answer questions interactively. We will use LlamaIndex to build the RAG pipeline and use both open-source LLM from Groq and closed-source LLM, such as OpenAI models, for LLM access. This tutorial will guide you through the entire lifecycle—from building the app to deploying it using Docker on Hugging Face Spaces. Whether you’re new to Docker or experienced with RAG, this guide offers a hands-on approach to deploying scalable and efficient AI solutions.",
			"speakers": [
				"SHADQ3"
			],
			"track": 5213,
			"start": "2025-04-23T11:45:00+02:00",
			"end": "2025-04-23T13:15:00+02:00",
			"room": 3900,
			"duration": 90,
			"updated": "2025-04-09T08:21:33.149774+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "TQLGA8",
			"id": 1181927,
			"title": "Reinforcement Learning Without a PhD: A Python Developer’s Journey",
			"abstract": "From watching AI conquer Super Mario to building production-ready Reinforcement Learning (RL) systems, this talk explores how Python developers can dive into RL without requiring advanced degrees or big tech resources. Drawing on our three-year journey of building a production RL system, I’ll show how developers can leverage RL through practical strategies and accessible tools. Using pi_optimal, an open-source RL toolkit, we’ll bridge the gap between cutting-edge RL research and real-world applications. Attendees will gain actionable insights, implementation techniques, and hands-on experience to confidently start their own RL projects.",
			"speakers": [
				"R3BXQU"
			],
			"track": 5212,
			"start": "2025-04-23T11:45:00+02:00",
			"end": "2025-04-23T12:15:00+02:00",
			"room": 3897,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.149725+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "LRL7MS",
			"id": 1181931,
			"title": "Beyond Code: Fostering Diversity and Inclusion in Open Source",
			"abstract": "Open source thrives not just on code, but on the diverse perspectives and inclusive practices that shape our communities. In this dynamic talk, we explore the intersection of open source and diversity, shedding light on how to bridge existing gaps and build welcoming environments for underrepresented groups. Through real-world examples, practical strategies, and inspiring stories from existing researches made on African communities, we'll uncover the immense benefits of diversity and equip you with actionable steps to foster inclusivity. Join us to learn how you can help create a more vibrant and inclusive open-source community that goes beyond code.",
			"speakers": [
				"EE9T8A"
			],
			"track": 5217,
			"start": "2025-04-23T11:45:00+02:00",
			"end": "2025-04-23T12:15:00+02:00",
			"room": 3899,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.149807+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "EN3QPQ",
			"id": 1181933,
			"title": "Are LLMs the answer to all our problems?",
			"abstract": "Generative AI models have shaken up the German market. Since the release of ChatGPT, AI is available and usable for everyone. The number of ChatGPT-based agents is growing rapidly, but concerns about privacy, copyright and ethics remain. Regulation and ethical AI go hand in hand, but are often seen as barriers. The presentation will cover the different aspects of ethics and how they are addressed by regulation. It will give an overview of how to use large language models in a safe and practical way. This won't only address the various ethical issues, but also convince your next customer to invest in your AI-based product.",
			"speakers": [
				"LT7LHM"
			],
			"track": 5218,
			"start": "2025-04-23T11:45:00+02:00",
			"end": "2025-04-23T12:15:00+02:00",
			"room": 3898,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.149849+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "MQG9HN",
			"id": 1181928,
			"title": "Introducing the Synthetic Data SDK - Privacy Preserving Synthetic Data for AI/ML",
			"abstract": "AI-generated synthetic data is gaining traction as a privacy-safe solution for data access and sharing. This data is created from original datasets, maintaining privacy without compromising utility.\r\n\r\nIn this Session, we'll cover the fundamental concepts of AI-generated synthetic data and demonstrate how easy it is to generate synthetic data within your local compute environment using the open-source Synthetic Data SDK.",
			"speakers": [
				"E7TWUS"
			],
			"track": 5211,
			"start": "2025-04-23T11:45:00+02:00",
			"end": "2025-04-23T12:15:00+02:00",
			"room": 3895,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.149751+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "JM3G8S",
			"id": 1181930,
			"title": "Why E.ON Loves Python",
			"abstract": "Join me as I share my 20-year journey with Python and its pivotal role at E.ON. Discover how we transitioned fully to Python, streamlined our development framework, and embraced MLOps principles. Learn about some of our AI projects, including image analysis and real-time inference, and our steps towards open-sourcing code to foster innovation in the energy sector. Explore why Python is our go-to language for data science and collaboration.",
			"speakers": [
				"BDNEEF"
			],
			"track": 5205,
			"start": "2025-04-23T11:45:00+02:00",
			"end": "2025-04-23T12:15:00+02:00",
			"room": 3894,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.149791+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "AGLBMF",
			"id": 1181932,
			"title": "Duplicate record detection using GenAI techniques to improve data quality",
			"abstract": "Duplicate records can have a negative impact on many areas of a business. Current methods to detect duplicate records use traditional NLP techniques known as “Entity Matching”. An improvement to this traditional method can be achieved by incorporating GenAI techniques that do not entail any calls to OpenAI. Not only does this produce better matches, but it also keeps the data safe, since no information is transferred externally.",
			"speakers": [
				"GUNHRW"
			],
			"track": 5213,
			"start": "2025-04-23T11:45:00+02:00",
			"end": "2025-04-23T12:15:00+02:00",
			"room": 3896,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.149822+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "JA9NFW",
			"id": 1181939,
			"title": "Why AI Projects Fail – Chronicles of Failure and How to Overcome Them",
			"abstract": "Why do AI projects fail? Spoiler: It’s rarely about the technology. Organizations often stumble over unrealistic expectations, siloed data, and cultural roadblocks. This talk dives into the human and organizational dynamics that cause AI initiatives to derail.\r\n\r\nUsing real-world examples, I’ll showcase how missing tram stop location data was found on a hobbyist’s blog when official systems failed. Or how critical historical data for resource planning sat locked in Excel files with forgotten passwords, forcing a desperate password recovery operation. These examples highlight the surprising ways poor data governance and lack of interdisciplinary collaboration sabotage even well-intentioned AI projects.\r\n\r\nBut all is not lost! We’ll explore actionable strategies to navigate these challenges: shifting from shiny tools to R&D-driven approaches, fostering better communication between IT and business teams, and building strong foundations for clean, accessible data. Attendees will leave with insights into what AI success truly requires: cultural readiness, realistic expectations, and a commitment to collaboration.\r\n\r\nIf you’re tired of AI hype and looking for practical solutions, this talk offers a clear roadmap to ensure AI projects deliver measurable impact.",
			"speakers": [
				"8F38DV"
			],
			"track": 5221,
			"start": "2025-04-23T12:25:00+02:00",
			"end": "2025-04-23T13:10:00+02:00",
			"room": 3893,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.149959+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "ZKNTGN",
			"id": 1181938,
			"title": "expectation: A modern take on statistical A/B testing with e-values and martingales",
			"abstract": "This talk introduces a novel Python library for statistical testing using e-values, offering a refreshing alternative to traditional p-values. We'll explore how this approach enables real-time sequential testing, allowing data scientists to monitor experiments continuously without the statistical penalties of repeated testing. Through practical examples, we'll demonstrate how e-values provide more intuitive evidence measures and enable flexible stopping rules in A/B testing, clinical trials, and anomaly detection. The library implements cutting-edge methods from game-theoretic probability, making advanced sequential testing accessible to Python practitioners. Whether you're conducting A/B tests, monitoring production models, or running clinical trials, this talk will equip you with powerful new tools for sequential data analysis.",
			"speakers": [
				"SJPXAQ"
			],
			"track": 5212,
			"start": "2025-04-23T12:25:00+02:00",
			"end": "2025-04-23T13:10:00+02:00",
			"room": 3895,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.149941+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "S8MUBF",
			"id": 1181935,
			"title": "Why Exceptions Are Just Sophisticated Gotos - and How to Move Beyond",
			"abstract": "\"Why Exceptions Are Just Sophisticated Gotos - and How to Move Beyond\" explores a common programming tool with a fresh perspective. While exceptions are a key feature in Python and other languages, they share surprising similarities with the notorious goto statement. This talk examines those parallels, the problems exceptions can create, and practical alternatives for better code. Attendees will gain a clear understanding of modern programming concepts and the evolution of programming.",
			"speakers": [
				"8LQU9C"
			],
			"track": 5206,
			"start": "2025-04-23T12:25:00+02:00",
			"end": "2025-04-23T13:10:00+02:00",
			"room": 3894,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.149883+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "NF8UPF",
			"id": 1181940,
			"title": "Building an Open Source RAG System for the United Nations Negotiations on Global Plastic Pollution",
			"abstract": "Plastic pollution is a significant global challenge. Every year, millions of tons of plastic enter the oceans, impacting marine ecosystems and human health. To address this issue, the United Nations is negotiating a legally binding treaty with representatives from 180 countries, aiming to reduce plastic pollution and promote sustainable practices. \r\n\r\nWe have developed NegotiateAI, an open-source chat application that supports delegations during the UN negotiations on a legally binding agreement to combat plastic pollution. The tool demonstrates how generative AI and Retrieval Augmented Systems (RAG) can address complex global challenges. Built with Haystack 2.0, Qdrant, HuggingFace Spaces, and Streamlit, it showcases the potential of open-source technologies in tackling issues of global relevance. \r\n\r\nAs a beginner or advanced developer, this talk will give you valuable insights into developing impactful AI applications with open source tools in the public sector.",
			"speakers": [
				"YPZZ3S",
				"E3MAF3",
				"833C9P"
			],
			"track": 5213,
			"start": "2025-04-23T12:25:00+02:00",
			"end": "2025-04-23T12:55:00+02:00",
			"room": 3897,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.149974+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "GS9QWQ",
			"id": 1181937,
			"title": "Generative AI Monitoring with PydanticAI and Logfire",
			"abstract": "In this talk, we will explore how the integration of PydanticAI and Logfire creates a powerful foundation for generative AI applications. We'll demonstrate how these tools combine to form sophisticated AI workflows and give you comprehensive monitoring.\r\n\r\nThe session illustrates how PydanticAI enables more reliable agent responses while Logfire provides real-time insights for efficient troubleshooting.\r\n\r\nThrough practical examples, you'll learn implementation techniques that will help your team build AI systems with observability, transforming how you develop and maintain generative AI projects. 🚀",
			"speakers": [
				"BGPPXA"
			],
			"track": 5214,
			"start": "2025-04-23T12:25:00+02:00",
			"end": "2025-04-23T13:10:00+02:00",
			"room": 3896,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.149914+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "933YXH",
			"id": 1181936,
			"title": "The aesthetics of AI: from cyberpunk to fascism",
			"abstract": "Let’s explore the visual grammars, references and cultural norms at play in the field of AI; from Kismet to Spot®, from Clippy to Claude. As a sector we can be hyper-focused on technical process and function, to the extent that it blinkers our understanding of the cultural and political impacts of our work. Aesthetics infuse every aspect of technology. Aesthetic interpretations are manifold and mutable, constructed in-congress with the observer and not fully defined by the original designer. AI technologies add additional layers of subtext: character, consciousness, agency, intent.\r\n\r\nDespite this murkiness, or perhaps because of it, this talk makes an passionate argument for engaging with historical aesthetic movements, for building our shared professional knowledge of fads and fashions⎯not just from the past 40 years of internet culture⎯but also the past 140 years of ideology, technology, and thought.",
			"speakers": [
				"NYBL9E"
			],
			"track": 5221,
			"start": "2025-04-23T12:25:00+02:00",
			"end": "2025-04-23T12:55:00+02:00",
			"room": 3898,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.149898+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "ABWHSD",
			"id": 1181934,
			"title": "From Tensors to Clouds — A Practical Guide to Zarr V3 and Zarr-Python 3",
			"abstract": "A key feature of the Python data ecosystem is the reliance on simple but efficient primitives that follow well-defined interfaces to make tools work seamlessly together (Cf. http://data-apis.org/). NumPy provides an in-memory representation for tensors. Dask provides parallelisation of tensor access. Xarray provides metadata linking tensor dimensions. **Zarr** provides a missing feature, namely the scalable, persistent storage for annotated hierarchies of tensors. Defined through a community process, the Zarr specification enables the storage of large out-of-memory datasets locally and in the cloud. Implementations exist in C++, C, Java, Javascript, Julia, and Python, enabling.\r\n\r\nThis talk presents a systematic approach to understanding and implementing the newer version of [Zarr-Python](https://github.com/zarr-developers/zarr-python), i.e. Zarr-Python 3 by explaining the new API, deprecations, new storage backend, improved codec pipeline, etc.\r\n\r\nI will also show the performance improvements in ZP-3 while creating, reading and writing async Zarr arrays across local and remote storage like AWS S3.",
			"speakers": [
				"A7ACFE"
			],
			"track": 5211,
			"start": "2025-04-23T12:25:00+02:00",
			"end": "2025-04-23T12:55:00+02:00",
			"room": 3899,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.149868+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"id": 1181942,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-23T11:10:00Z",
			"end": "2025-04-23T14:30:00+02:00",
			"room": 3899
		},
		{
			"id": 1181946,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-23T11:10:00Z",
			"end": "2025-04-23T14:30:00+02:00",
			"room": 3894
		},
		{
			"id": 1181943,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-23T11:10:00Z",
			"end": "2025-04-23T14:30:00+02:00",
			"room": 3895
		},
		{
			"id": 1181944,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-23T11:10:00Z",
			"end": "2025-04-23T14:30:00+02:00",
			"room": 3896
		},
		{
			"id": 1181945,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-23T11:10:00Z",
			"end": "2025-04-23T14:30:00+02:00",
			"room": 3897
		},
		{
			"id": 1181941,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-23T11:10:00Z",
			"end": "2025-04-23T14:30:00+02:00",
			"room": 3893
		},
		{
			"id": 1181947,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-23T11:10:00Z",
			"end": "2025-04-23T14:30:00+02:00",
			"room": 3898
		},
		{
			"id": 1181948,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-23T11:15:00Z",
			"end": "2025-04-23T14:30:00+02:00",
			"room": 3900
		},
		{
			"id": 1181949,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-23T11:15:00Z",
			"end": "2025-04-23T14:30:00+02:00",
			"room": 3901
		},
		{
			"code": "UWTH7C",
			"id": 1181957,
			"title": "AI coding agent - what it is, how it works and is it good for developers",
			"abstract": "In this talk, we will have a deeper technical look at AI coding agents, their design, and how they can carry out coding tasks with the support of large language models. We will look at the journey from the user entering a prompt to how it converts to actions in completing the task.\r\n\r\nAfter that, we will look at the impact it could make in the industry, as a developer, whether or not you should use an AI coding agent, and what a user should be cautious of when using suchan agent.",
			"speakers": [
				"8EGVC9"
			],
			"track": 5214,
			"start": "2025-04-23T14:30:00+02:00",
			"end": "2025-04-23T15:00:00+02:00",
			"room": 3896,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.150397+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "GUKTNX",
			"id": 1181958,
			"title": "Benchmarking Time Series Foundation Model with sktime",
			"abstract": "Recent time series foundation models such as LagLlama, Chronos, Moirai, TinyTimesMixer promise zero-shot forecasting for arbitrary time series. One central claim of foundation models is their ability to perform zero-shot forecasting, that is, to perform well with no training data. However, performance claims of foundation models are difficult to verify, as public benchmark datasets may have been a part of the training data, and only the already trained weights are available to the user.\r\n\r\nTherefore, performance in specific use cases must be verified on the use case data itself, to ensure a reliable assessment of forecasting performance. sktime allows users to easily produce a performance benchmark of any collection of forecasting models, foundation models, simple baselines, or custom methods, on their internal use case data.",
			"speakers": [
				"GB89CS"
			],
			"track": 5212,
			"start": "2025-04-23T14:30:00+02:00",
			"end": "2025-04-23T15:00:00+02:00",
			"room": 3895,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.150413+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "HYE8EX",
			"id": 1181953,
			"title": "Autonomous Browsing using Large Action Models",
			"abstract": "The browser serves as our gateway to the internet—the largest repository of knowledge in human history. Proficiency in its use is a core skill across nearly all professions and is becoming increasingly important for Artificial Intelligence. But can Large Action Models (LAMs) autonomously operate a browser? What exactly are LAMs that promise to translate human intentions into actions? We report on a project that fully automates the job application process using AI: from navigating unfamiliar website structures and filling out forms to handling document uploads and cookie banners.",
			"speakers": [
				"LDZFAV",
				"HWZVSQ"
			],
			"track": 5213,
			"start": "2025-04-23T14:30:00+02:00",
			"end": "2025-04-23T15:00:00+02:00",
			"room": 3898,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.150321+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "G3AT7E",
			"id": 1181955,
			"title": "LLM Inference Arithmetics: the Theory behind Model Serving",
			"abstract": "Have you ever asked yourself how parameters for an LLM are counted, or wondered why Gemma 2B is actually closer to a 3B model? You have no clue about what a KV-Cache is? (And, before you ask: no, it's not a Redis fork.) Do you want to find out how much GPU VRAM you need to run your model smoothly? \r\n\r\nIf your answer to any of these questions was \"yes\", or you have another doubt about inference with LLMs - such as batching, or time-to-first-token - this talk is for you. Well, except for the Redis part.",
			"speakers": [
				"LCEK33"
			],
			"track": 5214,
			"start": "2025-04-23T14:30:00+02:00",
			"end": "2025-04-23T15:00:00+02:00",
			"room": 3894,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.150368+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "YCAUMC",
			"id": 1181954,
			"title": "Django's Dilemma: Balancing Simplicity with Scalability",
			"abstract": "Django's model-view-serializer approach works great for small apps, but as projects grow, you might face challenges like scattered database operations and APIs that are too closely linked to your database models. These issues can make unit testing and scaling harder. I'll share real-world examples of these problems and show how to refactor an app using ideas from Domain-Driven Design (DDD) and hexagonal architecture. We'll look at a before-and-after example to see how these changes can make your app easier to use and debug. Plus, we'll discuss when Django's simplicity is enough and when it's worth adopting a more structured approach. You'll leave with practical tips for transforming your Django projects into systems that can handle increased complexity.",
			"speakers": [
				"BPXQUH"
			],
			"track": 5210,
			"start": "2025-04-23T14:30:00+02:00",
			"end": "2025-04-23T15:00:00+02:00",
			"room": 3899,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.150348+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "N9CAUM",
			"id": 1181956,
			"title": "supplyseer: Computational Supply Chain with Python",
			"abstract": "This talk introduces supplyseer, an open-source Python library that brings advanced analytics to Supply Chain and Logistics. By combining time series embedding techniques, stochastic process modeling, and geopolitical risk analysis, supplyseer helps organizations make data-driven decisions in an increasingly complex global supply chain landscape. The library implements novel approaches like Takens embedding for demand forecasting, Hawkes processes for modeling supply chain events, and Bayesian methods for inventory optimization. Through practical examples and real-world use cases, we'll explore how these mathematical concepts translate into actionable insights for supply chain practitioners.",
			"speakers": [
				"SJPXAQ"
			],
			"track": 5212,
			"start": "2025-04-23T14:30:00+02:00",
			"end": "2025-04-23T16:00:00+02:00",
			"room": 3901,
			"duration": 90,
			"updated": "2025-04-09T08:21:33.150383+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "83QH37",
			"id": 1181952,
			"title": "From Trees to Transformers: GetYourGuide’s Journey Towards Deep Learning for Ranking",
			"abstract": "GetYourGuide, a global marketplace for travel experiences, reached diminishing returns with its XGBoost-based ranking system. We switched to a Deep Learning pipeline in just nine months, maintaining high throughput and low latency. We iterated on over 50 offline models and conducted more than 10 live A/B tests, ultimately deploying a PyTorch transformer that yielded significant gains. In this talk, we will share our phased approach—from a simple baseline to a high-impact launch—and discuss the key operational and modeling challenges we faced. Learn how to transition from tree-based methods to neural networks and unlock new possibilities for real-time ranking.",
			"speakers": [
				"EZMJWT",
				"SVAMFE"
			],
			"track": 5212,
			"start": "2025-04-23T14:30:00+02:00",
			"end": "2025-04-23T15:00:00+02:00",
			"room": 3893,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.150272+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "UH7FXA",
			"id": 1181951,
			"title": "Instrumenting Python Applications with OpenTelemetry",
			"abstract": "Observability is challenging and often requires vendor-specific instrumentation. Enter OpenTelemetry: a vendor-agnostic standard for logs, metrics, and traces. Learn how to instrument Python applications with OpenTelemetry and send telemetry to your preferred observability backends.",
			"speakers": [
				"JJ8BUD",
				"7QVZDD"
			],
			"track": 5205,
			"start": "2025-04-23T14:30:00+02:00",
			"end": "2025-04-23T16:00:00+02:00",
			"room": 3900,
			"duration": 90,
			"updated": "2025-04-09T08:21:33.150246+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "VDG9YG",
			"id": 1181950,
			"title": "Taking Control of LLM Outputs: An Introductory Journey into Logits",
			"abstract": "This talk explores the use of logits - the raw confidence scores that language models generate before selecting each token. Working directly with logits enables finer control over model behavior.\r\n\r\nThe session covers practical techniques for accessing and utilizing these scores through local models. Topics include detecting model uncertainty, implementing custom stopping conditions, and steering generation without prompt modifications.\r\n\r\nYou will learn how to analyze model confidence patterns and apply this knowledge to real-life use cases.",
			"speakers": [
				"VMEMAF"
			],
			"track": 5213,
			"start": "2025-04-23T14:30:00+02:00",
			"end": "2025-04-23T15:00:00+02:00",
			"room": 3897,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.150206+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "MRHNCV",
			"id": 1181959,
			"title": "Open Table Formats in the Wild: From Parquet to Delta Lake and Back",
			"abstract": "Open table formats have revolutionized analytical, columnar storage on cloud object stores with critical features like ACID compliance and enhanced metadata management, once exclusive to proprietary cloud data warehouses. Delta Lake, Iceberg, and Hudi have significantly advanced over traditional open file formats like Parquet and ORC.\r\n\r\nIn an effort to modernize our data architecture, we aimed to replace our Parquet-based bronze layer with Delta Lake, anticipating better query performance, reduced maintenance, native support for incremental processing, and more. While our initial pilot showed promise, we encountered unexpected pitfalls that ultimately brought us back to where we began.\r\n\r\nCurious? Join me as we shed light on the current state of table formats.",
			"speakers": [
				"3CXHP7"
			],
			"track": 5211,
			"start": "2025-04-23T15:10:00+02:00",
			"end": "2025-04-23T15:55:00+02:00",
			"room": 3893,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.150438+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "LNW3KE",
			"id": 1181965,
			"title": "Inclusive Data for 1.3 Billion: Designing Accessible Visualizations",
			"abstract": "According to the World Health Organization (WHO), an estimated 1.3 billion people (1 in 6 individuals) experience a disability, and nearly 2.2 billion people (1 in 5 individuals) have vision impairment. Improving the accessibility of visualizations will enable more people to participate in and engage with our data analyses.\r\n\r\nIn this talk, we’ll discuss some principles and best practices for creating more accessible data visualizations. It will include tips for individuals who create visualizations, as well as guidelines for the developers of visualization software to help ensure your tools can help downstream designers and developers create more accessible visualizations.",
			"speakers": [
				"LLJSBE"
			],
			"track": 5216,
			"start": "2025-04-23T15:10:00+02:00",
			"end": "2025-04-23T15:55:00+02:00",
			"room": 3896,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.150607+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "PRRPQ3",
			"id": 1181963,
			"title": "PyData Stack: Building and deploying pure Python, open source data platforms",
			"abstract": "Modern open source Python data packages offer the opportunity to build and deploy pure Python, production-ready data platforms. Engineers can and do play a big role in helping companies become data-driven by centralising this data, cleaning and modelling it and presenting back to the business. Now more than ever it allows engineers and companies of any size the ability to build data products and insights for relatively low cost. In this talk we’ll walk through the key components of this stack, tooling options available and demo a deployable containerised Python data stack.",
			"speakers": [
				"A7QPAE"
			],
			"track": 5211,
			"start": "2025-04-23T15:10:00+02:00",
			"end": "2025-04-23T15:55:00+02:00",
			"room": 3895,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.150556+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "F7RDPT",
			"id": 1181962,
			"title": "Building Reliable AI Agents for Publishing: A DSPy-Based Quality Assurance Framework",
			"abstract": "As publishers increasingly adopt AI agents for content generation and analysis, ensuring output quality and reliability becomes critical. This talk introduces a novel quality assurance framework built with DSPy that addresses the unique challenges of evaluating AI agents in publishing workflows. Using real-world examples from newsroom implementations, I will demonstrate how to design and implement systematic testing pipelines that verify factual accuracy, content consistency, and compliance with editorial standards. Attendees will learn practical techniques for building reliable agent evaluation systems that go beyond simple metrics to ensure AI-generated content meets professional publishing standards.",
			"speakers": [
				"AZ7FNH"
			],
			"track": 5213,
			"start": "2025-04-23T15:10:00+02:00",
			"end": "2025-04-23T15:40:00+02:00",
			"room": 3899,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.150538+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "GJ9MVT",
			"id": 1181964,
			"title": "Size matters: Inspecting Docker images for Efficiency and Security",
			"abstract": "Inspecting Docker images is crucial for building secure and efficient containers. In this session, we will analyze the structure of a Python-based Docker image using various tools, focusing on best practices for minimizing image size and reducing layers with multi-stage builds. We’ll also address common security pitfalls, including proper handling of build and runtime secrets.\r\n\r\nWhile this talk offers valuable insights for anyone working with Docker, it is especially beneficial for Python developers seeking to master clean and secure containerization techniques.",
			"speakers": [
				"BZY9AN"
			],
			"track": 5205,
			"start": "2025-04-23T15:10:00+02:00",
			"end": "2025-04-23T15:55:00+02:00",
			"room": 3894,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.150590+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "DQTMJB",
			"id": 1181961,
			"title": "Beyond Basic Prompting: Supercharging Open Source LLMs with LMQL's Structured Generation",
			"abstract": "This intermediate-level talk demonstrates how to leverage Language Model Query Language (LMQL) for structured generation and tool usage with open-source models like Llama. You will learn how to build a RAG system that enforces output constraints, handles tool calls, and maintains response structure - all while using open-source components. The presentation includes hands-on examples where audience members can experiment with LMQL prompts, showcasing real-world applications of constrained generation in production environments.",
			"speakers": [
				"QWNPUD"
			],
			"track": 5213,
			"start": "2025-04-23T15:10:00+02:00",
			"end": "2025-04-23T15:55:00+02:00",
			"room": 3897,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.150519+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "UVPALT",
			"id": 1181960,
			"title": "PDFs - When a thousand words are worth more than a picture (or table).",
			"abstract": "PDF, a must-have in RAG systems, ensures visual fidelity across platforms and devices, at the expense of compromising what would be the core condition for computers to properly process and interpret text: semantics. That means any logical arrangement of text, upon rendering, explodes into dummy visual shards of data that literally portrait the bigger picture for the human eye to perceive, but no longer convey the information computers should grasp. Such a bottleneck already makes proper ingestion of text-only documents a big challenge, let alone when tables or figures come into play, the ultimate nightmare for PDF parsers, not to say developers. The rest you must have already foreseen: a RAG system barfing unreliable knowledge from bad chunks (based on regular PDF parsing), if those ever get to be retrieved from a vector database. In this talk you can gather some vision-driven insights on how to leverage the strengths of PDF and language models towards good chunks to be ingested. Or, in other words, how multimodal models can go beyond trivial reverse engineering by decomposing tables into its building blocks, in plain language, as how those would be explained to another human; or better yet, as how humans would ask questions about such pieces of knowledge. And from such a strategy, we transfer the same rationale to figures. Come along, gather some insights, and get inspired to break down tables and figures from your own PDFs, and to improve retrieval in your RAG systems.",
			"speakers": [
				"9B8PQS"
			],
			"track": 5214,
			"start": "2025-04-23T15:10:00+02:00",
			"end": "2025-04-23T15:40:00+02:00",
			"room": 3898,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.150459+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "HVTSDP",
			"id": 1181969,
			"title": "Multivariate Datastrophe: Methods to Detect Obscure Drift in Your Production Data",
			"abstract": "Getting your model into production isn’t a trivial task, but it’s only half the battle. Ensuring that your model continues to deliver great performance over time is even more critical. In this talk I would like to present a selection of what can kill your model’s performance, zoom in on multivariate data drift, and present two methods to detect this type of drift in your production data.",
			"speakers": [
				"XXBKRT"
			],
			"track": 5205,
			"start": "2025-04-23T16:10:00+02:00",
			"end": "2025-04-23T16:40:00+02:00",
			"room": 3894,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.150667+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "NNGWGC",
			"id": 1181972,
			"title": "Mastering Demand Forecasting: Lessons from Europe's Largest Retailer",
			"abstract": "Ever craved your favorite dish, only to find its key ingredient missing from the store? You're not alone - stock outs can have significant consequences for businesses, resulting in frustrated customers and lost sales. On the other hand, overstocking can lead to wasted storage costs and potential write-offs. The replenishment system is responsible for striking the right balance between these opposing risks.\r\nThe key to successful replenishment is making accurate predictions about future demand. \r\n\r\nThis presentation takes a deep dive into the intricate world of demand forecasting, at Europe's largest retailer. We will demonstrate how enhancing simple machine learning methods with domain knowledge allows to generate hundreds of millions of high-quality forecasts every day.",
			"speakers": [
				"HHWHWK",
				"UFVRPX"
			],
			"track": 5212,
			"start": "2025-04-23T16:10:00+02:00",
			"end": "2025-04-23T16:40:00+02:00",
			"room": 3893,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.150710+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "LYDDDC",
			"id": 1181974,
			"title": "Building Serverless Python AI skills as WASM components",
			"abstract": "Frameworks like llama-stack and langchain allow for quick prototyping of generative AI applications. However, companies often struggle to deploy these applications into production quickly. This talk explores the design of a Python SDK that enables the development of AI skills in Python and their compilation into WebAssembly (WASM) components, targeting a specific host runtime that offers interfaces for interacting with LLMs and associated tooling.",
			"speakers": [
				"LGPEHF"
			],
			"track": 5214,
			"start": "2025-04-23T16:10:00+02:00",
			"end": "2025-04-23T16:40:00+02:00",
			"room": 3900,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.150739+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "RLTZTC",
			"id": 1181967,
			"title": "How to use Data Science Superpowers in real life, a Bayesian perspective",
			"abstract": "In the data science field, we use all these powerful methods to solve important problems. Most of the time, we do this very well because our data science and machine-learning toolbox fits the problems we tackle quite precisely. Yet, what about our everyday choices or even our most important life decisions? Can we use for our private lives what we advocate for in our jobs or are these choices inherently different?\r\nMany of this real life decisions are a little different than textbook machine-learning problems. There is often less or hard-to-come-by data and the decisions are infrequent, but sometimes very consequential. This talk will dive into what makes everyday decisions difficult to handle with our data science toolbox. It will show how Bayesian thinking can help to reason in such cases, especially when there is not a lot of data to rely on.",
			"speakers": [
				"VFC8XU"
			],
			"track": 5212,
			"start": "2025-04-23T16:10:00+02:00",
			"end": "2025-04-23T16:40:00+02:00",
			"room": 3895,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.150638+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "NPMNCE",
			"id": 1181968,
			"title": "Driving Trust and Fairness: Addressing Ethical Challenges in Transportation through Explainable AI",
			"abstract": "Machine Learning can transform transportation—improving safety, optimizing routes, and reducing delays—yet it also presents ethical concerns. From potential algorithmic bias to opaque decision-making processes, trust and fairness are at stake. In this talk,I will show how Explainable AI (XAI) can offer practical solutions to these ethical dilemmas. Instead of focusing on the technical underpinnings, we will discuss how transparency, accountability, and fairness can be enhanced in AI-driven transportation systems. Using a real-world example, I will demonstrate how XAI provides the groundwork for building ethical, trustworthy, and socially responsible AI solutions in public transportation systems.",
			"speakers": [
				"LMCW3N"
			],
			"track": 5218,
			"start": "2025-04-23T16:10:00+02:00",
			"end": "2025-04-23T16:40:00+02:00",
			"room": 3898,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.150653+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "FGEUJJ",
			"id": 1181973,
			"title": "Conformal Prediction: uncertainty quantification to humanise models",
			"abstract": "Quantifying model uncertainties is critical to improve model reliability and make sound decisions. Conformal Prediction is a framework for uncertainty quantification that provides mathematical guarantees of true outcome coverage, allowing more informed decisions to be made by stakeholders",
			"speakers": [
				"FRRAE7"
			],
			"track": 5212,
			"start": "2025-04-23T16:10:00+02:00",
			"end": "2025-04-23T16:40:00+02:00",
			"room": 3901,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.150724+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "CMTKZS",
			"id": 1181971,
			"title": "Deploying Synchronous and Asynchronous Django Applications for Hobby Projects",
			"abstract": "Simplify deploying hybrid Django applications with synchronous views and asynchronous apps. This session covers ASGI support, Docker containerization, and Kamal for seamless, zero-downtime deployments on single-server setups, ideal for hobbyists and small-scale projects.",
			"speakers": [
				"XDSGYW"
			],
			"track": 5210,
			"start": "2025-04-23T16:10:00+02:00",
			"end": "2025-04-23T16:40:00+02:00",
			"room": 3899,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.150695+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "MSUCAS",
			"id": 1181970,
			"title": "Beyond FOMO — Keeping Up-to-Date in AI",
			"abstract": "The rapid evolution of AI technologies, particularly since the emergence of Large Language Models, has transformed the data science landscape from a field of steady progress to one of constant breakthroughs. This acceleration creates unique challenges for practitioners, from managing FOMO to battling imposter syndrome. Drawing from personal experience transitioning from mathematical modeling to modern AI development, this talk explores practical strategies for staying current while maintaining sanity. We'll discuss building effective learning structures, creating collaborative knowledge-sharing environments, and finding the right balance between innovation and implementation. Attendees will leave with actionable insights on navigating technological change while fostering sustainable growth in their teams and careers.",
			"speakers": [
				"CFQECP"
			],
			"track": 5292,
			"start": "2025-04-23T16:10:00+02:00",
			"end": "2025-04-23T16:40:00+02:00",
			"room": 3897,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.150681+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "7CAVX7",
			"id": 1181966,
			"title": "Jeannie: An Agentic Field Worker Assistant",
			"abstract": "Jeannie is an LLM-based agentic workflow implemented in Python to automate task management for field workers in the energy sector. This system addresses inefficiencies and safety risks in tasks like PV panel installation and powerline repair.\r\n\r\nUsing open-source tools (LangChain family, OpenStreetMap and OpenWeatherMap APIs), Jeannie retrieves tasks, fetches weather and directions, identifies past incidents via RAG, and emails tailored reports with safety warnings.\r\n\r\nThis presentation offers a case study of Jeannie’s implementation for E.ON in Germany, demonstrating how daily task automation enhances worker safety and efficiency. Attendees will discover how to create agentic systems with Python, integrate APIs, and apply RAG for safety applications, with access to open-source code and data for replicating the workflow.",
			"speakers": [
				"9Q7SVE",
				"K7FQ7S"
			],
			"track": 5214,
			"start": "2025-04-23T16:10:00+02:00",
			"end": "2025-04-23T16:40:00+02:00",
			"room": 3896,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.150623+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"id": 1181977,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-23T14:40:00Z",
			"end": "2025-04-23T17:10:00+02:00",
			"room": 3893
		},
		{
			"id": 1181982,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-23T14:40:00Z",
			"end": "2025-04-23T17:10:00+02:00",
			"room": 3900
		},
		{
			"id": 1181980,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-23T14:40:00Z",
			"end": "2025-04-23T17:10:00+02:00",
			"room": 3898
		},
		{
			"id": 1181978,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-23T14:40:00Z",
			"end": "2025-04-23T17:10:00+02:00",
			"room": 3895
		},
		{
			"id": 1181979,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-23T14:40:00Z",
			"end": "2025-04-23T17:10:00+02:00",
			"room": 3894
		},
		{
			"id": 1181975,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-23T14:40:00Z",
			"end": "2025-04-23T17:10:00+02:00",
			"room": 3899
		},
		{
			"id": 1181981,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-23T14:40:00Z",
			"end": "2025-04-23T17:10:00+02:00",
			"room": 3901
		},
		{
			"id": 1181976,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-23T14:40:00Z",
			"end": "2025-04-23T17:10:00+02:00",
			"room": 3896
		},
		{
			"id": 1181983,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-23T14:40:00Z",
			"end": "2025-04-23T17:10:00+02:00",
			"room": 3897
		},
		{
			"code": "TYXMZC",
			"id": 1181992,
			"title": "Guiding data minds: how mentoring transforms careers for both sides",
			"abstract": "Mentorship is a powerful way to shape careers while building meaningful connections in the data field. In this talk, I’ll share my journey as a professional mentor, what the role entails, and the impact it has on both mentees and mentors. Learn how mentorship drives growth, fosters innovation, and creates value for the data community—and why you should consider stepping into this rewarding role.",
			"speakers": [
				"BJ3JTQ"
			],
			"track": 5217,
			"start": "2025-04-23T17:10:00+02:00",
			"end": "2025-04-23T17:40:00+02:00",
			"room": 3894,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151060+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "GGJDTW",
			"id": 1181991,
			"title": "Generative-AI: Usecase-Specific Evaluation of LLM-powered Applications",
			"abstract": "This talk addresses the critical need for use case-specific evaluation of Large Language Model (LLM)-powered applications, highlighting the limitations of generic evaluation benchmarks in capturing domain-specific requirements. It proposes a workflow for designing evaluation pipelines to optimize LLM-based applications, consisting of three key activities: human-expert evaluation and benchmark dataset curation, creation of evaluation agents, and alignment of these agents with human evaluations using the curated datasets. The workflow produces two key outcomes: a curated benchmark dataset for testing LLM applications and an evaluation agent that scores their responses. The presentation further addresses the limitations, and best practices to enhance the reliability of evaluations, ensuring LLM applications are better tailored to specific use cases.",
			"speakers": [
				"AU3UXW"
			],
			"track": 5213,
			"start": "2025-04-23T17:10:00+02:00",
			"end": "2025-04-23T17:40:00+02:00",
			"room": 3896,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151044+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "7RLYSQ",
			"id": 1181989,
			"title": "Secure “Human in the Loop” Interactions for AI Agents",
			"abstract": "Explore the power of Human-in-the-Loop (HITL) for GenAI agents! Learn how to build AI systems that augment your abilities, not replace your judgment, especially when high-stakes actions are involved. This session will focus on practical implementation using Python and Langchain to stay in control.",
			"speakers": [
				"7HCKTC"
			],
			"track": 5214,
			"start": "2025-04-23T17:10:00+02:00",
			"end": "2025-04-23T17:40:00+02:00",
			"room": 3897,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151012+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "ZHT9HW",
			"id": 1181986,
			"title": "Information Retrieval Without Feeling Lucky: The Art and Science of Search",
			"abstract": "Search is everywhere, yet effective Information Retrieval remains one of the most underestimated challenges in modern technology. While Retrieval-Augmented Generation has captured significant attention, the foundational element - Information Retrieval - often remains underexplored. \r\n\r\nIn this talk, we put Information Retrieval center stage by asking: \r\nHow do we know that user queries and data 'speak' the same language?\r\nHow do we evaluate the relevance and completeness of search results? And how do we prioritize what gets displayed? Or do we even want to hide specific content?\r\n\r\nWe try to answer these questions by introducing the audience to the art and science of Information Retrieval, exploring metrics such as precision, recall, and desirability. We’ll examine key challenges, including ambiguity, query relaxation, and the interplay between sparse and dense search techniques. Through a live demo using public content from Sendung mit der Maus, we show how hybrid search improves upon vector and keyword based search in isolation.",
			"speakers": [
				"L7SDGZ"
			],
			"track": 5221,
			"start": "2025-04-23T17:10:00+02:00",
			"end": "2025-04-23T17:40:00+02:00",
			"room": 3895,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.150967+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "CRNJWQ",
			"id": 1181985,
			"title": "Supercharge Your Testing with inline-snapshot",
			"abstract": "Snapshot tests are invaluable when you are working with large, complex, or frequently changing expected values in your tests.\r\nIntroducing inline-snapshot, a Python library designed for snapshot testing that integrates seamlessly with pytest, allowing you to embed snapshot values directly within your source code.\r\nThis approach not only simplifies test management but also boosts productivity by improving the maintenance of the tests.\r\nIt is particularly useful for integration testing and can be used to write your own abstractions to test complex Apis.",
			"speakers": [
				"B7CMVH"
			],
			"track": 5209,
			"start": "2025-04-23T17:10:00+02:00",
			"end": "2025-04-23T17:40:00+02:00",
			"room": 3900,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.150952+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "VJR39N",
			"id": 1181990,
			"title": "Citation is Collaboration: Software Recognition in Research and Industry",
			"abstract": "The development of open source software is increasingly recognized as a critical contribution across many disciplines, yet the mechanisms for credit and citation vary significantly. This talk uses astronomy as a case study to explore shared challenges in attributing software contributions across research and industry. It will review the evolution of journal recommendations and policies over the past decade, alongside emerging publishing practices offering insights into their impact on the recognition of software contributions. An analysis of citation patterns for widely used libraries (numpy, scipy, astropy) highlights trends over time and their dependence on publication venues and policies. The talk will conclude with strategies for both developers and users for improving the recognition of software, fostering collaboration and sustainability in software ecosystems. All data and analysis code will be made available in a public repository, supporting transparency and further study.",
			"speakers": [
				"LAMEH3"
			],
			"track": 5291,
			"start": "2025-04-23T17:10:00+02:00",
			"end": "2025-04-23T17:40:00+02:00",
			"room": 3901,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151028+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "M98YBR",
			"id": 1181988,
			"title": "Enhancing Software Supply Chain Security with Open Source Python Tools",
			"abstract": "The Cyber Resilience Act (CRA) is focused on improving the security and resilience of digital products. But to comply with the CRA, businesses will need to start preparing the necessary evidence to ensure compliance if they want to continue to deliver digital products to the EU market once the CRA is in force. \r\n\r\nKey requirements within the CRA include implementing robust security measures throughout the product life-cycle, adopting secure development practices and implementing proactive vulnerability management processes.\r\n\r\nThis session will show how a number of the requirements for the CRA can be achieved by use of a number of open source Python tools.",
			"speakers": [
				"ERZXBC"
			],
			"track": 5208,
			"start": "2025-04-23T17:10:00+02:00",
			"end": "2025-04-23T17:40:00+02:00",
			"room": 3898,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.150997+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "FUX3FR",
			"id": 1181987,
			"title": "Conquering PDFs: document understanding beyond plain text",
			"abstract": "NLP and data science could be so easy if all of our data came as clean and plain text. But in practice, a lot of it is hidden away in PDFs, Word documents, scans and other formats that have been a nightmare to work with. In this talk, I'll present a new and modular approach for building robust document understanding systems, using state-of-the-art models and the awesome Python ecosystem. I'll show you how you can go from PDFs to structured data and even build fully custom information extraction pipelines for your specific use case.",
			"speakers": [
				"FZKG9N"
			],
			"track": 5213,
			"start": "2025-04-23T17:10:00+02:00",
			"end": "2025-04-23T17:40:00+02:00",
			"room": 3893,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.150982+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "U9KHNA",
			"id": 1181984,
			"title": "Getting Started with Bayes in Engineering: Implementing Kalman Filters with RxInfer.jl",
			"abstract": "Bayesian methods are not commonly seen in Civil Engineering and Structural Dynamics. In this talk we explore how RxInfer.jl and the Julia Programming Language can simplify Bayesian modeling by implementing a Kalman filter for tracking the dynamics of a structural system. Perfect for engineers, researchers, and data scientists eager to apply probabilistic modelling and Bayesian methods to real-world engineering challenges.",
			"speakers": [
				"N7S8VF"
			],
			"track": 5291,
			"start": "2025-04-23T17:10:00+02:00",
			"end": "2025-04-23T17:40:00+02:00",
			"room": 3899,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.150937+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "GURXPK",
			"id": 1181995,
			"title": "Is Prompt Engineering Dead? How Auto-Optimization is Changing the Game",
			"abstract": "The rise of LLMs has elevated prompt engineering as a critical skill in the AI industry, but manual prompt tuning is often inefficient and model-specific. This talk explores various automatic prompt optimization approaches, ranging from simple ones like bootstrapped few-shot to more complex techniques such as MIPRO and TextGrad, and showcases their practical applications through frameworks like DSPy and AdalFlow. By exploring the benefits, challenges, and trade-offs of these approaches, the attendees will be able to answer the question: is prompt engineering dead, or has it just evolved?",
			"speakers": [
				"EACXYX",
				"NWAQCX"
			],
			"track": 5213,
			"start": "2025-04-23T17:50:00+02:00",
			"end": "2025-04-23T18:20:00+02:00",
			"room": 3893,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151120+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "8S3RC3",
			"id": 1181998,
			"title": "Build a personalized Commute agent in Python with Hopsworks, LangGraph and LLM Function Calling",
			"abstract": "The invention of the clock and the organization of time in zones have helped synchronize human activities across the globe. While timekeepers are better at planning and sticking to the plan, time optimists somehow believe that time is malleable and extends the closer the deadline. Nevertheless, whether you are an organized timekeeper or a creative timebender, external factors can affect your commute.\r\n\r\nIn this talk, we will define the different components necessary to build a personalized commute virtual agent in Python. The agent will help you analyze your historical lateness records, estimate future delays, and suggest the best time to leave home based on these predictions. It will be powered by a LLM and will use a technique called Function Calling to recognize the user intent from the conversation history and provide informed answers.",
			"speakers": [
				"RUSBZM"
			],
			"track": 5211,
			"start": "2025-04-23T17:50:00+02:00",
			"end": "2025-04-23T18:20:00+02:00",
			"room": 3901,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151261+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "NBFH7G",
			"id": 1181996,
			"title": "Streamlining the Cosmos: Pythonic Workflow Management for Astronomical Analysis",
			"abstract": "Astronomical surveys are growing rapidly in complexity and scale, necessitating accurate, efficient, and reproducible reduction and analysis pipelines. In this talk we explore Pythonic workflow managers to streamline processing large datasets on distributed computing environments.\r\n\r\nModern astronomy generates vast datasets across the electromagnetic spectrum. NASA's flagship James Webb Space Telescope (JWST) provides unprecedented observations that enable deep studies of distant galaxies, cosmic structures, and other astrophysical phenomena. However, these datasets are complex and require intricate calibration and analysis pipelines to transform raw data into meaningful scientific insights.\r\n\r\nWe will discuss the development and deployment of Pythonic tools, including snakemake and pixi, to construct modular, parallelized workflows for data reduction and analysis. Attendees will learn how these tools automate complex processing steps, optimize performance in distributed computing environments, and ensure reproducibility. Using real-world examples, we will illustrate how these workflows simplify the journey from raw data to actionable scientific insights.",
			"speakers": [
				"QHTKP7"
			],
			"track": 5215,
			"start": "2025-04-23T17:50:00+02:00",
			"end": "2025-04-23T18:20:00+02:00",
			"room": 3899,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151172+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "J7YKEE",
			"id": 1182001,
			"title": "From Idea to Integration: An Intro to the Model Context Protocol (MCP)",
			"abstract": "The Model Context Protocol (MCP) has emerged as a standard for connecting Large Language Models with diverse data sources and enabling interactions with other systems. In this talk, we’ll introduce the MCP standard and demonstrate how to build a MCP Server using real world examples. We’ll then explore its applications, showing how it empowers developers and makes data from complex systems accessible to non-technical users. Finally, we’ll dive into recent protocol updates, including improvements to Streamable HTTP transport and security enhancements, and share practical strategies for deploying MCP servers as well as clients.",
			"speakers": [
				"PTZEZA"
			],
			"track": 5214,
			"start": "2025-04-23T17:50:00+02:00",
			"end": "2025-04-23T18:20:00+02:00",
			"room": 3896,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151316+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "PNQB7C",
			"id": 1182000,
			"title": "Zero Code Change Acceleration: familiar interfaces and high performance",
			"abstract": "The PyData ecosystem is home to some of the best and most popular tools for doing data-science. Every data-scientist alive today has used pandas and scikit-learn and even Large Language Models know how to use them! For many years there have also been alternative implementations with similar interfaces and libraries with completely new approaches that focus on achieving the ultimate in performance and hardware acceleration. This talk will look at the recent efforts to give users the best of both worlds: a familiar and widely used interface as well as high performance.",
			"speakers": [
				"G9FDBT"
			],
			"track": 5215,
			"start": "2025-04-23T17:50:00+02:00",
			"end": "2025-04-23T18:20:00+02:00",
			"room": 3900,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151300+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "BLKYGU",
			"id": 1181999,
			"title": "Streamlining Python deployment with Pixi: A Perspective from production",
			"abstract": "In our quest to improve Python deployments, we explored Pixi, a tool designed to enhance dependency management within the Conda ecosystem. This talk recounts our experience integrating Pixi into a setup used in production. We leveraged Pixi to create lockfiles, ensuring consistent builds, and to automate deployments via CI/CD pipelines. This integration led to greater reliability and efficiency, minimizing deployment errors and allowing us to concentrate more on development. Join us as we share how Pixi transformed our deployment process and offer insights into optimizing your own workflows.",
			"speakers": [
				"CSHKRY"
			],
			"track": 5205,
			"start": "2025-04-23T17:50:00+02:00",
			"end": "2025-04-23T18:20:00+02:00",
			"room": 3897,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151281+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "AWPYGE",
			"id": 1181994,
			"title": "The earth is no longer flat - introducing support for spherical geometries in Spherely and GeoPandas",
			"abstract": "The geometries in GeoPandas, using the Shapely library, are assumed to be in projected coordinates on a flat plane. While this approximation is often just fine, for global data this runs into its limitations. This presentation introduces spherely, a Python library for working with vector geometries on the sphere, and its integration into GeoPandas.",
			"speakers": [
				"7VUXWM"
			],
			"track": 5215,
			"start": "2025-04-23T17:50:00+02:00",
			"end": "2025-04-23T18:20:00+02:00",
			"room": 3894,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151105+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "FGFFEE",
			"id": 1181993,
			"title": "🦀 Rüstzeit: Asynchronous Concurrency in Python & Rust",
			"abstract": "Many Python developers are enhancing their Rust knowledge and want to take the next step in translating their understanding of advanced concepts like asynchronous programming. \r\n\r\nIn this talk, I'll help you take that step by juxtaposing Python's asyncio with Rust's async ecosystems, tokio and async-std. Through real-world examples and insights from conversations with graingert, co-author of Python's Anyio, we'll explore how each language approaches asynchronous execution, highlighting similarities and differences in syntax, performance, and ecosystem support. \r\n\r\nThis talk aims to persuade you that by leveraging Rust's powerful type system and compiler guarantees, we can build fast, reliable async code that's less prone to race conditions and concurrency bugs. Whether you're a Pythonista venturing into Rust or a Rustacean curious about Python's concurrency model, this session will provide practical insights to help you navigate async programming across both languages.\r\n\r\nWelcome to Rüstzeit: Prepare to navigate async programming across both ecosystems.",
			"speakers": [
				"UD3JDR"
			],
			"track": 5393,
			"start": "2025-04-23T17:50:00+02:00",
			"end": "2025-04-23T18:20:00+02:00",
			"room": 3895,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151089+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "F9EFXA",
			"id": 1181997,
			"title": "Modern NLP for Proactive Harmful Content Moderation",
			"abstract": "Despite an array of regulations implemented by governments and social media platforms worldwide (i.e. famous DSA), the problem of digital abusive speech persists. At the same time, rapid advances in NLP and large language models (LLMs) are opening up new possibilities—and responsibilities—for using this technology to make a positive social impact. Can LLMs streamline content moderation efforts? Are they effective at spotting and countering hate speech, and can they help produce more proactive solutions like text detoxification and counter-speech generation?\r\n\r\nIn this talk, we will dive into the cutting-edge research and best practices of automatic textual content moderation today. From clarifying core definitions to detailing actionable methods for leveraging multilingual NLP models, we will provide a practical roadmap for researchers, developers, and policymakers aiming to tackle the challenges of harmful online content. Join us to discover how modern NLP can foster safer, more inclusive digital communities.",
			"speakers": [
				"937CJZ"
			],
			"track": 5213,
			"start": "2025-04-23T17:50:00+02:00",
			"end": "2025-04-23T18:20:00+02:00",
			"room": 3898,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151188+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"id": 1182002,
			"title": {
				"en": "Lightning Talks"
			},
			"start": "2025-04-23T16:30:00Z",
			"end": "2025-04-23T19:20:00+02:00",
			"room": 3893
		},
		{
			"code": "VC3T39",
			"id": 1182003,
			"title": "Mini-Pythonistas: Coding, Experimenting, and Exploring with Zümi!",
			"abstract": "Please note, this is a children's workshop. Recommended age 10-16 years. Experienced use of keyboard and mouse, first words in English (for programming) are required. // \r\n\r\nWelcome, mini-Pythonistas! In this workshop, we’ll dive into the world of Zümi, a programmable car that’s much more than just wheels and motors. With built-in sensors, lights, and a camera, Zümi can learn to recognize colors, respond to gestures, and even identify faces — all with your help!",
			"speakers": [
				"8ZRD8E",
				"9CX9CB",
				"MFBP3R",
				"CZVWXB"
			],
			"track": 5290,
			"start": "2025-04-24T09:00:00+02:00",
			"end": "2025-04-24T12:00:00+02:00",
			"room": 3973,
			"duration": 180,
			"updated": "2025-04-09T08:21:33.151356+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"id": 1182004,
			"title": {
				"en": "Announcements"
			},
			"start": "2025-04-24T07:00:00Z",
			"end": "2025-04-24T09:05:00+02:00",
			"room": 3893
		},
		{
			"code": "EGNBHD",
			"id": 1182005,
			"title": "Chasing the Dark Universe with Euclid and Python: Unveiling the Secrets of the Cosmos",
			"abstract": "The ESA Euclid mission, launched in July 2023, is on a quest to unravel the mysteries of dark energy and dark matter: the enigmatic components that make up 95% of the Universe. By mapping one-third of the sky with unprecedented precision, Euclid is building the largest 3D map of the cosmos.\r\n\r\nThis talk explores how cosmologists bridge theory and and Euclid observation to reveal the hidden nature of dark energy and the dark matter. We will delve into the challenges of cosmological inference, where advanced statistical methods and Python-based pipelines compare theoretical models against Euclid's vast datasets, and we will explain how Bayesian inference, machine learning, and state-of-the-art simulations are revolutionizing our understanding of the cosmos.",
			"speakers": [
				"BH89AW"
			],
			"track": 5223,
			"start": "2025-04-24T09:05:00+02:00",
			"end": "2025-04-24T09:50:00+02:00",
			"room": 3893,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.151394+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"id": 1182014,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-24T07:50:00Z",
			"end": "2025-04-24T10:15:00+02:00",
			"room": 3901
		},
		{
			"id": 1182006,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-24T07:50:00Z",
			"end": "2025-04-24T10:15:00+02:00",
			"room": 4084
		},
		{
			"id": 1182010,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-24T07:50:00Z",
			"end": "2025-04-24T10:15:00+02:00",
			"room": 3897
		},
		{
			"id": 1182011,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-24T07:50:00Z",
			"end": "2025-04-24T10:15:00+02:00",
			"room": 3898
		},
		{
			"id": 1182013,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-24T07:50:00Z",
			"end": "2025-04-24T10:15:00+02:00",
			"room": 3900
		},
		{
			"id": 1182012,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-24T07:50:00Z",
			"end": "2025-04-24T10:15:00+02:00",
			"room": 3893
		},
		{
			"id": 1182009,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-24T07:50:00Z",
			"end": "2025-04-24T10:15:00+02:00",
			"room": 3894
		},
		{
			"id": 1182007,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-24T07:50:00Z",
			"end": "2025-04-24T10:15:00+02:00",
			"room": 3899
		},
		{
			"id": 1182015,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-24T07:50:00Z",
			"end": "2025-04-24T10:15:00+02:00",
			"room": 3896
		},
		{
			"id": 1182008,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-24T07:50:00Z",
			"end": "2025-04-24T10:15:00+02:00",
			"room": 3895
		},
		{
			"code": "ZACM3E",
			"id": 1182021,
			"title": "Design, Generate, Deploy: Contract-First with FastAPI",
			"abstract": "This talk explores a contract-first approach to API development using the OpenAPI generator, a powerful tool for automating API generation from a standardized specification. We will cover (1) what would you need to run to have a standard implementation of the FastAPI endpoints and data models; (2) how to customize the mustache templates that are used to generate the API stubs; (3) share some ideas how to customize the CLI and (4) how to maintain the contract and how to handle breaking changes to the contract. We will close the session with a discussion of the challenges of implementing the OpenAPI generator.",
			"speakers": [
				"NUFKS8",
				"93VSJ9"
			],
			"track": 5205,
			"start": "2025-04-24T10:15:00+02:00",
			"end": "2025-04-24T10:45:00+02:00",
			"room": 3894,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151717+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "KCSSJ7",
			"id": 1182016,
			"title": "Multi-tenant Conversational Analytics",
			"abstract": "Ever wondered how to use GenAI to enable self-service analytics through prompting? In this talk, I will share my experience of building a multi-tenant conversational analytics set-up that is built into a Software-as-a-Service (SaaS) platform. This talk is intended for AI engineers, data scientists, software engineers and anyone interested in using GenAI to power conversational analytics using open-source tools. \r\n\r\nI will discuss the challenges faced in designing and implementing, as well as the lessons learned along the way. We'll answer questions such as, why offer analytics through prompting? Why multi-tenancy and makes it so difficult? How to build it into an existing product? What makes open-source the preferred choice over proprietary solutions? What could the implications be for the analytics field?",
			"speakers": [
				"97XB7E"
			],
			"track": 5213,
			"start": "2025-04-24T10:15:00+02:00",
			"end": "2025-04-24T10:45:00+02:00",
			"room": 3899,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151596+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "XB8VG7",
			"id": 1182025,
			"title": "Career Path Experience Stories",
			"abstract": "As part of the PyConDE & PyData 2025 Conference, we would like to organize an initiative aimed primarily at students and those just starting their careers in computer science. Our goal is to showcase the diverse career paths possible and break some myths about typical job skills and responsibilities relevant, so as to inspire and encourage their journey.\r\nWe are looking for volunteers willing to give a short talk (5-10 minutes) about their career path, the key decisions that shaped their growth, and how these experiences have influenced their work in computer science.\r\nThis initiative will take place on [Day] at [Time], and we would love to feature some of our speakers who have inspiring and perspective stories to share with the next generation of computer scientists.\r\nIf you are interested in giving a short presentation, please reply to this message—we would love to have you on board!\r\nThank you very much for considering this opportunity. We truly hope this initiative will come to life thanks to the generosity of volunteers like you and the power of your stories.",
			"speakers": [
				"J7LMZG"
			],
			"track": 5292,
			"start": "2025-04-24T10:15:00+02:00",
			"end": "2025-04-24T11:45:00+02:00",
			"room": 3901,
			"duration": 90,
			"updated": "2025-04-09T08:21:33.151813+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "LQA9EJ",
			"id": 1182019,
			"title": "Talk by Exasol",
			"abstract": "We’re currently waiting for the speaker to update the page. As soon as the speaker refreshes or makes changes, the content you’re looking for will appear here automatically. There’s no need to reload—just hang tight for a moment. If you’re seeing this message, it means the session is still being prepared or updated. Thanks for your patience while we wait for the latest information to arrive. Everything will show up as soon as it’s ready!",
			"speakers": [],
			"track": null,
			"start": "2025-04-24T10:15:00+02:00",
			"end": "2025-04-24T10:45:00+02:00",
			"room": 3897,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151643+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "TRUUVL",
			"id": 1182024,
			"title": "Scaling Python: An End-to-End ML Pipeline for ISS Anomaly Detection with Kubeflow",
			"abstract": "Building and deploying scalable, reproducible machine learning pipelines can be challenging, especially when working with orchestration tools like Slurm or Kubernetes. In this talk, we demonstrate how to create an end-to-end ML pipeline for anomaly detection in International Space Station (ISS) telemetry data using only Python code.\r\n\r\nWe show how Kubeflow Pipelines, MLFlow, and other open-source tools enable the seamless orchestration of critical steps: distributed preprocessing with Dask, hyperparameter optimization with Katib, distributed training with PyTorch Operator, experiment tracking and monitoring with MLFlow, and scalable model serving with KServe. All these steps are integrated into a holistic Kubeflow pipeline.\r\n\r\nBy leveraging Kubeflow's Python SDK, we simplify the complexities of Kubernetes configurations while achieving scalable, maintainable, and reproducible pipelines. This session provides practical insights, real-world challenges, and best practices, demonstrating how Python-first workflows empower data scientists to focus on machine learning development rather than infrastructure.",
			"speakers": [
				"RL9F37",
				"VNRJDV"
			],
			"track": 5205,
			"start": "2025-04-24T10:15:00+02:00",
			"end": "2025-04-24T10:45:00+02:00",
			"room": 3898,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151797+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "SZFRRA",
			"id": 1182020,
			"title": "Unforgettable, that's what you are: Evaluating Machine Unlearning and Forgetting",
			"abstract": "Can deep learning/AI models forget? In this talk, you'll explore the realm of machine unlearning, where researchers and practitioners aim to remove memorized examples from machine learning models. This is relevant for training increasingly overparameterized models and growing GDPR/Privacy concerns with large scale model development and use.",
			"speakers": [
				"K9B9W9"
			],
			"track": 5212,
			"start": "2025-04-24T10:15:00+02:00",
			"end": "2025-04-24T10:45:00+02:00",
			"room": 3895,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151663+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "TQN98D",
			"id": 1182018,
			"title": "Algorithmic Music Composition With Python",
			"abstract": "Computers have long been an integral part of creating music. Virtual instruments and digital audio workstations make creating music easy and accessible. But how do programming languages and especially Python fit into this? Python can serve as a tool for creating musical notation\r\nand MIDI files. \r\n\r\nThroughout the session, you’ll learn how to:\r\n\r\n- Use Python to create melodies, harmonies, and rhythms.\r\n- Generate music based on rules, randomness, and mathematical principles.\r\n- Visualize and export your compositions as MIDI and sheet music.\r\n\r\nBy the end of the talk, you’ll have a clear understanding of how to turn simple algorithms into expressive musical works.",
			"speakers": [
				"J9DJ83"
			],
			"track": 5207,
			"start": "2025-04-24T10:15:00+02:00",
			"end": "2025-04-24T10:45:00+02:00",
			"room": 3893,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151627+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "TMBTYH",
			"id": 1182022,
			"title": "BayBE: A Bayesian Back End for Experimental Planning in the Low-To-No-Data Regime",
			"abstract": "From coffee machine settings to chemical reactions to website AB testing - iterative make-test-learn cycles are ubiquitous. The [Bayesian Back End](https://emdgroup.github.io/baybe/stable/) (BayBE) is an open-source experimental planner enabling users to smartly navigate such black-box optimization problems in iterative settings. This tutorial will i) introduce the core concepts enabled by combining Bayesian optimization and machine learning; ii) explain our software design choices, robust tests and open-source libraries this is built on; and iii) provide a short practical hands-on session.",
			"speakers": [
				"9AMQEB",
				"ZLLGER",
				"LSUVUD"
			],
			"track": 5215,
			"start": "2025-04-24T10:15:00+02:00",
			"end": "2025-04-24T11:45:00+02:00",
			"room": 3900,
			"duration": 90,
			"updated": "2025-04-09T08:21:33.151752+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "PW3VKG",
			"id": 1182023,
			"title": "Building versatile operating setups for real world use and testing with Python and the Raspberry Pi",
			"abstract": "**Rosenxt** is the host of a number of ventures aiming to provide next level solutions for demanding problems in a variety of industries based on decades of engineering excellence.\r\n\r\nSome of them address challenges in water environments ranging from water pipelines to offshore applications.\r\nAs differing as these areas may seem, regarding the solutions we build for them they have a lot in common.\r\n\r\nWhether its the necessary power supply, movement and steering concepts or sensing approaches.\r\nAll of them benefit from generalized, smart solutions that we design as components that can later be orchestrated and configured in various setups to fulfill quite different purposes.\r\n\r\nThis presentation explores the versatility of leveraging a Raspberry Pi based hardware platform combined with a Python based application stack to bridge development and deployment of various basic components, such as motors and motor controllers, lift foils, steering units and controls.\r\nBy utilizing a unified platform, we demonstrate how the same system can seamlessly transition from test bench measurements during hardware component development to real-world applications for various industries.\r\n\r\nThe talk highlights how this approach can create a robust framework to help streamlining workflows, enhance scalability and reduce costs.",
			"speakers": [
				"DUSVE9"
			],
			"track": 5290,
			"start": "2025-04-24T10:15:00+02:00",
			"end": "2025-04-24T10:45:00+02:00",
			"room": 3896,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151779+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "WELCVS",
			"id": 1182017,
			"title": "Probably Fun: Board Games to teach Data Science",
			"abstract": "In this tutorial, you will speed-date with board and card games that can be used to teach Data Science. You will play one game for 15 minutes, reflect on the Data Science concepts it involves, and then rotate to the next table. \r\n\r\nAs a result, you will experience multiple ideas that you can use to make complex ideas more understandable and enjoyable. We would like to demonstrate how gamification can not only used to produce short puzzles and quizzes, but also as a tool to reason complex problem-solving strategies.\r\n\r\nWe will bring a set of carefully selected games that have been proven effective in teaching statistics, programming, machine learning and other Data Science skills. We also believe that it is probably fun to participate in this tutorial.",
			"speakers": [
				"9EPNQG",
				"WVNMPG"
			],
			"track": 5292,
			"start": "2025-04-24T10:15:00+02:00",
			"end": "2025-04-24T11:45:00+02:00",
			"room": 4084,
			"duration": 90,
			"updated": "2025-04-09T08:21:33.151611+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "K9ACTV",
			"id": 1182027,
			"title": "Safeguard your precious API endpoints built on FastAPI using OAuth 2.0",
			"abstract": "Is implementing authorization on your API endpoints an afterthought? Who should have access to your API endpoints? Is it secure? This talk covers using OAuth 2.0 to secure API endpoints built on FastAPI following industry-recognized best practices. Come on a journey with me from taking your API endpoints to being functional AND secure. When you follow secure identity standards, you’ll be equipped with a deeper understanding of the critical need for authorization.",
			"speakers": [
				"KZSJAZ"
			],
			"track": 5208,
			"start": "2025-04-24T10:55:00+02:00",
			"end": "2025-04-24T11:25:00+02:00",
			"room": 3893,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151866+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "3WLDMQ",
			"id": 1182026,
			"title": "Navigating the Security Maze: An Interactive Adventure",
			"abstract": "How to integrate security into a software development project? Without jeopardizing timeline or budget? You decide! \r\nThis interactive session covers crucial decisions for software security, and the audience decides how the story ends...",
			"speakers": [
				"DS3TQU"
			],
			"track": 5208,
			"start": "2025-04-24T10:55:00+02:00",
			"end": "2025-04-24T11:25:00+02:00",
			"room": 3899,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151838+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "UXTCZC",
			"id": 1182029,
			"title": "Oh, no! Users love my GenAI-Prototype and want to use it more.",
			"abstract": "Demos and prototypes for generative AI (GenAI) projects can be quickly created with tools like Streamlit, offering impressive results for users within hours. However, scaling these solutions from prototypes to robust systems introduces significant challenges. As user demand grows, hacks and workarounds in tools like Streamlit lead to unreliability and debugging frustrations. This talk explores the journey of overcoming these obstacles, evolving to a stable tech stack with Qdrant, Postgres, Litellm, FastAPI, and Streamlit. Aimed at beginners in GenAI, it highlights key lessons.",
			"speakers": [
				"UZ9VMC",
				"SGPHNQ"
			],
			"track": 5205,
			"start": "2025-04-24T10:55:00+02:00",
			"end": "2025-04-24T11:25:00+02:00",
			"room": 3895,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151901+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "GVUPQN",
			"id": 1182028,
			"title": "Scalable Python and SQL Data Engineering without Migraines",
			"abstract": "This session is for data scientists, ML engineers, and AI practitioners with a basic understanding of machine learning and Python. By the end, you’ll know how to streamline ML workflows and scale production models.",
			"speakers": [
				"WBTYPT"
			],
			"track": 5212,
			"start": "2025-04-24T10:55:00+02:00",
			"end": "2025-04-24T11:25:00+02:00",
			"room": 3897,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151884+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "7FLW7F",
			"id": 1182031,
			"title": "Composable AI: Building Next-Gen AI Agents with MCP",
			"abstract": "At Blue Yonder, we're embarking on a journey toward building composable AI agents using Model Context Protocol (MCP). We're discovering firsthand the challenges of integrating diverse products and APIs into useful, context-aware agents. In this talk, I'll discuss our early experiences, the challenges we've faced, and why MCP is emerging as a potential game changer for developing scalable, flexible AI solutions.",
			"speakers": [
				"9FLCR9"
			],
			"track": 5214,
			"start": "2025-04-24T10:55:00+02:00",
			"end": "2025-04-24T11:25:00+02:00",
			"room": 3896,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151936+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "HPGEKH",
			"id": 1182030,
			"title": "Outgrowing your node? Zero stress scaling with cuPyNumeric.",
			"abstract": "Many data and simulation scientists use NumPy for its ease of use and good performance on CPU. This approach works well for single-node tasks, but scaling to handle larger datasets or more resource-intensive computations introduces significant challenges. Not to mention, using GPUs requires another level of complexity. We present the cuPyNumeric library, which gives developers the same familiar NumPy interface, but seamlessly distributes work across CPUs and GPUs.\r\nIn this talk we showcase the productivity and performance of cuPyNumeric library on one of the user's examples covering some detail on its implementation.",
			"speakers": [
				"NYEURC"
			],
			"track": 5206,
			"start": "2025-04-24T10:55:00+02:00",
			"end": "2025-04-24T11:25:00+02:00",
			"room": 3898,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151916+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "AGY8CT",
			"id": 1182032,
			"title": "Serverless Orchestration: Exploring the Future of Workflow Automation",
			"abstract": "Orchestration is a typical challenge in the data engineering world. Scheduling your data transformation jobs via CRON-jobs is cumbersome and error-prone. Furthermore, with an increasing number of jobs to manage it gets in-oversee able. Tools like Apache Airflow, Dagster, Luigi, and Prefect are known for addressing these challenges but often require additional resources or investment. With the advent of serverless orchestration tools, many of these disadvantages are mitigated, offering a more streamlined and cost-effective solution.\r\n\r\nThis session provides a comprehensive overview of combining serverless architecture with orchestration. We will start by defining the core concepts of orchestration and serverless technologies and discuss the benefits of integrating them. The talk will then analyze solutions available in the cloud vendor space. Attendees will leave with a well-rounded understanding of the tools and strategies available in serverless orchestration.",
			"speakers": [
				"M3HBER"
			],
			"track": 5206,
			"start": "2025-04-24T10:55:00+02:00",
			"end": "2025-04-24T11:25:00+02:00",
			"room": 3894,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151962+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "WMBDJ8",
			"id": 1182039,
			"title": "Going Global: Taking code from research to operational open ecosystem for AI weather forecasting",
			"abstract": "When I was hired as a Scientist for Machine Learning, experts said ML would never work in weather forecasting. Nowadays, I get to contribute to Anemoi, a full-featured ML weather forecasting framework used by international weather agencies to research, build, and scale AI weather forecasting models. \r\n\r\nThe project started out as a curiosity by my colleagues and soon scaled as a result of its initial success. As machine learning stories go, this is a story of change, adaptation and making things work. \r\n\r\nIn this talk, I'll share some practical lessons: how we evolved from a mono-package with four people working on it to multiple open-source packages with 40+ internal and external collaborators. Specifically, how we managed the explosion of over 300 config options without losing all of our sanity, building a separation of packages that works for both researchers and operations teams, as well as CI/CD and testing that constrains how many bugs we can introduce in a given day. You'll learn concrete patterns for growing Python packaging for ML systems, and balancing research flexibility with production stability. As a bonus, I'll sprinkle in anecdotes where LLMs like chatGPT and Copilot massively failed at facilitating this evolution.\r\n\r\nJoin me for a deep dive into the real challenges of scaling ML systems - where the weather may be hard to predict, but our code doesn't have to be.",
			"speakers": [
				"HCWQZW"
			],
			"track": 5205,
			"start": "2025-04-24T11:35:00+02:00",
			"end": "2025-04-24T12:20:00+02:00",
			"room": 3896,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.152069+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "7CXSPN",
			"id": 1182037,
			"title": "Reinventing Streamlit",
			"abstract": "Dreaming of creating sleek, interactive web apps with just Python? Streamlit is great for dashboards, but what if your needs go beyond that? Discover how Reflex.dev, a cutting-edge full-stack Python framework, lets you level up from dashboards to full-fledged web apps!",
			"speakers": [
				"F7DPMR"
			],
			"track": 5210,
			"start": "2025-04-24T11:35:00+02:00",
			"end": "2025-04-24T12:20:00+02:00",
			"room": 3894,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.152038+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "UGTB7A",
			"id": 1182036,
			"title": "Securing Generative AI: Essential Threat Modeling Techniques",
			"abstract": "Generative AI development introduces unique security challenges that traditional methods often overlook. This talk explores practical threat modeling techniques tailored for AI practitioners, focusing on real-world scenarios encountered in daily development. Through relatable examples and demonstrations, attendees will learn to identify and mitigate common vulnerabilities in AI systems. The session covers user-friendly security tools and best practices specifically designed for AI development. By the end, participants will have practical strategies to enhance the security of their AI applications, regardless of their prior security expertise.",
			"speakers": [
				"PDSUUK"
			],
			"track": 5214,
			"start": "2025-04-24T11:35:00+02:00",
			"end": "2025-04-24T12:05:00+02:00",
			"room": 3899,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.152023+00:00",
			"state": null,
			"do_not_record": true
		},
		{
			"code": "7CL3KS",
			"id": 1182034,
			"title": "Bridging the gap: unlocking SAP data for data lakes with Python and PySpark via SAP Datasphere",
			"abstract": "SAP's data often remains locked away, hindering the creation of a complete data picture. This talk presents a hands-on proof of concept leveraging SAP Datasphere, Python and PySpark to bridge an Azure-based, data mesh-inspired open data lake with a centralized SAP BI environment. \r\n\r\nThis presentation will delve into the architecture of SAP Datasphere and its integration interfaces with Python. It will explore network integration, authentication, authorization and resource management options, as well as data integration patterns. The presentation will summarize the evaluated features and limitations discovered during the PoC.",
			"speakers": [
				"7LKG3C"
			],
			"track": 5211,
			"start": "2025-04-24T11:35:00+02:00",
			"end": "2025-04-24T12:20:00+02:00",
			"room": 3895,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.151993+00:00",
			"state": null,
			"do_not_record": true
		},
		{
			"code": "VFE78U",
			"id": 1182035,
			"title": "They are not unit tests: a survey of unit-testing anti-patterns",
			"abstract": "The entire industry approves of unit testing but almost no one can fully agree on how to do it correctly, or even on what unit tests are. This results in unit tests often being associated with slower development cycle and an overall less enjoyable workflow. I'll show you how testing turns into hell in real enterprises with the most common anti-patterns and then I'll show you that most of them are avoidable with modern tooling like mutation testing, snapshot testing, dirty-equals, and many more. We'll discuss how to make tests speed up your development and make refactoring easy.",
			"speakers": [
				"UDHJSP"
			],
			"track": 5209,
			"start": "2025-04-24T11:35:00+02:00",
			"end": "2025-04-24T12:20:00+02:00",
			"room": 3893,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.152008+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "ER3V7W",
			"id": 1182038,
			"title": "Bias Meets Bayes: A Bayesian Perspective on Improving Model Fairness",
			"abstract": "Bias in machine learning models remains a pressing issue, often disproportionately affecting the most vulnerable groups in society. This talk introduces a Bayesian perspective to effectively tackle these challenges, focusing on improving fairness by modeling and addressing bias directly.\r\nYou will learn about the interplay between uncertainty, equity, and predictive accuracy, while gaining actionable insights to improve fairness in diverse applications. Using a practical example of a risk-scoring model trained on data with underrepresented minority groups, I will showcase how Bayesian methods compare to traditional techniques, demonstrating their unique potential to mitigate bias while maintaining performance.",
			"speakers": [
				"LZQCXY"
			],
			"track": 5212,
			"start": "2025-04-24T11:35:00+02:00",
			"end": "2025-04-24T12:05:00+02:00",
			"room": 3897,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.152054+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "KCV9RS",
			"id": 1182033,
			"title": "Beyond Alembic and Django Migrations",
			"abstract": "ORMs like Django and SQLAlchemy have become indispensable in Python development, simplifying the interaction between applications and databases. Yet, their built-in schema migration tools often fall short in projects that require advanced database features or robust CI/CD integration.\r\n\r\nIn this talk, we’ll explore how you can go beyond the limitations of your ORM’s migration tool. Using Atlas—a language-agnostic schema management tool—as a case study, we’ll demonstrate how Python developers can automate migration planning, leverage advanced database features, and seamlessly integrate database changes into modern CI/CD pipelines.",
			"speakers": [
				"AYDHS9"
			],
			"track": 5210,
			"start": "2025-04-24T11:35:00+02:00",
			"end": "2025-04-24T12:05:00+02:00",
			"room": 3898,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.151978+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"id": 1182048,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-24T10:20:00Z",
			"end": "2025-04-24T13:20:00+02:00",
			"room": 3896
		},
		{
			"id": 1182041,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-24T10:20:00Z",
			"end": "2025-04-24T13:20:00+02:00",
			"room": 3898
		},
		{
			"id": 1182043,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-24T10:20:00Z",
			"end": "2025-04-24T13:20:00+02:00",
			"room": 3893
		},
		{
			"id": 1182046,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-24T10:20:00Z",
			"end": "2025-04-24T13:20:00+02:00",
			"room": 3899
		},
		{
			"id": 1182045,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-24T10:20:00Z",
			"end": "2025-04-24T13:20:00+02:00",
			"room": 3897
		},
		{
			"id": 1182042,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-24T10:20:00Z",
			"end": "2025-04-24T13:20:00+02:00",
			"room": 3900
		},
		{
			"id": 1182044,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-24T10:20:00Z",
			"end": "2025-04-24T13:20:00+02:00",
			"room": 3895
		},
		{
			"id": 1182040,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-24T10:20:00Z",
			"end": "2025-04-24T13:20:00+02:00",
			"room": 3894
		},
		{
			"id": 1182047,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-24T10:20:00Z",
			"end": "2025-04-24T13:20:00+02:00",
			"room": 3901
		},
		{
			"id": 1182049,
			"title": {
				"en": "Announcements"
			},
			"start": "2025-04-24T11:20:00Z",
			"end": "2025-04-24T13:25:00+02:00",
			"room": 3893
		},
		{
			"code": "3FUYVH",
			"id": 1182050,
			"title": "Machine Learning Models in a Dynamic Environment",
			"abstract": "\"We've only tested the happy path - now users are finding all sorts of creative ways to break the app.\"\r\n\r\nWhat is already a cause for headaches in traditional software engineering turns into a large challenge when the application is based on machine learning models: Data distribution may change from training phase to deployment. Even worse, humans interacting with the model may adjust their behaviour to the model making the gap between original training environment and deployment even larger. When deployed in a public environment the model may be exposed to users trying to game the system. When re-trained it may be exposed to users trying to poison the pool of training data.\r\n\r\nWe will take a tour of historic cases of models being gamed: What are the lessons we learnt a long time ago building e-mail spam filters? What happened when high search engine rankings started to be linked to monetary income? How can personalization and targeted advertising be exploited to influence public discourse? \r\n\r\n“… it should be clear that improvements in communication tend to divide mankind …” by Harold Innis in Changing Concepts of Time\r\n\r\nThis keynote will turn interactive engaging the audience in sharing their stories on users playing interesting games with deployed models - including counter moves rolled out. \r\n\r\nIf we are to learn from IT security experience, one important ingredient to address these issues is a combination of collaboration and transparency - across organisations.",
			"speakers": [
				"8SZGZW"
			],
			"track": 5223,
			"start": "2025-04-24T13:25:00+02:00",
			"end": "2025-04-24T14:10:00+02:00",
			"room": 3893,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.152298+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "ME7XPJ",
			"id": 1182056,
			"title": "Oh my license! – Achieving order by automation in the license chaos of your dependencies",
			"abstract": "License issues can haunt you at night.\r\nYou spend days, weeks, and months developing beautiful software.\r\nBut then it happens.\r\nYou realize that an essential dependency is GPL-3.0 licensed.\r\n\r\nAll your code is now infected with this license.\r\nNow you are forced to either:\r\n1. Rewrite all parts relying on the other library\r\n2. Open-source your codebase under the GPL-3.0 license\r\n\r\nHow could this have been avoided?\r\n\r\nJoin the talk and find out!\r\nFirst, we’ll give you a brief introduction to different software licenses and their implications.\r\nSecond, we’ll show you how to automate your license checking using open-source software.",
			"speakers": [
				"KMY3JY"
			],
			"track": 5206,
			"start": "2025-04-24T14:20:00+02:00",
			"end": "2025-04-24T14:50:00+02:00",
			"room": 3897,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.152387+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "TXKLWR",
			"id": 1182051,
			"title": "Analyze data easily with duckdb - and the implications on data architectures",
			"abstract": "duckdb is increasingly becoming a universal tool for accessing and analyzing data. In this talk I will show with slides and live demo what duckdb is capable of and will dive deeper in how it will influence modern data architectures.",
			"speakers": [
				"8QDF3Q"
			],
			"track": 5211,
			"start": "2025-04-24T14:20:00+02:00",
			"end": "2025-04-24T14:50:00+02:00",
			"room": 3895,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.152313+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "7PDARV",
			"id": 1182053,
			"title": "Writing reliable software while depending on hazardous APIs",
			"abstract": "As we develop business critical software, we often need to rely on external APIs to get the job done. And all services are not born equal: although the ideal world would provide well operated APIs with over-met service levels, the real world is usually way worse than that. Timeouts, HTTP errors, cascading failures, unclear or changing contracts, approximate protocol implementations ... And even the oh-so-human bad faith while trying to pinpoint the root cause... Most of us have written hacks to handle commonly seen failures, from the quick and dirty implementation to well thought resilience patterns implementation, but this is usually hard to do correctly, and rarely a business priority to invest the correct amount of time and money on the topic. We'll present the options, both including direct dependencies (not framework dependant, although some families can emerge (async/sync ...)) and including a service/proxy based approach.",
			"speakers": [
				"E7DVCA"
			],
			"track": 5205,
			"start": "2025-04-24T14:20:00+02:00",
			"end": "2025-04-24T14:50:00+02:00",
			"room": 3898,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.152343+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "C3RVM3",
			"id": 1182055,
			"title": "Unlocking the Predictive Power of Relational Data with Automated Feature Engineering",
			"abstract": "Relational data can be a goldmine for classical Machine Learning applications — yet extracting useful features from multiple tables, time windows, and primary-foreign key relationships is notoriously difficult. In this code tutorial, we’ll use the H&M Fashion dataset to demonstrate how getML FastProp automates feature engineering for both classification (churn prediction) and regression (sales prediction) with minimal manual effort, outperforming both Relational Deep Learning and a skilled human data scientist according to the RelBench leaderboard.\r\n\r\nThis code tutorial is perfect for data scientists looking to leverage their relational and time-series data data effectively for any kind of predictive analytics applications.",
			"speakers": [
				"WP7K8V"
			],
			"track": 5212,
			"start": "2025-04-24T14:20:00+02:00",
			"end": "2025-04-24T15:50:00+02:00",
			"room": 3900,
			"duration": 90,
			"updated": "2025-04-09T08:21:33.152372+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "KZKT9W",
			"id": 1182059,
			"title": "Duplicate Code Dilemma: Unlocking Automation with Open Source!",
			"abstract": "\"Don't Repeat Yourself\" – a phrase that we have all heard many times. In this talk, we will have an overview how to deal with code duplication and how open-source template libraries such as Copier can assist us in managing similarly structured repositories. Furthermore, we will explore how code updates can be automated with the help of open-source libraries like Renovate Bot. By the end of this session, you will gain insights into these solutions while also questioning whether they truly eliminate repetition or merely contribute to another cycle of automation.",
			"speakers": [
				"PSWRAP"
			],
			"track": 5206,
			"start": "2025-04-24T14:20:00+02:00",
			"end": "2025-04-24T14:50:00+02:00",
			"room": 3894,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.152435+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"id": 1182057,
			"title": {
				"en": "AI Fireside Chat"
			},
			"start": "2025-04-24T12:20:00Z",
			"end": "2025-04-24T15:40:00+02:00",
			"room": 3893
		},
		{
			"code": "AYN837",
			"id": 1182054,
			"title": "Machine Reasoning and System 2 Thinking",
			"abstract": "Raw large language models struggle with complex reasoning. New techniques have\r\nemerged that allow these models to spend more time thinking before giving an answer.\r\nDirect token sampling can be seen as system-1 thinking and explicit step-by-step\r\nreasoning as system-2. How can this reasoning ability be improved and what is the future?",
			"speakers": [
				"Y3GHEB"
			],
			"track": 5214,
			"start": "2025-04-24T14:20:00+02:00",
			"end": "2025-04-24T14:50:00+02:00",
			"room": 3899,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.152357+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "PKZD8L",
			"id": 1182058,
			"title": "AI Agents of Change: Creating, Reflecting, and Monetizing",
			"abstract": "Create, reflect, and earn—with purpose. In this workshop, you’ll not only build your own AI agent but also confront the ethical questions it raises, from its impact on jobs to its potential for social good. Together, we’ll explore how to harness AI for empowerment while uncovering pathways to turn your skills into meaningful value.\r\n\r\nThis workshop is designed to equip Python enthusiasts with the tools to create their own AI agent while fostering a deeper understanding of the societal implications of this technology. Through hands-on learning, collaborative discussions, and practical monetization strategies, you’ll leave with more than just code—you’ll gain a vision of how AI can be wielded responsibly and profitably.",
			"speakers": [
				"TSXAJM",
				"NMACLQ"
			],
			"track": 5214,
			"start": "2025-04-24T14:20:00+02:00",
			"end": "2025-04-24T15:50:00+02:00",
			"room": 3901,
			"duration": 90,
			"updated": "2025-04-09T08:21:33.152420+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "3DCS8K",
			"id": 1182052,
			"title": "Dataframely — A declarative, 🐻‍❄️-native data frame validation library",
			"abstract": "Understanding the structure and content of data frames is crucial when working with tabular data — a core requirement for the robust pipelines we build at QuantCo.\r\n\r\nLibraries such as `pandera` or `patito` already exist to ease the process of defining data frame schemas and validating that data frames comply with these schemas. However, when building production-ready data pipelines, we encountered limitations of these libraries. Specifically, we were missing support for strict static type checking, validation of interdependent data frames, and graceful validation including introspection of failures.\r\n\r\nTo remedy the shortcomings of these libraries, we started building `dataframely` at the beginning of last year. Dataframely is a declarative data frame validation library with first-class support for polars data frames.\r\n\r\nOver the last year, we have gained experience in using `dataframely` both for analytical and production code across several projects. The result was a drastic improvement of the legibility of our pipeline code and our confidence in its correctness. To enable the wider data engineering community to benefit from similar effects, we have recently open-sourced `dataframely` and are keen on introducing it in this talk.",
			"speakers": [
				"Y3BGJB",
				"BVTTB3"
			],
			"track": 5211,
			"start": "2025-04-24T14:20:00+02:00",
			"end": "2025-04-24T14:50:00+02:00",
			"room": 3896,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.152328+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "DEHZHK",
			"id": 1182064,
			"title": "Distributed file-systems made easy with Python's fsspec",
			"abstract": "The cloud native revolution has impacted all aspects of engineering, and data engineering is not exempt. One of the ongoing challenges in the data engineering world remains the local and distributed cloud native storage. In this talk we’ll explore working with distributed file systems in Python, through an intro to fsspec: a popular python library that is well-positioned to address the growing challenge of interacting with storage systems of different kinds in a consistent way.\r\n\r\nIn this talk we’ll show hands-on examples of working with fsspec with some of the most popular data tools in the Python community: Pandas, Tensorflow and PyArrow. We’ll demonstrate a real world implementation of fsspec and how it provides easy extensibility through open source tooling.\r\n\r\nYou’ll come away from this session with a better understanding for how to implement and extend fsspec to work with different cloud native storage systems.",
			"speakers": [
				"SYPCGN",
				"ZG33XS"
			],
			"track": 5211,
			"start": "2025-04-24T15:00:00+02:00",
			"end": "2025-04-24T15:45:00+02:00",
			"room": 3894,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.152509+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "P9GRZU",
			"id": 1182061,
			"title": "Quiet on Set: Building an On-Air Sign with Open Source Technologies",
			"abstract": "Learn how to build a custom On-Air sign using Apache Kafka®, Apache Flink®, and Apache Iceberg™! See how to capture events like Zoom meetings and camera usage with Python, process data with FlinkSQL, analyze trends using Iceberg, and bring it all together with a practical IoT project that easily scales out.",
			"speakers": [
				"BQKRWQ"
			],
			"track": 5219,
			"start": "2025-04-24T15:00:00+02:00",
			"end": "2025-04-24T15:45:00+02:00",
			"room": 3897,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.152465+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "UDDTBS",
			"id": 1182060,
			"title": "Accuracy Is Not Enough: Building Trustworthy AI with Conformal Prediction",
			"abstract": "Building a good scoring model is just the beginning. In the age of critical AI applications, understanding and quantifying uncertainty is as crucial as achieving high accuracy. This talk highlights conformal prediction as the definitive approach to both uncertainty quantification and probability calibration, two extremely important topics in Deep Learning and Machine Learning. We’ll explore its theoretical underpinnings, practical implementations using TorchCP, and transformative impact on safety-critical fields like healthcare, robotics, and NLP. Whether you're building predictive systems or deploying AI in high-stakes environments, this session will provide actionable insights to level up your modelling skills for robust decision-making.",
			"speakers": [
				"GCAKSZ"
			],
			"track": 5212,
			"start": "2025-04-24T15:00:00+02:00",
			"end": "2025-04-24T15:45:00+02:00",
			"room": 3896,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.152450+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "HSFR7A",
			"id": 1182063,
			"title": "Scraping LEGO for Fun: A Hacky Dive into Dynamic Data Extraction",
			"abstract": "Unlock the full potential of modern web scraping by combining Python, Scrapy, and Playwright to extract data from dynamic, JavaScript-heavy sites—exemplified by LEGO product pages. This talk introduces Model Context Protocol (MCP) servers for orchestrating advanced data fetching, refining CSS selectors, and integrating Large Language Models for automated code suggestions. Learn how to scale ethically, handle concurrency, and respect site policies, while maintaining flexible, maintainable pipelines for diverse use cases from research to robotics.",
			"speakers": [
				"YUHH8E"
			],
			"track": 5211,
			"start": "2025-04-24T15:00:00+02:00",
			"end": "2025-04-24T15:45:00+02:00",
			"room": 3895,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.152495+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "BJKSGK",
			"id": 1182062,
			"title": "Decoding Topics: A Comparative Analysis of Python’s Leading Topic Modeling Libraries Using Climate C",
			"abstract": "Topic modelling has come a long way, evolving from traditional statistical methods to leveraging advanced embeddings and neural networks. Python’s diverse library ecosystem includes tools like Latent Dirichlet Allocation (LDA) using gensim, Top2Vec, BERTopic, and Contextualized Topic Models (CTM). This talk evaluates these popular approaches using a dataset of UK climate change policies, considering use cases relevant to organisations like DEFRA (Department for Environment, Food & Rural Affairs). The analysis explores real-time integration, dynamic topic modelling over time, adding new documents, and retrieving similar ones. Attendees will learn the strengths, limitations, and practical applications of each library to make informed decisions for their projects.",
			"speakers": [
				"GPD9BB"
			],
			"track": 5213,
			"start": "2025-04-24T15:00:00+02:00",
			"end": "2025-04-24T15:45:00+02:00",
			"room": 3898,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.152480+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "GRWYQB",
			"id": 1182065,
			"title": "Securing RAG Pipelines with Fine Grained Authorization",
			"abstract": "Using LLMs and AI in your Enterprise? Make sure you build Fine Grained Authorization to ensure your LLMs access only the data they are authorized to. \r\n\r\nThis talk will show how you can build Relationship Based Access Control (ReBAC) for fine-grained authorization for your RAG pipelines. The talk also includes a demo using Pinecone, Langchain, OpenAI, and SpiceDB.",
			"speakers": [
				"XH7YNC"
			],
			"track": 5214,
			"start": "2025-04-24T15:00:00+02:00",
			"end": "2025-04-24T15:45:00+02:00",
			"room": 3899,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.152524+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"id": 1182070,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-24T13:45:00Z",
			"end": "2025-04-24T16:15:00+02:00",
			"room": 3893
		},
		{
			"id": 1182067,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-24T13:45:00Z",
			"end": "2025-04-24T16:15:00+02:00",
			"room": 3895
		},
		{
			"id": 1182068,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-24T13:45:00Z",
			"end": "2025-04-24T16:15:00+02:00",
			"room": 3899
		},
		{
			"id": 1182072,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-24T13:45:00Z",
			"end": "2025-04-24T16:15:00+02:00",
			"room": 3898
		},
		{
			"id": 1182071,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-24T13:45:00Z",
			"end": "2025-04-24T16:15:00+02:00",
			"room": 3894
		},
		{
			"id": 1182069,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-24T13:45:00Z",
			"end": "2025-04-24T16:15:00+02:00",
			"room": 3896
		},
		{
			"id": 1182066,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-24T13:45:00Z",
			"end": "2025-04-24T16:15:00+02:00",
			"room": 3897
		},
		{
			"id": 1182073,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-24T13:50:00Z",
			"end": "2025-04-24T16:15:00+02:00",
			"room": 3901
		},
		{
			"id": 1182074,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-24T13:50:00Z",
			"end": "2025-04-24T16:15:00+02:00",
			"room": 3900
		},
		{
			"code": "CTUEJX",
			"id": 1182077,
			"title": "Streaming at 30,000 Feet: A Real-Time Journey from APIs to Stream Processing",
			"abstract": "Traditional API architectures face significant challenges in environments where repetitive and frequent requests are required to retrieve data updates. These request-response mechanisms introduce latency, as clients must continually query the server to check for changes, often receiving redundant or outdated information. This approach leads to increased network overhead, inefficient use of server resources and diminished scalability as the number of clients or requests grows. Additionally, frequent requests expand the attack surface, requiring security measures to mitigate risks such as (un-)authorised access, rate limiting and query sanitisation. Managing all of these inherent problem results in increasingly complex systems to maintain and improve while putting considerable implementation effort onto the customer.\r\nJoin to find out how transitioning to a streaming architecture can address these issues by providing proactive, event-based data delivery, reducing latency, minimising redundant processing, enhancing scalability and simplifying security management.",
			"speakers": [
				"TVU8C7"
			],
			"track": 5206,
			"start": "2025-04-24T16:15:00+02:00",
			"end": "2025-04-24T16:45:00+02:00",
			"room": 3899,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.152751+00:00",
			"state": null,
			"do_not_record": true
		},
		{
			"code": "BAASYV",
			"id": 1182083,
			"title": "Optimizing in the Python Ecosystem – Powered by Gurobi",
			"abstract": "Join us as we explore integrating Gurobi and prescriptive analytics into your Python ecosystem. In this session, you’ll discover model-building techniques that leverage NumPy and SciPy.sparse as well as the data structures of pandas. We’ll also show you how to seamlessly integrate trained regressors from scikit-learn as constraints in your optimization models. Elevate your workflows and unlock new decision-making capabilities with Gurobi in Python.",
			"speakers": [
				"QJDXKB"
			],
			"track": 5207,
			"start": "2025-04-24T16:15:00+02:00",
			"end": "2025-04-24T16:45:00+02:00",
			"room": 3895,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.152847+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "9Y9DM8",
			"id": 1182076,
			"title": "The future of AI training is federated",
			"abstract": "Since it’s introduction in 2016, Federated Learning (FL) has become a key paradigm to AI models in scenarios when training data cannot leave its source. This applies in many industrial settings where centralizing data is challenging due to a combination of reasons, including but not limited to privacy, legal, and logistics.\r\n\r\nThe main focus of this tutorial is to introduce an alternative approach to training AI models that is straightforward and accessible. We’ll walk you through the basics of an FL system, how to iterate on your workflow and code in a research setting, and finally deploy your code to a production environment. You will learn all of these approaches using a real-world application based on open-sourced datasets, and the open-source federated AI framework, [Flower](https://github.com/adap/flower), which is written in Python and designed for Python users. Throughout the tutorial, you’ll have access to hands-on open-sourced code examples to follow along.",
			"speakers": [
				"YHPLBC"
			],
			"track": 5212,
			"start": "2025-04-24T16:15:00+02:00",
			"end": "2025-04-24T17:45:00+02:00",
			"room": 3901,
			"duration": 90,
			"updated": "2025-04-09T08:21:33.152736+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "EDJ8N7",
			"id": 1182080,
			"title": "Learnings from migrating a Flask app to FastAPI",
			"abstract": "FastAPI has been constantly growing in popularity during the last years. A lot of this growth is driven by its relative simplicity and ease-of-use. In this talk, we'll discuss some practical insights into building a FastAPI application, based on my experience of migrating an existing Flask prototype to FastAPI. \r\n\r\nWe'll explore how FastAPI's core features like Pydantic integration and dependency injection can improve API development, while also talking about the drawbacks of FastAPI.",
			"speakers": [
				"7H3JY8"
			],
			"track": 5210,
			"start": "2025-04-24T16:15:00+02:00",
			"end": "2025-04-24T16:45:00+02:00",
			"room": 3894,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.152801+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "J8FLDN",
			"id": 1182075,
			"title": "Conquering the Queue: Lessons from processing one billion Celery tasks",
			"abstract": "At Userlike, Celery is the backbone of our application, orchestrating over a 100 million tasks per month. In this talk, I’ll share real-world insights into scaling Celery, optimizing performance, avoiding common pitfalls, handling failures, and building a resilient architecture.",
			"speakers": [
				"WV3US9"
			],
			"track": 5210,
			"start": "2025-04-24T16:15:00+02:00",
			"end": "2025-04-24T16:45:00+02:00",
			"room": 3898,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.152720+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"id": 1182079,
			"title": {
				"en": "PyLadies Panel"
			},
			"start": "2025-04-24T14:15:00Z",
			"end": "2025-04-24T17:15:00+02:00",
			"room": 3893
		},
		{
			"code": "3FSWJU",
			"id": 1182082,
			"title": "Cache me if you can: Boosted application performance with Redis and client-side caching",
			"abstract": "Did you know Redis can notify your app about server-side data changes? This feature enables client-side tracking and caching in redis-py, helping to reduce network round-trips and optimize performance. In this talk, we explore how client-side caching works in redis-py and how you can use it to make your applications even faster.",
			"speakers": [
				"D7HNKK"
			],
			"track": 5211,
			"start": "2025-04-24T16:15:00+02:00",
			"end": "2025-04-24T16:45:00+02:00",
			"room": 3896,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.152832+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "PDBAXQ",
			"id": 1182081,
			"title": "pytest - simple, rapid and fun testing with Python",
			"abstract": "The pytest tool offers a rapid and simple way to write tests for your Python code. This training gives an introduction with exercises to some distinguishing features, such as its assertions, marks and fixtures.\r\n\r\nDespite its simplicity, pytest is incredibly flexible and configurable. We'll look at various configuration options as well as the plugin ecosystem around pytest.",
			"speakers": [
				"BPA78X"
			],
			"track": 5209,
			"start": "2025-04-24T16:15:00+02:00",
			"end": "2025-04-24T17:45:00+02:00",
			"room": 3900,
			"duration": 90,
			"updated": "2025-04-09T08:21:33.152817+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "3CYZUH",
			"id": 1182078,
			"title": "Building a Self-Hosted MLOps Platform with Kubernetes",
			"abstract": "Many managed MLOps platforms, while convenient, often fall short in providing flexibility, requiring complex integrations, and causing vendor lock-in. In this talk, we’ll share our experience transitioning from managed MLOps tools to a self-hosted solution built on Kubernetes. We’ll focus on how we leveraged open-source tools like Feast, MLflow, and Ray to build a more flexible, scalable, and customizable platform that is now in use at Rewe Digital. By migrating to this self-hosted architecture, we gained greater control over our ML pipelines, reduced our dependency on third-party services, and created a more adaptable infrastructure for our ML workloads.",
			"speakers": [
				"NQU3YJ"
			],
			"track": 5205,
			"start": "2025-04-24T16:15:00+02:00",
			"end": "2025-04-24T16:45:00+02:00",
			"room": 3897,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.152767+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "BR3D83",
			"id": 1182089,
			"title": "From Algorithm to Action: Building a DIY Distributed Trading Platform with Open Source",
			"abstract": "In this talk, we'll explore how you can implement your own distributed system for algorithmic trading leveraging the power of open source without being dependent on trading bot providers.\r\n\r\nWe will discuss different challenges occurring in HFT inter alia processing massive amounts of data with low latency and reliable risk control and how to solve them. Furthermore we will touch on the topic of regulatory requirements in trading.\r\n\r\nThese challenges will be addressed through a distributed system implemented in Python, utilizing Kafka for real-time data streaming, PostgreSQL for persistent storage and DuckDB for high-performance analysis. We will examine approaches to decouple the components to re-use and scale them across different markets.\r\n\r\nCryptocurrency markets are used as a proving ground for the PoC due to easy availability for everyone.",
			"speakers": [
				"8NMQMV"
			],
			"track": 5206,
			"start": "2025-04-24T16:55:00+02:00",
			"end": "2025-04-24T17:40:00+02:00",
			"room": 3897,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.152937+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "WLZSEZ",
			"id": 1182087,
			"title": "A11y Need Is Love (But Accessible Docs Help Too)",
			"abstract": "Accessible documentation benefits everyone, from developers to end users. Using the [PyData Sphinx Theme](https://pydata-sphinx-theme.readthedocs.io/en/stable/) as a case study, this talk dives into common accessibility barriers in documentation websites like low contrast colors, missing focus states, etc. and practical ways to address them. Learn about accessibility improvements and take part in a live accessibility audit to see how small changes can make a big difference.",
			"speakers": [
				"9HDESG"
			],
			"track": 5215,
			"start": "2025-04-24T16:55:00+02:00",
			"end": "2025-04-24T17:40:00+02:00",
			"room": 3896,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.152907+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "UCG9AS",
			"id": 1182085,
			"title": "From LIKE to Love: Adding Proper Search to Your Django Apps",
			"abstract": "Is your Django application still relying on SQL LIKE queries for search? In this talk, we'll explore why basic text matching falls short of modern user expectations and how to implement proper search functionality without complexity. We'll introduce django-semantic-search, a practical package that bridges the gap between Django's ORM and powerful semantic search capabilities. Through practical code examples and real-world use cases, you'll learn how to enhance your application's search experience from basic keyword matching to understanding user intent. Whether you're building a content platform, e-commerce site, or internal tool, you'll walk away with concrete steps to implement production-ready search that your users will actually enjoy using.",
			"speakers": [
				"H3RSTE"
			],
			"track": 5210,
			"start": "2025-04-24T16:55:00+02:00",
			"end": "2025-04-24T17:40:00+02:00",
			"room": 3898,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.152877+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "JUAF3S",
			"id": 1182088,
			"title": "Challenges and Lessons Learned While Building a Real-Time Lakehouse using Apache Iceberg and Kafka",
			"abstract": "How do you build a large-scale data lakehouse architecture that makes data available for business analytics in real time, while being more cost-effective, more flexible and faster than the previous proprietary solution? With Python, Kafka and Iceberg, of course!\r\n\r\nWe built a large-scale data lakehouse based on Apache Iceberg for the Schwarz Group, Europe's largest retailer. The system collects business data from thousands of stores, warehouses and offices across Europe.\r\n\r\nIn this talk, we will present our architecture, the challenges we faced, and how Apache Iceberg is shaping up to be the data lakehouse format of the future.",
			"speakers": [
				"TP9MH3",
				"RFERPK"
			],
			"track": 5211,
			"start": "2025-04-24T16:55:00+02:00",
			"end": "2025-04-24T17:40:00+02:00",
			"room": 3895,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.152922+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "9NFHAS",
			"id": 1182084,
			"title": "Transformers for Game Log Data",
			"abstract": "The Transformer architecture, originally designed for machine translation, has revolutionized deep learning with applications in natural language processing, computer vision, and time series forecasting. Recently, its capabilities have extended to sequence-to-sequence tasks involving log data, such as telemetric event data from computer games.\r\n\r\nThis talk demonstrates how to apply a Transformer-based model to game log data, showcasing its potential for sequence prediction and representation learning. Attendees will gain insights into implementing a simple Transformer in Python, optimizing it through hyperparameter tuning, architectural adjustments, and defining an appropriate vocabulary for game logs.\r\n\r\nReal-world applications, including clustering and user level predictions, will be explored using a dataset of over 175 million events from an MMORPG. The talk will conclude with a discussion of the model's performance, computational requirements, and future opportunities for this approach.",
			"speakers": [
				"RLAACQ"
			],
			"track": 5212,
			"start": "2025-04-24T16:55:00+02:00",
			"end": "2025-04-24T17:40:00+02:00",
			"room": 3899,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.152862+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "XLZQFA",
			"id": 1182086,
			"title": "Lessons learned in bringing a RAG chatbot with access to 50k+ diverse documents to production",
			"abstract": "Retrieval-Augmented Generation (RAG) chatbots are a key use case of GenAI in organizations, allowing users to conveniently access and query internal company data. A first RAG prototype can often be created in a matter of days. But why are the majority of prototypes still in the pilot stage? [\\[1\\]](https://www2.deloitte.com/content/dam/Deloitte/us/Documents/consulting/us-state-of-gen-ai-q3.pdf)\r\n\r\nIn this talk we share our insights from developing a production-grade chatbot at Merck. Our RAG chatbot for R&D experts accesses over 50,000 documents across numerous SharePoint sites and other sources. We identified three key success factors:\r\n1. Developing a robust data pipeline that syncs documents from source systems and that handles enterprise features such as replicating user permissions. \r\n2. Establishing a comprehensive evaluation framework with a clear optimization metric.\r\n3. Driving adoption through an onboarding training and ongoing user engagement, such as regular office hours.\r\n\r\nWe think that many of these lessons are broadly applicable to RAG chatbots, making this talk valuable for practitioners aiming to implement GenAI solutions in business contexts.",
			"speakers": [
				"GGSPQV"
			],
			"track": 5214,
			"start": "2025-04-24T16:55:00+02:00",
			"end": "2025-04-24T17:40:00+02:00",
			"room": 3894,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.152892+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"id": 1182090,
			"title": {
				"en": "Lightning Talks"
			},
			"start": "2025-04-24T15:50:00Z",
			"end": "2025-04-24T19:20:00+02:00",
			"room": 3893
		},
		{
			"id": 1182091,
			"title": {
				"en": "Announcements"
			},
			"start": "2025-04-25T07:00:00Z",
			"end": "2025-04-25T09:05:00+02:00",
			"room": 3893
		},
		{
			"code": "Z9ZTAH",
			"id": 1182092,
			"title": "The Future of AI: Building the Most Impactful Technology Together",
			"abstract": "In this talk, Leandro will examine the significant benefits of combining open source principles with artificial intelligence. He will walk through the need for openness in language models to build trust, maintain control, mitigate biases, and achieve true alignment and show how open models are rapidly gaining momentum in the AI landscape, challenging proprietary systems through community-driven innovation. Finally, he will then talk about emerging trends and what the community needs to build for the next generation of models.",
			"speakers": [
				"D7XC7V"
			],
			"track": 5223,
			"start": "2025-04-25T09:05:00+02:00",
			"end": "2025-04-25T09:50:00+02:00",
			"room": 3893,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.152989+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"id": 1182095,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-25T07:50:00Z",
			"end": "2025-04-25T10:15:00+02:00",
			"room": 3896
		},
		{
			"id": 1182096,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-25T07:50:00Z",
			"end": "2025-04-25T10:15:00+02:00",
			"room": 3899
		},
		{
			"id": 1182093,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-25T07:50:00Z",
			"end": "2025-04-25T10:15:00+02:00",
			"room": 3901
		},
		{
			"id": 1182098,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-25T07:50:00Z",
			"end": "2025-04-25T10:15:00+02:00",
			"room": 3893
		},
		{
			"id": 1182099,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-25T07:50:00Z",
			"end": "2025-04-25T10:15:00+02:00",
			"room": 3894
		},
		{
			"id": 1182101,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-25T07:50:00Z",
			"end": "2025-04-25T10:15:00+02:00",
			"room": 3900
		},
		{
			"id": 1182097,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-25T07:50:00Z",
			"end": "2025-04-25T10:15:00+02:00",
			"room": 3898
		},
		{
			"id": 1182100,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-25T07:50:00Z",
			"end": "2025-04-25T10:15:00+02:00",
			"room": 3895
		},
		{
			"id": 1182094,
			"title": {
				"en": "Coffee Break"
			},
			"start": "2025-04-25T07:50:00Z",
			"end": "2025-04-25T10:15:00+02:00",
			"room": 3897
		},
		{
			"code": "SVLRGG",
			"id": 1182106,
			"title": "Agentic AI: Build a Multi-Agent Application with CrewAI",
			"abstract": "This hands-on tutorial will dive into the fundamentals of building multi-agent systems using the CrewAI Python library. Starting from the basics, we’ll cover key concepts, explore advanced features, and guide you step-by-step through building a complete application from scratch. We’ll discuss implementing guardrails, securing interactions, and preventing query injection vulnerabilities along the way.",
			"speakers": [
				"9NYEDM"
			],
			"track": 5214,
			"start": "2025-04-25T10:15:00+02:00",
			"end": "2025-04-25T11:45:00+02:00",
			"room": 3900,
			"duration": 90,
			"updated": "2025-04-09T08:21:33.153310+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "WJPEQH",
			"id": 1182102,
			"title": "The Mighty Dot - Customize Attribute Access with Descriptors",
			"abstract": "Whenever you use a dot in Python you access an attribute. While this seems a very simple operation, behind the scenes many things can happen. This tutorial looks into this mechanism that is regulated by descriptors. You will learn how a descriptor works and what kind of problems it can help to solve. Python properties are based on descriptors and solve one type of problems. Descriptors are more general, allow more use cases, and are more re-usable. Descriptors are an advanced topic. But once mastered, they provide a powerful tool to hide potentially complex behavior behind a simple dot.",
			"speakers": [
				"9KSJ3K"
			],
			"track": 5207,
			"start": "2025-04-25T10:15:00+02:00",
			"end": "2025-04-25T11:45:00+02:00",
			"room": 3901,
			"duration": 90,
			"updated": "2025-04-09T08:21:33.153222+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "SXRVNU",
			"id": 1182103,
			"title": "Data as (Python) Code",
			"abstract": "In contemporary data-driven environments, the seamless integration of data into automated workflows is paramount. The reliability of automation, however, is constantly threatened by breaking changes in the source data. The Data-as-Code (DaC) paradigm address this challenge by treating data as a first-class citizen within the software development lifecycle.",
			"speakers": [
				"7BDJCR"
			],
			"track": 5205,
			"start": "2025-04-25T10:15:00+02:00",
			"end": "2025-04-25T10:45:00+02:00",
			"room": 3893,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.153264+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "LRUKZQ",
			"id": 1182110,
			"title": "Beyond DALL-E: Advanced Image Generation Workflows with ComfyUI",
			"abstract": "Image generation using AI has made huge progress over the last years, and many people still think that DALL-E with a text prompt is the best way to generate images. There are well-known models like Stable Diffusion and Flux, which can be used with easy-to-use frontends like A1111 or Invoke AI, but if you want to do more complex or bleeding-edge workflows, you need something else. In this talk, I want to show you ComfyUI, an open-source node-based GUI written in Python where you can build complex pipelines that are otherwise only possible using plain code.",
			"speakers": [
				"NZNFP8"
			],
			"track": 5289,
			"start": "2025-04-25T10:15:00+02:00",
			"end": "2025-04-25T10:45:00+02:00",
			"room": 3898,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.153368+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "ADSXCA",
			"id": 1182105,
			"title": "Where have all the post offices gone? Discovering neighborhood facilities with Python and OSM",
			"abstract": "When it comes to open geographic data, OpenStreetMap is an awesome resource. Getting started and figuring out how to make the most out of the data available can be challenging.\r\n\r\nUsing a personal example: frustration at the apparent lack of post offices in my neighborhood, we'll walk through examples of how to parse, filter, process, and visualize geospatial data with Python.\r\n\r\nAt the end of this talk, you will know how to process geographic data from OpenStreetMap using Python and find out some surprising info that I learned while answering the question: Where have all the post offices gone?",
			"speakers": [
				"ST3QCB"
			],
			"track": 5211,
			"start": "2025-04-25T10:15:00+02:00",
			"end": "2025-04-25T10:45:00+02:00",
			"room": 3896,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.153295+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "FSK3PE",
			"id": 1182108,
			"title": "From Queries to Confidence: Ensuring SQL Reliability with Python",
			"abstract": "SQL remains a foundational component of data-driven applications, but ensuring the accuracy and reliability of SQL logic is often challenging. SQL testing can be cumbersome, time-consuming, and error-prone. However, these challenges can be addressed by leveraging the simplicity of Python's testing framework such as pytest, enabling clean, robust, and automated SQL testing.",
			"speakers": [
				"EKLLGL"
			],
			"track": 5209,
			"start": "2025-04-25T10:15:00+02:00",
			"end": "2025-04-25T10:45:00+02:00",
			"room": 3894,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.153339+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "VKYDBD",
			"id": 1182107,
			"title": "Building Bare-Bones Game Physics in Rust with Python Integration",
			"abstract": "Learn how to build a minimalist game physics engine in Rust and make it accessible to Python developers using PyO3. This talk explores fundamental concepts like collision detection and motion dynamics while focusing on Python integration for scripting and testing. Ideal for developers interested in combining Rust’s performance with Python’s ease of use to create lightweight and efficient tools for games or simulations.",
			"speakers": [
				"SS7YVE"
			],
			"track": 5393,
			"start": "2025-04-25T10:15:00+02:00",
			"end": "2025-04-25T10:45:00+02:00",
			"room": 3897,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.153325+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "WCDPLP",
			"id": 1182109,
			"title": "FastHTML vs. Streamlit - The Dashboarding Face Off",
			"abstract": "In the right corner, we have the go-to dashboarding solution for showcasing ML models or visualizing data, **STREAMLIT** (\\*crowd cheers\\*). Simple yet powerful, it defends the throne of Python dashboarding, but have you ever tried to create complex interactions with it? Things like drill-downs or logins, can make your control flow become messy really quick (\\*crowd nods knowlingly\\*).\r\n\r\nAnd in the left corner, the new contender in the arena of Python web frameworks which, according to its docs, \"*excels at building dashboards*\", **FastHTML** (\\*crowd whoops\\*). We will see if this is true, in the **ultimate dashboarding face off** (\\*crowd gasps\\*). By building the same dashboard, step by step, in both frameworks, investigate their strengths and weaknesses, we will see which framework can claim the crown.",
			"speakers": [
				"WLLGPM"
			],
			"track": 5210,
			"start": "2025-04-25T10:15:00+02:00",
			"end": "2025-04-25T10:45:00+02:00",
			"room": 3895,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.153354+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "89BX8V",
			"id": 1182104,
			"title": "Towards Intelligent Monitoring: Detecting Degraded Flame Torch Nozzles",
			"abstract": "Flame cutting is a method where metals are efficiently cut using precise control of the oxygen jet and consistent mixing of fuel gas. The condition of the nozzle is changing over time: deposits formed during the cutting process can degrade the flame quality, reducing the precision of the cut. Traditionally, nozzles suspected of wear are sent back for manual inspection, where experts evaluated the flame visually and audibly to determine whether repair or replacement is needed. This project leverages machine learning to optimize this process by analyzing acoustic emission data.",
			"speakers": [
				"LJLEJV"
			],
			"track": 5212,
			"start": "2025-04-25T10:15:00+02:00",
			"end": "2025-04-25T10:45:00+02:00",
			"room": 3899,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.153280+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "XRHEYZ",
			"id": 1182117,
			"title": "The Foundation Model Revolution for Tabular Data",
			"abstract": "What if we could make the same revolutionary leap for tables that ChatGPT made for text? While foundation models have transformed how we work with text and images, tabular / structured data (spreadsheets and databases) - the backbone of economic and scientific analysis - has been left behind. TabPFN changes this. It's a foundation model that achieves in 2.8 seconds what traditional methods need 4 hours of hyperparameter tuning for - while delivering better results. On datasets up to 10,000 samples, it outperforms every existing Python library, from XGBoost to CatBoost to Autogluon.\r\n\r\nBeyond raw performance, TabPFN brings foundation model capabilities to tables: native handling of messy data without preprocessing, built-in uncertainty estimation, synthetic data generation, and transfer learning - all in a few lines of Python code. Whether you're building risk models, accelerating scientific research, or optimizing business decisions, TabPFN represents the next major transformation in how we analyze data. Join us to explore and learn how to leverage these new capabilities in your work.",
			"speakers": [
				"WEJ8W7",
				"79EEXA"
			],
			"track": 5212,
			"start": "2025-04-25T10:55:00+02:00",
			"end": "2025-04-25T11:25:00+02:00",
			"room": 3896,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.153494+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "CPCNRZ",
			"id": 1182113,
			"title": "How Narwhals is silently bringing pandas, Polars, DuckDB, PyArrow, and more together",
			"abstract": "If you were writing a data science tool in 2015, you'd have ensured it supported pandas and then called it a day.\r\n\r\nBut it's not 2015 anymore, we've fast-forwarded to 2025. If you write a tool which only supports pandas, users will demand support for Polars, PyArrow, DuckDB, and so many other libraries that you'll feel like giving up.\r\n\r\nLearn about how Narwhals allows you to write dataframe-agnostic tools which can support all of the above, with zero dependencies, low overhead, static typing, and strong backwards-compatibility promises!",
			"speakers": [
				"KEUJ9U"
			],
			"track": 5215,
			"start": "2025-04-25T10:55:00+02:00",
			"end": "2025-04-25T11:25:00+02:00",
			"room": 3893,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.153414+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "ZMKJAY",
			"id": 1182115,
			"title": "Death by a Thousand API Versions",
			"abstract": "API versioning is tough, really tough. We tried multiple approaches to versioning in production and eventually ended up with a solution we love. During this talk you will look into the tradeoffs of the most popular ways to do API versioning, and I will recommend which ones are fit for which products and companies. I will also present my framework, Cadwyn, that allows you to support hundreds of API versions with ease -- based on FastAPI and inspired by Stripe's approach to API versioning.\r\n\r\nAfter this session, you will understand which approach to pick for your company to make your versioning cost effective and maintainable without investing too much into it.",
			"speakers": [
				"UDHJSP"
			],
			"track": 5210,
			"start": "2025-04-25T10:55:00+02:00",
			"end": "2025-04-25T11:25:00+02:00",
			"room": 3895,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.153444+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "JUQ9JJ",
			"id": 1182114,
			"title": "High-performance dataframe-agnostic GLMs with glum",
			"abstract": "Generalized linear models (GLMs) are interpretable, relatively quick to train, and specifying them helps the modeler understand the main effects in the data. This makes them a popular choice today to complement other machine-learning approaches. `glum` was conceived with the aim of offering the community an efficient, feature-rich, and Python-first GLM library with a scikit-learn-style API. More recently, we are striving to keep up with PyData community's ongoing push for dataframe-agnosticism.\r\nWhile `glum` was originally heavily based on `pandas`, with the help of `narwhals`, we are close to being able to fit models on any dataset that the latter supports. This talk presents our experiences with achieving this goal.",
			"speakers": [
				"TP9PQN"
			],
			"track": 5215,
			"start": "2025-04-25T10:55:00+02:00",
			"end": "2025-04-25T11:25:00+02:00",
			"room": 3897,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.153429+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "CZXBEP",
			"id": 1182111,
			"title": "Filling in the Gaps: When Terraform Falls Short, Python and Typer Step In",
			"abstract": "Not all resources in today’s cloud environments have native Terraform providers. That’s where Python’s Typer library can step in, offering a flexible, production-ready command-line interface (CLI) framework to help fill in the gaps. In this session, we’ll explore how to integrate Typer with Terraform to manage resources that fall outside Terraform’s direct purview. We’ll share a real-life example of how Typer was used alongside Terraform to automate and streamline the management of an otherwise unsupported API. You’ll learn how Terraform can invoke Python scripts—passing arguments and parameters to control complex operations—while still benefiting from Terraform’s declarative model and lifecycle management. We’ll also discuss best practices for defining resource lifecycles to ensure easy maintainability and consistency across deployments. By the end, participants will see how combining Terraform’s robust infrastructure-as-code approach with Python’s versatility and Typer’s user-friendly CLI can create a powerful, cohesive strategy for managing even the trickiest resources in production environments.",
			"speakers": [
				"Z8HXML"
			],
			"track": 5219,
			"start": "2025-04-25T10:55:00+02:00",
			"end": "2025-04-25T11:25:00+02:00",
			"room": 3899,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.153383+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "DSHASE",
			"id": 1182112,
			"title": "Using Python to enter the world of Microcontrollers",
			"abstract": "So you've happily used the Raspberry Pi for your homelab projects, of course with Python based solutions as we all do. You've been down the rabbit hole with everything about temperature and humidity measurements, energy and solar tracking, video recording and time-lapse photography, object detection and security surveillance.\r\n\r\nYou don't just buy these things of the shelve. You want to deeply understand what it takes to create such a thing, and you've been quite happy with your results so far, learned a lot. \r\n\r\nBut for many simple applications ... the power draw! Yes, it's just 5 Watts you say for using a Raspberry Pi. Not a big deal in terms of cost. But you'll always need a power adapter and a free socket.\r\n\r\nYou've heard of these guys using microcontrollers that run on batteries or even solar, for days, weeks, even months.\r\n\r\nThat's exciting, but there's also a catch. These people write code in C-like languages, they build firmware to make their projects run. And it's all bare metal! That seems very different. That'll be a steep learning curve to take ... Or is it?\r\n\r\nWell, there's MicroPython to the rescue. Let me take you with me on a journey to make a simple microcontroller based application to read a Power Meter and send the readings over WiFi for more in depth processing somewhere else.",
			"speakers": [
				"DUSVE9"
			],
			"track": 5290,
			"start": "2025-04-25T10:55:00+02:00",
			"end": "2025-04-25T11:25:00+02:00",
			"room": 3894,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.153399+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "AEUZGX",
			"id": 1182116,
			"title": "PosePIE: Replace Your Keyboard and Mouse With AI-Driven Gesture Control",
			"abstract": "In this talk, we show how to leverage publicly available tools to control any game or program using hand or body movements. To achieve this, we introduce PosePIE, an open-source programmable input emulator that generates input events on virtual gamepads, keyboards and mice based on gestures recognized by using AI-driven pose estimation. PosePIE is fully configurable by the user through Python scripts, making it easily adaptable to new applications.",
			"speakers": [
				"V3UMNK"
			],
			"track": 5289,
			"start": "2025-04-25T10:55:00+02:00",
			"end": "2025-04-25T11:25:00+02:00",
			"room": 3898,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.153468+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "QXSQKL",
			"id": 1182124,
			"title": "Rustifying Python: A Practical Guide to Achieving High Performance While Maintaining Observability",
			"abstract": "In this session, I’ll share our journey of migrating key parts of a Python application to Rust, resulting in over 200% performance improvement.\r\nRather than focusing on quick Rust-to-Python integration with PyO3, this talk dives into the complexities of implementing such a migration in an enterprise environment, where reliability, scalability, and observability are crucial.\r\nYou’ll learn from our mistakes, how we identified suitable areas for Rust integration, and how we extended our observability tools to cover Rust components.\r\nThis session offers practical insights for improving performance and reliability in Python applications using Rust.",
			"speakers": [
				"ZYGLV3"
			],
			"track": 5206,
			"start": "2025-04-25T11:35:00+02:00",
			"end": "2025-04-25T12:20:00+02:00",
			"room": 3894,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.153683+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "JABVHK",
			"id": 1182119,
			"title": "Enhancing RAG with Fast GraphRAG and InstructLab: A Scalable, Interpretable, and Efficient Framework",
			"abstract": "Retrieval Augmented Generation (RAG) has become a cornerstone in enriching GenAI outputs with external data, yet traditional frameworks struggle with challenges like data noise, domain specialization, and scalability. In this talk, Tuhin will dive into open-source frameworks Fast GraphRAG and InstructLab, which addresses these limitations by combining knowledge graphs with the classical PageRank algorithm and Fine-tuning, delivering a precision-focused, scalable, and interpretable solution. By leveraging the structured context of knowledge graphs, Fast GraphRAG enhances data adaptability, handles dynamic datasets efficiently, and provides traceable, explainable outputs while InstructLab adds domain depth to the LLM through Fine-tuning. Designed for real-world applications, it bridges the gap between raw data and actionable insights, redefining intelligent retrieval for developers, researchers, and enterprises. This talk will showcase Fast GraphRAG’s transformative features coupled with domain specific Fine-tuning leveraging InstructLab and demonstrate its potential to elevate RAG’s capabilities in handling the evolving demands of large language models (LLMs) for developers, researchers, and businesses.",
			"speakers": [
				"8BDEZN"
			],
			"track": 5214,
			"start": "2025-04-25T11:35:00+02:00",
			"end": "2025-04-25T12:05:00+02:00",
			"room": 3896,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.153590+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "HQWAYP",
			"id": 1182120,
			"title": "Topological data analysis: How to quantify \"holes\" in your data and why?",
			"abstract": "Do you need to compare sets of points in a plane? Identify a potential cyclic event in high-dimensional time series data? Find the second or the third highest peak of a noisily sampled function? Topological data analysis (TDA) is not a universal hammer, but it might just be the 16 mm wrench for your 16 mm hex head bolt. There is no shortage of Python libraries implementing TDA methods for various settings, but navigating the options can be challanging without prior familiarity with the topic. In my talk I will demonstrate the utility of the tool with several simple examples, list various libraries used by the TDA community, and dive a bit deeper into the methods to explain what the libraries implement and how to interpret and work with the outputs.",
			"speakers": [
				"ZTVM8H"
			],
			"track": 5215,
			"start": "2025-04-25T11:35:00+02:00",
			"end": "2025-04-25T12:20:00+02:00",
			"room": 3893,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.153608+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "PLMJZ8",
			"id": 1182122,
			"title": "Code & Community: The Synergy of Community Building and Task Automation",
			"abstract": "The Python community is built on a culture of support, inclusion, and collaboration. Sustaining this welcoming environment requires intentional community-building efforts, which often involve repetitive or time-consuming tasks. These tasks, however, can be automated without compromising their value—freeing up time for meaningful human engagement.\r\n\r\nThis talk showcases my project aimed at supporting underrepresented groups in tech, specifically through building Python communities on Mastodon and Bluesky. A key part of this initiative is the \"Awesome PyLadies\" repository, a curated collection of PyLadies blogs and YouTube channels that celebrates their work. To enhance visibility, I created a PyLadies bot for social media. This bot automates regular posts and reposts tagged content, significantly extending their reach and fostering an engaged community.\r\n\r\nIn this session, I’ll cover:\r\n- The role of automation in community building\r\n- The technical architecture behind the bot\r\n- A hands-on demo on integrating Google’s Gemini into community tools\r\n- Upcoming features and opportunities for collaboration\r\n\r\nBy combining Python, automation, and modern AI capabilities, we can create thriving, inclusive communities that scale impact while staying true to the human-centered ethos of open source.",
			"speakers": [
				"7GY7XH"
			],
			"track": 5213,
			"start": "2025-04-25T11:35:00+02:00",
			"end": "2025-04-25T12:05:00+02:00",
			"room": 3899,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.153638+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "3DSU8V",
			"id": 1182118,
			"title": "Hands-On LLM Security: Attacks and Countermeasures You Need to Know!",
			"abstract": "Dive into the vulnerabilities of LLMs and learn how to prevent them\r\nFrom prompt injection to data poisoning, we’ll demonstrate real-world attack scenarios and reveal essential countermeasures to safeguard your applications.",
			"speakers": [
				"DS3TQU",
				"BZNSWG"
			],
			"track": 5208,
			"start": "2025-04-25T11:35:00+02:00",
			"end": "2025-04-25T12:20:00+02:00",
			"room": 3895,
			"duration": 45,
			"updated": "2025-04-09T08:21:33.153558+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "DPAPUA",
			"id": 1182121,
			"title": "GitMLOps – How we are managing 100+ ML pipelines in AWS SageMaker",
			"abstract": "Scaling machine learning pipelines is no small feat - especially when you’re managing over 100 of them on AWS SageMaker. In this talk, I’ll take you behind the scenes of how our team at idealo built a Git-based MLOps framework that powers millions of real-time recommendations every minute.\r\n\r\nI’ll share the challenges we faced, the solutions we implemented, and the lessons we learned while streamlining model versioning, deployment, and monitoring. This session is packed with actionable takeaways for ML engineers, data scientists, and DevOps professionals looking to simplify their MLOps workflows and operate efficiently at scale.\r\n\r\nWhether you’re running a handful of pipelines or preparing to scale up, this talk will equip you with the tools and strategies to tackle MLOps with confidence.",
			"speakers": [
				"HECXGZ"
			],
			"track": 5205,
			"start": "2025-04-25T11:35:00+02:00",
			"end": "2025-04-25T12:05:00+02:00",
			"room": 3897,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.153623+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "CVMPVG",
			"id": 1182123,
			"title": "Guardians of the Code: Safeguarding Machine Learning Models in a Climate Tech World",
			"abstract": "LLMs, Machine learning and AI are everywhere, yet their security is often overlooked, leaving your systems vulnerable to serious attacks. What happens when someone tampers with your model’s input, poisons your training data, or steals your model?\r\n\r\nIn this talk, I’ll explore these risks through the lens of the OWASP Machine Learning Security Top 10 using relatable, real-world examples from the climate tech world. I’ll explain how these attacks happen, their impact, and why they matter to you as a Python developer, data scientist, or data engineer.\r\n\r\nYou’ll learn practical ways to defend your models and pipelines, ensuring they’re robust against adversarial forces. Bridging theory and practice, you'll leave equipped with insights and strategies to secure your machine learning systems, whether you’re training models or deploying them in production. By the end, you’ll have a solid understanding of the risks, a toolkit of best practices, and maybe even a new perspective on how important security is everywhere.",
			"speakers": [
				"HQ9CRY"
			],
			"track": 5205,
			"start": "2025-04-25T11:35:00+02:00",
			"end": "2025-04-25T12:05:00+02:00",
			"room": 3898,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.153660+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"id": 1182133,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-25T10:20:00Z",
			"end": "2025-04-25T13:20:00+02:00",
			"room": 3896
		},
		{
			"id": 1182129,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-25T10:20:00Z",
			"end": "2025-04-25T13:05:00+02:00",
			"room": 3901
		},
		{
			"id": 1182127,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-25T10:20:00Z",
			"end": "2025-04-25T13:20:00+02:00",
			"room": 3897
		},
		{
			"id": 1182126,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-25T10:20:00Z",
			"end": "2025-04-25T13:20:00+02:00",
			"room": 3898
		},
		{
			"id": 1182131,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-25T10:20:00Z",
			"end": "2025-04-25T13:20:00+02:00",
			"room": 3894
		},
		{
			"id": 1182130,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-25T10:20:00Z",
			"end": "2025-04-25T13:20:00+02:00",
			"room": 3895
		},
		{
			"id": 1182125,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-25T10:20:00Z",
			"end": "2025-04-25T13:20:00+02:00",
			"room": 3893
		},
		{
			"id": 1182132,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-25T10:20:00Z",
			"end": "2025-04-25T13:20:00+02:00",
			"room": 3899
		},
		{
			"id": 1182128,
			"title": {
				"en": "Lunch Break"
			},
			"start": "2025-04-25T10:20:00Z",
			"end": "2025-04-25T13:05:00+02:00",
			"room": 3900
		},
		{
			"code": "LBKU3T",
			"id": 1182134,
			"title": "What's inside the box? Building a deep learning framework from scratch.",
			"abstract": "Explore the inner workings of deep learning frameworks like TensorFlow and PyTorch by building your own in this workshop. We will start with the fundamental automatic differentiation mechanics and proceed to implementing more complex components like layers, modules and optimizers. This workshop is mainly designed for experienced data scientists, who want to expand their intuition about lower level framework internals.",
			"speakers": [
				"NWAQCX"
			],
			"track": 5212,
			"start": "2025-04-25T13:05:00+02:00",
			"end": "2025-04-25T14:35:00+02:00",
			"room": 3901,
			"duration": 90,
			"updated": "2025-04-09T08:21:33.153976+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "VBW3EK",
			"id": 1182135,
			"title": "Reinforcement Learning for Finance",
			"abstract": "Reinforcement Learning and related algorithms, such as Deep Q-Learning (DQL), have led to major breakthroughs in different fields. DQL, for example, is at the core of the AIs developed by DeepMind that achieved superhuman levels in such complex games as Chess, Shogi, and Go (\"AlphaGo\", \"AlphaZero\"). Reinforcement Learning can also be beneficially applied to typical problems in finance, such as algorithmic trading, dynamic hedging of options, or dynamic asset allocation. The workshop addresses the problem of limited data availability in finance and solutions to it, such as synthetic data generation through GANs. It also shows how to apply the DQL algorithm to typical financial problems. The workshop is based on my new O'Reilly book \"Reinforcement Learning for Finance -- A Python-based Introduction\".",
			"speakers": [
				"YL8CRG"
			],
			"track": 5212,
			"start": "2025-04-25T13:05:00+02:00",
			"end": "2025-04-25T14:35:00+02:00",
			"room": 3900,
			"duration": 90,
			"updated": "2025-04-09T08:21:33.153993+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "QN3BTA",
			"id": 1182140,
			"title": "From stockouts to happy customers: Proven solutions for time series forecasting in retail",
			"abstract": "Time series forecasting in the retail industry is uniquely challenging: Datasets often include stockouts that censor actual demand, promotional events cause irregular demand spikes, new product launches face cold-start issues, and diverse demand patterns within an imbalanced product portfolio create modeling challenges.\r\nIn this talk, we’ll explore proven, real-world strategies and examples to address these problems. Learn how to successfully handle censored demand caused by stockouts, effectively incorporate promotional effects, and tackle the variability of diverse products using clustering and ensembling strategies. Whether you’re a seasoned data scientist or a Python developer exploring forecasting, the goal of this session is to introduce you to the key challenges in retail forecasting and equip you with actionable insights to successfully overcome them in real-life scenarios.",
			"speakers": [
				"CAH7QT"
			],
			"track": 5212,
			"start": "2025-04-25T13:20:00+02:00",
			"end": "2025-04-25T13:50:00+02:00",
			"room": 3893,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.154085+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "P9VKRV",
			"id": 1182138,
			"title": "Extending Python with Rust, Mojo, Cuda and C and building packages",
			"abstract": "We all love Python - but we especially love it for its unique ability as a glue language.\r\n\r\nIn this talk we will show a number of ways of extending Python: using Rust, C and Cython, C++, CUDA and Mojo! We will use the pixi package manager and the open source conda-forge distribution to demonstrate how to easily build custom Python extensions with these languages.\r\n\r\nThe main challenge with custom extensions is about distributing them. The new pixi build feature makes it easy to build a Python extension into a conda package as well as wheel file for PyPI.\r\n\r\nPixi will manage not only Python, but also the compilers and other system-level dependencies.",
			"speakers": [
				"8ZWEGR",
				"7YTCGE"
			],
			"track": 5215,
			"start": "2025-04-25T13:20:00+02:00",
			"end": "2025-04-25T13:50:00+02:00",
			"room": 3894,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.154049+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "DNVCEY",
			"id": 1182139,
			"title": "Electify - Retrieval-Augmented Generation for Voter Information in the 2024 European Election",
			"abstract": "In general elections, voters often face the challenge of navigating complex political landscapes and extensive party manifestos. To address this, we developed Electify, an interactive application that utilizes Retrieval-Augmented Generation (RAG) to provide concise summaries of political party positions based on individual user queries. During its first roll-out for the European Election 2024, Electify attracted more than 6,000 active users. This talk will explore its development and deployment. It will focus on its technical architecture, the integration of data from party manifestos and parliamentary speeches, and the challenges of ensuring political neutrality and providing accurate replies. Additionally, we will discuss user feedback and ethical considerations, focusing on how generative AI can enhance voter information systems.",
			"speakers": [
				"GMGGWH"
			],
			"track": 5213,
			"start": "2025-04-25T13:20:00+02:00",
			"end": "2025-04-25T13:50:00+02:00",
			"room": 3895,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.154069+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "SFDRTR",
			"id": 1182142,
			"title": "Vector Streaming: The Memory Efficient Indexing for Vector Databases",
			"abstract": "Vector databases are everywhere, powering LLMs. But indexing embeddings, especially multivector embeddings like ColPali and Colbert, at a bulk is memory intensive. Vector streaming solves this problem by parallelizing the tasks of parsing, chunking, and embedding generation and indexing it continuously chunk by chunk instead of bulk. This not only increase the speed but also makes the whole task more optimized and memory efficient.\r\n\r\nThe library gives many vector database supports, like Pinecone, Weavaite, and Elastic.",
			"speakers": [
				"FTZPWC",
				"L8YCSG"
			],
			"track": 5393,
			"start": "2025-04-25T13:20:00+02:00",
			"end": "2025-04-25T13:50:00+02:00",
			"room": 3898,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.154114+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "98FQDY",
			"id": 1182136,
			"title": "What we talk about when we talk about AI skills.",
			"abstract": "Defining what constitutes AI skills has always been ambiguous. As AI adoption accelerates across industries and the European AI Act mandates companies to ensure AI literacy among their staff, organizations face growing even more challenges in defining and developing AI competencies. In this talk, we'll present a comprehensive framework developed by the appliedAI Institute's experts that categorizes AI skills across technical, regulatory, strategic, and innovation domains. We'll also share initial data on current AI skills levels and upskilling needs and provide practical strategies for organizations to assess, develop, and acquire the AI capabilities required for their specific needs.",
			"speakers": [
				"WVNMPG"
			],
			"track": 5292,
			"start": "2025-04-25T13:20:00+02:00",
			"end": "2025-04-25T13:50:00+02:00",
			"room": 3899,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.154008+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "P8GUWG",
			"id": 1182137,
			"title": "Is your LLM any good at writing? Benchmarking on creative writing and editing tasks",
			"abstract": "Many LLM benchmarks focus on reasoning and coding tasks. These are exciting tasks! But the majority of LLM usage is still in writing and editing related tasks, and there's a surprising lack of benchmarks on these. \r\n\r\nIn this talk you'll learn what it took to create a writing benchmark, and which model performs best!",
			"speakers": [
				"MUAVLE"
			],
			"track": 5213,
			"start": "2025-04-25T13:20:00+02:00",
			"end": "2025-04-25T13:50:00+02:00",
			"room": 3896,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.154023+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "KTJY9V",
			"id": 1182141,
			"title": "Responsible AI with fmeval - an open source library to evaluate LLMs",
			"abstract": "The term \"Responsible AI\" has seen a threefold increase in search interest compared to 2020 across the globe. As developers, the questions like \"How can we build large language model-enabled applications that are responsible and accountable to its users?\" encountered in the conversation more often than before. And the discussion is further compounded by concerns surrounding uncertainty, bias, explainability, and other ethical considerations.\r\n\r\nIn this session, the speaker will guide you through fmeval, an open-source library designed to evaluate Large Language Models (LLMs) across a range of tasks. The library provides notebooks that you can integrate into your daily development process, enabling you to identify, measure, and mitigate potential responsible AI issues throughout your system development lifecycle.",
			"speakers": [
				"3MKT9M"
			],
			"track": 5215,
			"start": "2025-04-25T13:20:00+02:00",
			"end": "2025-04-25T13:50:00+02:00",
			"room": 3897,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.154100+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "B8TUR9",
			"id": 1182145,
			"title": "Optimizing Energy Tariffing System with Formal Concept Analysis and Dash",
			"abstract": "As a data scientist, I value the power of insightful visualizations to unlock unique interpretations of complex data. In my talk, I will introduce an elegant mathematical framework called Formal Concept Analysis (FCA), developed in the 1980s in Darmstadt.\r\n\r\nFCA transforms binary data into concepts that can be visualized as a hierarchical graph, offering a fresh perspective on multidimensional data analysis. Leveraging this theory and its open-source Python libraries, I am developing an interactive Dash-based tool featuring interactive tables and graphs to explore data insights.\r\n\r\nTo illustrate its potential, I will showcase an optimization of the entire tariffing system of an energy provider company, highlighting how FCA can bring structure and clarity to even such tangled datasets.",
			"speakers": [
				"RTUMVM"
			],
			"track": 5216,
			"start": "2025-04-25T14:00:00+02:00",
			"end": "2025-04-25T14:30:00+02:00",
			"room": 3899,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.154174+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "GUEAHT",
			"id": 1182149,
			"title": "Offline Disaster Relief Coordination with OpenStreetMap and FastAPI",
			"abstract": "In natural disaster scenarios, reliable communication is crucial. This talk presents a solution for disaster relief coordination using OpenStreetMap vector maps hosted on a local device in the emergency vehicle with FastAPI, ensuring functionality without an internet connection. By integrating a database of post codes and street names, and leveraging a LORAWAN gateway to receive positional data and water levels, this system ensures access to critical information even in blackout situations.",
			"speakers": [
				"KSM737"
			],
			"track": 5219,
			"start": "2025-04-25T14:00:00+02:00",
			"end": "2025-04-25T14:30:00+02:00",
			"room": 3894,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.154246+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "JH97CL",
			"id": 1182144,
			"title": "Pipeline-level differentiable programming for the real world",
			"abstract": "Automatic Differentiation (AD) is not only the backbone of modern deep learning but also a transformative tool across various domains such as control systems, materials science, weather prediction, 3D rendering, data-driven scientific discovery, and so on. Thanks to a mature ML framework ecosystem, powered by libraries like PyTorch and JAX, AD performs remarkably well at a component level; however, integrating these components into differentiable pipelines still remains a significant challenge. In this talk, we will provide an accessible introduction to (pipeline-level) AD, demonstrate some cool applications you can build with it, and see how to build differentiable pipelines that hold up in the real world.",
			"speakers": [
				"YHXMHL"
			],
			"track": 5291,
			"start": "2025-04-25T14:00:00+02:00",
			"end": "2025-04-25T14:30:00+02:00",
			"room": 3898,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.154158+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "3VYSMS",
			"id": 1182143,
			"title": "You don’t think about your Streamlit app optimization until you try to deploy it to the cloud",
			"abstract": "Building Streamlit apps is easy for Data Scientists - but when it’s time to deploy them to the cloud, challenges like slow model loading, scalability, and security can become major hurdles. This talk bridges two perspectives: the Data Scientist who builds the app and the MLOps engineer who deploys it. We'll dive into optimizing model loading from Hugging Face Hub, implementing features like autoscaling and authentication, and securing your app against potential threats. By the end of this talk, you’ll be ready to design Streamlit apps that are functional and deployment-ready for the cloud.",
			"speakers": [
				"37RKBL"
			],
			"track": 5205,
			"start": "2025-04-25T14:00:00+02:00",
			"end": "2025-04-25T14:30:00+02:00",
			"room": 3897,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.154139+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "CUJMCD",
			"id": 1182147,
			"title": "Practical Python/Rust: Building and Maintaining Dual-Language Libraries",
			"abstract": "Building performant Python often means reaching for C extensions. This talk explores an alternative: leveraging Rust to create blazing-fast Python modules that also benefit the Rust ecosystem. I will share practical strategies from building `semantic-text-splitter`, a library for fast and accurate text segmentation used in both Python and Rust, demonstrating how to bridge the gap between these two languages and unlock new possibilities for performance and cross-language collaboration.",
			"speakers": [
				"KZEU3C"
			],
			"track": 5393,
			"start": "2025-04-25T14:00:00+02:00",
			"end": "2025-04-25T14:30:00+02:00",
			"room": 3895,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.154205+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "RAHBEP",
			"id": 1182148,
			"title": "Forecast of Hourly Train Counts on Rail Routes Affected by Construction Work",
			"abstract": "Construction work in national railroad networks often disrupts train traffic, making it vital to estimate hourly train numbers for effective re-routing. Traditionally managed by humans, this process has been automated due to staff shortages and demographic changes. DB Systel GmbH, Deutsche Bahn's IT provider, leveraged machine learning and artificial intelligence to estimate train traffic during construction. Using Python and frameworks like Pandas, scikit-learn, NumPy, PyTorch and Polars, their solution demonstrated significant benefits in performance and efficiency.",
			"speakers": [
				"DCTDRA",
				"DAPDTE"
			],
			"track": 5212,
			"start": "2025-04-25T14:00:00+02:00",
			"end": "2025-04-25T14:30:00+02:00",
			"room": 3893,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.154221+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "MNTFRG",
			"id": 1182146,
			"title": "Using Causal thinking to make Media Mix Modeling",
			"abstract": "In today's data-driven landscape, understanding causal relationships is essential for effective marketing strategies. This talk will explore the link between Bayesian causal thinking and media mix modeling, utilizing Directed Acyclic Graphs (DAGs), Structural Causal Models (SCMs), and the Data Generation Process (DGP).\r\n\r\nWe will examine how DAGs represent causal assumptions, how SCMs define relationships in media mix models, and how to implement these models within a Bayesian framework. By using media mix models as causal inference tools, we can estimate counterfactuals and causal effects, offering insights into the effectiveness of media investments.",
			"speakers": [
				"FNLJZD"
			],
			"track": 5215,
			"start": "2025-04-25T14:00:00+02:00",
			"end": "2025-04-25T14:30:00+02:00",
			"room": 3896,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.154190+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "MJD7TG",
			"id": 1182151,
			"title": "What do a tree and the human brain have in common-a not so serious introduction to digital pathology",
			"abstract": "While trees and human brains don't share that many properties regarding their domain, the analysis of the height of a tree and cancer in human brains does.\r\nThis talk provides a not-so-serious introduction to the domain of computer vision for pathological use cases. \r\nBesides a general introduction to (digital) pathology and the technical similarities between satellite images (GeoTIFs) and pathological images (Whole-Slide Images), we will take a look at computer vision (both ML-based and conventional) on Python.\r\nWhether you have never done image processing in Python, are an expert (ready to share some tricks with me), or are just curious to see pictures of a human brain, this talk is for you.\r\nWarning: this talk contains quite abstract pink-ish pictures of human tissue (and trees^^). If you are unsure this is something you are comfortable with (have a friend), do a quick search for \"HE-stained whole-slide image\".",
			"speakers": [
				"CZVWXB"
			],
			"track": 5289,
			"start": "2025-04-25T14:40:00+02:00",
			"end": "2025-04-25T15:10:00+02:00",
			"room": 3897,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.154282+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "RQ8JBM",
			"id": 1182150,
			"title": "Intuitive A/B Test Evaluations for Coders",
			"abstract": "A/B testing is a critical tool for making data-driven decisions, yet its statistical underpinnings—p-values, confidence intervals, and hypothesis testing—are often challenging for those without a background in statistics. Coders frequently encounter these concepts but lack a straightforward way to compute and interpret them using their existing skill set.\r\nThis talk presents a practical approach to A/B test evaluations tailored for coders. By utilizing Python’s random number generator and basic loops, it introduces bootstrapping as an accessible method for calculating p-values and confidence intervals directly from data. The goal is to simplify statistical concepts and provide coders with an intuitive understanding of how to evaluate test results without relying on complex formulas or statistical jargon.",
			"speakers": [
				"ED3NBU"
			],
			"track": 5212,
			"start": "2025-04-25T14:40:00+02:00",
			"end": "2025-04-25T15:10:00+02:00",
			"room": 3900,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.154261+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "9CRNU3",
			"id": 1182155,
			"title": "Building a HybridRAG Document Question-Answering System",
			"abstract": "Retrieval Augmented Generation (RAG) is a powerful technique for searching across unstructured documents, but it often falls short when the task demands an understanding of intricate relationships between entities. GraphRAG addresses this by leveraging knowledge graphs to capture these relationships, but it struggles with scalability and handling diverse unstructured formats. In this talk, we’ll explore how HybridRAG combines the strengths of both approaches - RAG for scalable unstructured data retrieval and GraphRAG for semantic richness- to deliver accurate and contextually relevant answers. We’ll dive into its application, challenges, and the significant improvements it offers for question-answering systems across various domains.",
			"speakers": [
				"37RKBL"
			],
			"track": 5213,
			"start": "2025-04-25T14:40:00+02:00",
			"end": "2025-04-25T15:10:00+02:00",
			"room": 3896,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.154354+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "ECNDQM",
			"id": 1182156,
			"title": "3 Ways to Speed up Your Regression Modeling in Python",
			"abstract": "Linear Regression is the workhorse of statistics and data science. Some data scientists even go as far and argue that \"linear regression is all you need\". \r\n\r\nIn this talk, we will introduce three ways to run regression models faster by using smarter algorithms, implemented in the scikit-learn & fastreg (sparse solvers), pyfixest (Frisch-Waugh-Lovell), and duckreg (regression compression via duckdb) libraries.",
			"speakers": [
				"KFGF9T"
			],
			"track": 5212,
			"start": "2025-04-25T14:40:00+02:00",
			"end": "2025-04-25T15:10:00+02:00",
			"room": 3894,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.154369+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "WUH93P",
			"id": 1182158,
			"title": "Graph Neural Networks for Collusion Detection using PyTorch and Deep Graph Library",
			"abstract": "Collusion is a complex phenomenon in which companies secretly collaborate to engage in fraudulent practices. This talk presents an innovative methodology for detecting and predicting collusion patterns in different national markets using neural networks (NNs) and graph neural networks (GNNs). GNNs are particularly well suited to this task because they can exploit the inherent network structures present in collusion and many other economic problems. In Python, we use PyTorch and the Deep Graph Library (DGL) to develop and train models on individual market datasets from Japan, the United States, two regions in Switzerland, Italy, and Brazil, focusing on predicting collusion in single markets. In our empirical study, we show that GNNs outperform NNs in detecting complex collusive patterns. This research contributes to the ongoing discourse on preventing collusion and optimizing detection methodologies, providing valuable guidance on the use of NNs and GNNs in economic applications to enhance market fairness and economic welfare.",
			"speakers": [
				"WB3ZFH"
			],
			"track": 5212,
			"start": "2025-04-25T14:40:00+02:00",
			"end": "2025-04-25T15:10:00+02:00",
			"room": 3895,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.154399+00:00",
			"state": null,
			"do_not_record": true
		},
		{
			"code": "HKYQDB",
			"id": 1182154,
			"title": "Langfuse, OpenLIT, and Phoenix: Observability for the GenAI Era",
			"abstract": "Large Language Models (LLMs) are transforming digital products, but their non-deterministic behaviour challenges predictability and testing, making observability essential for quality and scalability.\r\n\r\nThis talk presents **observability for LLM-based applications**, spotlighting three tools: Langfuse, OpenLIT, and Phoenix. We'll share best practices about what and how to monitor LLM features and explore each tool's strengths and limitations. \r\n\r\nLangfuse excels in tracing and quality monitoring but lacks OpenTelemetry support and customization. OpenLIT, while less mature, integrates well with existing observability stacks using **OpenTelemetry**. Phoenix stands out in debugging and experimentation but struggles with real-time tracing.\r\n\r\nThe comparison will be enhanced by **live coding examples**.\r\n\r\nAttendees will walk away with an improved understanding of observability for **GenAI applications** and will understand which tool to use for their use case.",
			"speakers": [
				"9CGGBC"
			],
			"track": 5207,
			"start": "2025-04-25T14:40:00+02:00",
			"end": "2025-04-25T15:10:00+02:00",
			"room": 3899,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.154340+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "YLKDJK",
			"id": 1182157,
			"title": "The Forecast Whisperer: Secrets of Model Tuning Revealed",
			"abstract": "Forecasting can often feel like interpreting vague signals—unclear yet full of potential. In this talk, we’ll cover advanced techniques for tuning forecasting models in professional settings, moving beyond the basics to explore methods that enhance both accuracy and interpretability.\r\n\r\nYou’ll learn:\r\n\r\nHow to set clear business goals for ML model tuning and align technical work with business needs, including balancing forecast granularity and accuracy and selecting statistically correct metric.\r\n\r\nPractical data preparation methods, including business-driven data cleaning and detecting data problems with statistical and buiness driven approaches.\r\n\r\nAdvanced feature selection techniques such as recursive feature elimination and SHAP values, alongside hyperparameter tuning strategies including Bayesian optimization and ensemble methods.\r\n\r\nHow generative AI can support model tuning by automating feature generation, hyperparameter search, and enhancing model explainability through SHAP and LIME techniques.\r\n\r\nReal-world case studies, including how Blue Yonder’s data science team optimized demand forecasting models for retail and supply chain applications.\r\n\r\nWe'll also discuss common mistakes like overfitting and data leakage, best practices for reliable validation, and the importance of domain knowledge in successful forecasting. Whether you're a seasoned data scientist or exploring time series forecasting, you'll gain advanced insights and techniques you can apply immediately.",
			"speakers": [
				"YTUJ88"
			],
			"track": 5212,
			"start": "2025-04-25T14:40:00+02:00",
			"end": "2025-04-25T15:10:00+02:00",
			"room": 3901,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.154384+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "ZT3MGL",
			"id": 1182153,
			"title": "From Rules to Reality: Python's Role in Shaping Roundnet",
			"abstract": "Roundnet is a dynamic and fast-growing sport that combines quick reaction, athleticism, and strong community. However, like many emerging sports, it faces challenges in balancing competition, optimizing rules, and increasing accessibility for both players and spectators. This is where Python and data analysis come into play.\r\n\r\nIn this talk, I'll share insights from my role as Data Lead on the International Roundnet rule committee, where we use Python-powered data analysis to make informed decisions about the future of the sport. We'll explore how analyzing gameplay patterns and testing rule changes with simulation can lead to fairer, more exciting games and attract a broader audience.",
			"speakers": [
				"HVSNHD"
			],
			"track": 5211,
			"start": "2025-04-25T14:40:00+02:00",
			"end": "2025-04-25T15:10:00+02:00",
			"room": 3898,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.154324+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"code": "8PFFPS",
			"id": 1182152,
			"title": "Demystifying Design Patterns: A Practical Guide for Developers",
			"abstract": "Do you ever worry about your code becoming spaghetti-like and difficult to maintain?\r\nMaster the art of crafting clean, maintainable, and adaptable software by harnessing the power of design patterns. This presentation will empower you with a clear, structured understanding of these reusable solutions to address common programming challenges.\r\n\r\nWe'll delve into design patterns’ key categories: Behavioral, Structural, and Creational, as well as explore their functionality and how they can be applied in your daily development workflow. For each category, we'll also explore a practical design pattern in detail and showcase real-world applications of these patterns, along with small-scale code examples that illustrate their practical implementation.\r\n\r\nYou'll gain valuable insight into how these patterns can translate into real-world development scenarios, such as facilitating communication between objects (Behavioral), separating interfaces from implementation for flexibility (Structural), and enabling dynamic algorithm selection at runtime (Creational).",
			"speakers": [
				"MQ7JUZ"
			],
			"track": 5206,
			"start": "2025-04-25T14:40:00+02:00",
			"end": "2025-04-25T15:10:00+02:00",
			"room": 3893,
			"duration": 30,
			"updated": "2025-04-09T08:21:33.154306+00:00",
			"state": null,
			"do_not_record": false
		},
		{
			"id": 1182159,
			"title": {
				"en": "Closing Session"
			},
			"start": "2025-04-25T13:20:00Z",
			"end": "2025-04-25T15:45:00+02:00",
			"room": 3893
		}
	],
	"version": "0.18",
	"timezone": "Europe/Berlin",
	"event_start": "2025-04-23",
	"event_end": "2025-04-25",
	"tracks": [
		{
			"id": 5393,
			"name": {
				"en": "General: Rust"
			},
			"description": {
				"en": "Talks about the Rust programming language."
			},
			"color": "#000000"
		},
		{
			"id": 5205,
			"name": {
				"en": "PyCon: MLOps & DevOps"
			},
			"description": {
				"en": "DevOps, MLOps, CI/CD,…"
			},
			"color": "#000000"
		},
		{
			"id": 5206,
			"name": {
				"en": "PyCon: Programming & Software Engineering"
			},
			"description": {
				"en": "Best practices for software engineering & programming."
			},
			"color": "#000000"
		},
		{
			"id": 5207,
			"name": {
				"en": "PyCon: Python Language & Ecosystem"
			},
			"description": {
				"en": "New features in Python, about the standard library, performance, and the ecosystem in general."
			},
			"color": "#000000"
		},
		{
			"id": 5208,
			"name": {
				"en": "PyCon: Security"
			},
			"description": {
				"en": "Everything related to information security and secure coding."
			},
			"color": "#000000"
		},
		{
			"id": 5209,
			"name": {
				"en": "PyCon: Testing"
			},
			"description": {
				"en": "Anything about testing software & unit testing."
			},
			"color": "#000000"
		},
		{
			"id": 5210,
			"name": {
				"en": "PyCon: Django & Web"
			},
			"description": {
				"en": "Everything related to the Django and web in general."
			},
			"color": "#000000"
		},
		{
			"id": 5211,
			"name": {
				"en": "PyData: Data Handling & Engineering"
			},
			"description": {
				"en": "How to handle small to big data, ETL, distributed, specialized file formats, ..."
			},
			"color": "#000000"
		},
		{
			"id": 5212,
			"name": {
				"en": "PyData: Machine Learning & Deep Learning & Statistics"
			},
			"description": {
				"en": "Machine Learning, Deep Learning, statistics, interpretation of data, ..."
			},
			"color": "#000000"
		},
		{
			"id": 5213,
			"name": {
				"en": "PyData: Natural Language Processing & Audio (incl. Generative AI NLP)"
			},
			"description": {
				"en": "Anything Natural Language Processing (NLP) related, incl. libraries"
			},
			"color": "#000000"
		},
		{
			"id": 5289,
			"name": {
				"en": "PyData: Computer Vision (incl. Generative AI CV)"
			},
			"description": {
				"en": "Computer Vision (incl. Generative AI CV)"
			},
			"color": "#000000"
		},
		{
			"id": 5214,
			"name": {
				"en": "PyData: Generative AI"
			},
			"description": {
				"en": "Anything related to Generative AI which is not NLP & CV"
			},
			"color": "#000000"
		},
		{
			"id": 5290,
			"name": {
				"en": "PyData: Embedded Systems & Robotics"
			},
			"description": {
				"en": "Embedded Systems & Robotics"
			},
			"color": "#000000"
		},
		{
			"id": 5215,
			"name": {
				"en": "PyData: PyData & Scientific Libraries Stack"
			},
			"description": {
				"en": "Talks about the PyData stack, e.g. pandas, scikit-*,... any talk mainly about a data/AI or scientific library."
			},
			"color": "#000000"
		},
		{
			"id": 5216,
			"name": {
				"en": "PyData: Visualisation & Jupyter"
			},
			"description": {
				"en": "Anything around the visualization of data and tools from the Jupyter ecosystem"
			},
			"color": "#000000"
		},
		{
			"id": 5291,
			"name": {
				"en": "PyData: Research Software Engineering"
			},
			"description": {
				"en": "Research Software Engineering"
			},
			"color": "#000000"
		},
		{
			"id": 5217,
			"name": {
				"en": "General: Community & Diversity"
			},
			"description": {
				"en": "Community, diversity, inclusion, work, freelancing, philosophy, .…"
			},
			"color": "#000000"
		},
		{
			"id": 5292,
			"name": {
				"en": "General: Education, Career & Life"
			},
			"description": {
				"en": "Education, Career & Life"
			},
			"color": "#000000"
		},
		{
			"id": 5218,
			"name": {
				"en": "General: Ethics & Privacy"
			},
			"description": {
				"en": "Ethics & Privacy in AI, software development and engineering."
			},
			"color": "#000000"
		},
		{
			"id": 5219,
			"name": {
				"en": "General: Infrastructure - Hardware & Cloud"
			},
			"description": {
				"en": "Everything general about infrastructure in the cloud or on-premises or topics about hardware / embedded devices."
			},
			"color": "#000000"
		},
		{
			"id": 5221,
			"name": {
				"en": "General: Others"
			},
			"description": {
				"en": "Anything related to the conference that does not fall in any of the other topics."
			},
			"color": "#000000"
		},
		{
			"id": 5223,
			"name": {
				"en": "Keynote"
			},
			"description": {
				"en": "Reserved for plenary (invited talks)."
			},
			"color": "#000000"
		}
	],
	"rooms": [
		{
			"id": 3893,
			"name": {
				"en": "Zeiss Plenary (Spectrum)"
			},
			"description": {
				"en": "Ground floor"
			}
		},
		{
			"id": 3894,
			"name": {
				"en": "Titanium3"
			},
			"description": {
				"en": "2.0234, 2nd floor"
			}
		},
		{
			"id": 3895,
			"name": {
				"en": "Helium3"
			},
			"description": {
				"en": "3.0789, 3rd floor"
			}
		},
		{
			"id": 3896,
			"name": {
				"en": "Platinum3"
			},
			"description": {
				"en": "2.0678, 2nd floor"
			}
		},
		{
			"id": 3897,
			"name": {
				"en": "Europium2"
			},
			"description": {
				"en": "3.034, 3rd floor"
			}
		},
		{
			"id": 3898,
			"name": {
				"en": "Hassium"
			},
			"description": {
				"en": "3.02, 3rd floor"
			}
		},
		{
			"id": 3899,
			"name": {
				"en": "Palladium"
			},
			"description": {
				"en": "2.05, 2n floor"
			}
		},
		{
			"id": 3900,
			"name": {
				"en": "Ferrum"
			},
			"description": {
				"en": "Ground floor"
			}
		},
		{
			"id": 3901,
			"name": {
				"en": "Dynamicum"
			},
			"description": {
				"en": "0.04, ground floor"
			}
		},
		{
			"id": 3973,
			"name": {
				"en": "Carbonium"
			},
			"description": {
				"en": "2.01, 2nd floor"
			}
		},
		{
			"id": 4084,
			"name": {
				"en": "OpenSpace"
			},
			"description": {
				"en": "3.12, 3rd floor, foyer"
			}
		}
	],
	"speakers": [
		{
			"code": "E3MAF3",
			"name": "Teresa Kroesen",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "RL9F37",
			"name": "Christian Geier",
			"avatar": "https://pretalx.com/media/avatars/RL9F37_5LpN450.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/RL9F37_5LpN450_thumbnail_default_yv3RVfj.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/RL9F37_5LpN450_thumbnail_tiny.jpg"
		},
		{
			"code": "B37CUN",
			"name": "Kristian Kersting",
			"avatar": "https://pretalx.com/media/avatars/B37CUN_YYuqKpp.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/B37CUN_YYuqKpp_thumbnail_default_6dQXpYC.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/B37CUN_YYuqKpp_thumbnail_tiny_bzpxZ4u.jpg"
		},
		{
			"code": "9KSJ3K",
			"name": "Mike Müller",
			"avatar": "https://pretalx.com/media/avatars/9KSJ3K_7arDp8I.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/9KSJ3K_7arDp8I_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/9KSJ3K_7arDp8I_thumbnail_tiny.jpg"
		},
		{
			"code": "CAH7QT",
			"name": "Robert Haase",
			"avatar": "https://pretalx.com/media/avatars/CAH7QT_Qpcha4S.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/CAH7QT_Qpcha4S_thumbnail_default.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/CAH7QT_Qpcha4S_thumbnail_tiny.jpeg"
		},
		{
			"code": "YHXMHL",
			"name": "Alessandro Angioi",
			"avatar": "https://pretalx.com/media/avatars/YHXMHL_4sWs7z0.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/YHXMHL_4sWs7z0_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/YHXMHL_4sWs7z0_thumbnail_tiny.jpg"
		},
		{
			"code": "DAPDTE",
			"name": "Dr Maren Westermann",
			"avatar": "https://pretalx.com/media/avatars/DAPDTE_on44jIn.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/DAPDTE_on44jIn_thumbnail_default_7xoaBlV.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/DAPDTE_on44jIn_thumbnail_tiny.jpg"
		},
		{
			"code": "GGSPQV",
			"name": "Bernhard Schäfer",
			"avatar": "https://pretalx.com/media/avatars/GGSPQV_sqrfCNB.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/GGSPQV_sqrfCNB_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/GGSPQV_sqrfCNB_thumbnail_tiny.jpg"
		},
		{
			"code": "J7LMZG",
			"name": "Kristina Khvatova",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "VNRJDV",
			"name": "Henrik Sebastian Steude",
			"avatar": "https://pretalx.com/media/avatars/VNRJDV_KOoZnuV.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/VNRJDV_KOoZnuV_thumbnail_default_c2LXOTN.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/VNRJDV_KOoZnuV_thumbnail_tiny.jpg"
		},
		{
			"code": "LLJSBE",
			"name": "Pavithra Eswaramoorthy",
			"avatar": "https://pretalx.com/media/avatars/LLJSBE_ORGbB9T.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/LLJSBE_ORGbB9T_thumbnail.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/LLJSBE_ORGbB9T_thumbnail_tiny.jpg"
		},
		{
			"code": "V3UMNK",
			"name": "Daniel Stolpmann",
			"avatar": "https://pretalx.com/media/avatars/V3UMNK_RdbfXrc.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/V3UMNK_RdbfXrc_thumbnail_default_V1nS77H.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/V3UMNK_RdbfXrc_thumbnail_tiny.jpg"
		},
		{
			"code": "R3BXQU",
			"name": "Jochen Luithardt",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "XH7YNC",
			"name": "Sohan Maheshwar",
			"avatar": "https://pretalx.com/media/avatars/XH7YNC_5DPc3lg.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/XH7YNC_5DPc3lg_thumbnail_default.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/XH7YNC_5DPc3lg_thumbnail_tiny.jpeg"
		},
		{
			"code": "FRRAE7",
			"name": "Vincenzo Ventriglia",
			"avatar": "https://pretalx.com/media/avatars/FRRAE7_coP1z5u.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/FRRAE7_coP1z5u_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/FRRAE7_coP1z5u_thumbnail_tiny.jpg"
		},
		{
			"code": "N7S8VF",
			"name": "Victor Flores Terrazas",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "KMY3JY",
			"name": "Paul Müller",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "HHWHWK",
			"name": "Moreno Schlageter",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "UFVRPX",
			"name": "Yovli Duvshani",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "GB89CS",
			"name": "Benedikt Heidrich",
			"avatar": "https://pretalx.com/media/avatars/GB89CS_V0kWU9j.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/GB89CS_V0kWU9j_thumbnail.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/GB89CS_V0kWU9j_thumbnail_tiny.jpeg"
		},
		{
			"code": "9B8PQS",
			"name": "Caio Benatti Moretti",
			"avatar": "https://pretalx.com/media/avatars/9B8PQS_N2vIbm0.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/9B8PQS_N2vIbm0_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/9B8PQS_N2vIbm0_thumbnail_tiny.jpg"
		},
		{
			"code": "BDNEEF",
			"name": "Christer Friberg",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "8EGVC9",
			"name": "Cheuk Ting Ho",
			"avatar": "https://pretalx.com/media/avatars/8EGVC9_vBWTGiF.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/8EGVC9_vBWTGiF_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/8EGVC9_vBWTGiF_thumbnail_tiny.jpg"
		},
		{
			"code": "8BDEZN",
			"name": "Tuhin Sharma",
			"avatar": "https://pretalx.com/media/avatars/8BDEZN_hfr9PYu.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/8BDEZN_hfr9PYu_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/8BDEZN_hfr9PYu_thumbnail_tiny.jpg"
		},
		{
			"code": "9Q7SVE",
			"name": "Andrei Beliankou",
			"avatar": "https://pretalx.com/media/avatars/9Q7SVE_9r7E9jx.png",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/9Q7SVE_9r7E9jx_thumbnail_default_XDjcCOU.png",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/9Q7SVE_9r7E9jx_thumbnail_tiny.png"
		},
		{
			"code": "K7FQ7S",
			"name": "Jose Moreno Ortega",
			"avatar": "https://pretalx.com/media/avatars/K7FQ7S_4v2ef8u.png",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/K7FQ7S_4v2ef8u_thumbnail_default_lpRgSpG.png",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/K7FQ7S_4v2ef8u_thumbnail_tiny.png"
		},
		{
			"code": "NZNFP8",
			"name": "René Fa",
			"avatar": "https://pretalx.com/media/avatars/NZNFP8_T1r5soK.JPG",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/NZNFP8_T1r5soK_thumbnail_default.JPG",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/NZNFP8_T1r5soK_thumbnail_tiny.JPG"
		},
		{
			"code": "8ZRD8E",
			"name": "Dr. Marisa Mohr",
			"avatar": "https://pretalx.com/media/avatars/8ZRD8E_x0Xwg2f.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/8ZRD8E_x0Xwg2f_thumbnail_default_5vufS0C.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/8ZRD8E_x0Xwg2f_thumbnail_tiny_tRarmMo.jpg"
		},
		{
			"code": "MFBP3R",
			"name": "Hannah Hepke",
			"avatar": "https://pretalx.com/media/avatars/MFBP3R_CXBKsxJ.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/MFBP3R_CXBKsxJ_thumbnail_default_CrDHQfe.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/MFBP3R_CXBKsxJ_thumbnail_tiny_SVJJPtV.jpeg"
		},
		{
			"code": "7LKG3C",
			"name": "Rostislaw Krassow",
			"avatar": "https://pretalx.com/media/avatars/7LKG3C_FNhEV6V.JPG",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/7LKG3C_FNhEV6V_thumbnail_default_ykZlmPK.JPG",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/7LKG3C_FNhEV6V_thumbnail_tiny.JPG"
		},
		{
			"code": "ZG33XS",
			"name": "Barak Amar",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "XXBKRT",
			"name": "Magdalena Kowalczuk",
			"avatar": "https://pretalx.com/media/avatars/XXBKRT_XBCGlLu.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/XXBKRT_XBCGlLu_thumbnail_default.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/XXBKRT_XBCGlLu_thumbnail_tiny.jpeg"
		},
		{
			"code": "833C9P",
			"name": "Anna-Lisa Wirth",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "ZYGLV3",
			"name": "Max Höhl",
			"avatar": "https://pretalx.com/media/avatars/ZYGLV3_ApfJYZi.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/ZYGLV3_ApfJYZi_thumbnail_default_vojpxvc.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/ZYGLV3_ApfJYZi_thumbnail_tiny.jpg"
		},
		{
			"code": "EZMJWT",
			"name": "Theodore Meynard",
			"avatar": "https://pretalx.com/media/avatars/EZMJWT_XWSm1xx.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/EZMJWT_XWSm1xx_thumbnail.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/EZMJWT_XWSm1xx_thumbnail_tiny.jpg"
		},
		{
			"code": "QWNPUD",
			"name": "Christiaan Swart",
			"avatar": "https://pretalx.com/media/avatars/QWNPUD_kG5KD2H.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/QWNPUD_kG5KD2H_thumbnail_default.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/QWNPUD_kG5KD2H_thumbnail_tiny.jpeg"
		},
		{
			"code": "RLAACQ",
			"name": "Fabian Hadiji",
			"avatar": "https://pretalx.com/media/avatars/RLAACQ_2HwxJlQ.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/RLAACQ_2HwxJlQ_thumbnail_default_V1E2tdm.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/RLAACQ_2HwxJlQ_thumbnail_tiny.jpg"
		},
		{
			"code": "SVAMFE",
			"name": "Mihail Douhaniaris",
			"avatar": "https://pretalx.com/media/avatars/SVAMFE_cv3x4TF.png",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/SVAMFE_cv3x4TF_thumbnail_default_deOrIEA.png",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/SVAMFE_cv3x4TF_thumbnail_tiny.png"
		},
		{
			"code": "HRNBJX",
			"name": "Thomas Berger",
			"avatar": "https://pretalx.com/media/avatars/HRNBJX_ZtkyGZH.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/HRNBJX_ZtkyGZH_thumbnail_default.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/HRNBJX_ZtkyGZH_thumbnail_tiny.jpeg"
		},
		{
			"code": "7VUXWM",
			"name": "Joris Van den Bossche",
			"avatar": "https://pretalx.com/media/avatars/7VUXWM_5SP7h9s.png",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/7VUXWM_5SP7h9s_thumbnail.png",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/7VUXWM_5SP7h9s_thumbnail_tiny.png"
		},
		{
			"code": "RUSBZM",
			"name": "Javier de la Rúa Martínez",
			"avatar": "https://pretalx.com/media/avatars/RUSBZM_KMNK45p.png",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/RUSBZM_KMNK45p_thumbnail_default.png",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/RUSBZM_KMNK45p_thumbnail_tiny.png"
		},
		{
			"code": "NQU3YJ",
			"name": "Josef Nagelschmidt",
			"avatar": "https://pretalx.com/media/avatars/NQU3YJ_jpctoru.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/NQU3YJ_jpctoru_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/NQU3YJ_jpctoru_thumbnail_tiny.jpg"
		},
		{
			"code": "NYEURC",
			"name": "Bo Dong",
			"avatar": "https://pretalx.com/media/avatars/NYEURC_enDk60O.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/NYEURC_enDk60O_thumbnail_default_3pLWiXB.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/NYEURC_enDk60O_thumbnail_tiny.jpg"
		},
		{
			"code": "ZTVM8H",
			"name": "Ondrej Draganov",
			"avatar": "https://pretalx.com/media/avatars/ZTVM8H_Vj3Mbrf.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/ZTVM8H_Vj3Mbrf_thumbnail_default.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/ZTVM8H_Vj3Mbrf_thumbnail_tiny.jpeg"
		},
		{
			"code": "9AMQEB",
			"name": "Martin Fitzner",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "37RKBL",
			"name": "Darya Petrashka",
			"avatar": "https://pretalx.com/media/avatars/37RKBL_ZRMXTOD.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/37RKBL_ZRMXTOD_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/37RKBL_ZRMXTOD_thumbnail_tiny.jpg"
		},
		{
			"code": "YHPLBC",
			"name": "Chong Shen Ng",
			"avatar": "https://pretalx.com/media/avatars/YHPLBC_oCxnXnQ.png",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/YHPLBC_oCxnXnQ_thumbnail_default.png",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/YHPLBC_oCxnXnQ_thumbnail_tiny.png"
		},
		{
			"code": "9CGGBC",
			"name": "Emanuele Fabbiani",
			"avatar": "https://pretalx.com/media/avatars/9CGGBC_JGHNmeM.png",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/9CGGBC_JGHNmeM_thumbnail.png",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/9CGGBC_JGHNmeM_thumbnail_tiny.png"
		},
		{
			"code": "E7DVCA",
			"name": "Romain Dorgueil",
			"avatar": "https://pretalx.com/media/avatars/E7DVCA_nk9z4sI.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/E7DVCA_nk9z4sI_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/E7DVCA_nk9z4sI_thumbnail_tiny.jpg"
		},
		{
			"code": "LAMEH3",
			"name": "Ivelina Momcheva",
			"avatar": "https://pretalx.com/media/avatars/LAMEH3_0bZqlVj.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/LAMEH3_0bZqlVj_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/LAMEH3_0bZqlVj_thumbnail_tiny.jpg"
		},
		{
			"code": "GPD9BB",
			"name": "Dr. Lisa Andreevna Chalaguine",
			"avatar": "https://pretalx.com/media/avatars/GPD9BB_r7ErLTO.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/GPD9BB_r7ErLTO_thumbnail_default.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/GPD9BB_r7ErLTO_thumbnail_tiny.jpeg"
		},
		{
			"code": "H3RSTE",
			"name": "Kacper Łukawski",
			"avatar": "https://pretalx.com/media/avatars/H3RSTE_qsyggPK.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/H3RSTE_qsyggPK_thumbnail.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/H3RSTE_qsyggPK_thumbnail_tiny.jpg"
		},
		{
			"code": "WB3ZFH",
			"name": "Mara Mattes",
			"avatar": "https://pretalx.com/media/avatars/WB3ZFH_QtVAF2w.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/WB3ZFH_QtVAF2w_thumbnail_default_H9LytUe.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/WB3ZFH_QtVAF2w_thumbnail_tiny.jpeg"
		},
		{
			"code": "8LQU9C",
			"name": "Florian Wilhelm",
			"avatar": "https://pretalx.com/media/avatars/8LQU9C_vv210Xj.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/8LQU9C_vv210Xj_thumbnail.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/8LQU9C_vv210Xj_thumbnail_tiny.jpg"
		},
		{
			"code": "BVTTB3",
			"name": "Daniel Elsner",
			"avatar": "https://pretalx.com/media/avatars/BVTTB3_dzXXJpr.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/BVTTB3_dzXXJpr_thumbnail_default_ulUzJwO.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/BVTTB3_dzXXJpr_thumbnail_tiny.jpg"
		},
		{
			"code": "Y3BGJB",
			"name": "Oliver Borchert",
			"avatar": "https://pretalx.com/media/avatars/Y3BGJB_44RR8hN.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/Y3BGJB_44RR8hN_thumbnail_default_T6lRwvZ.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/Y3BGJB_44RR8hN_thumbnail_tiny.jpg"
		},
		{
			"code": "3MKT9M",
			"name": "Mia Chang",
			"avatar": "https://pretalx.com/media/avatars/3MKT9M_dhPVHGQ.png",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/3MKT9M_dhPVHGQ_thumbnail_default.png",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/3MKT9M_dhPVHGQ_thumbnail_tiny.png"
		},
		{
			"code": "YUHH8E",
			"name": "Peter Lodri",
			"avatar": "https://pretalx.com/media/avatars/YUHH8E_zozAQni.JPG",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/YUHH8E_zozAQni_thumbnail_default.JPG",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/YUHH8E_zozAQni_thumbnail_tiny.JPG"
		},
		{
			"code": "CZVWXB",
			"name": "Daniel Hieber",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "8NMQMV",
			"name": "Eugen Geist",
			"avatar": "https://pretalx.com/media/avatars/8NMQMV_POIcGrV.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/8NMQMV_POIcGrV_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/8NMQMV_POIcGrV_thumbnail_tiny.jpg"
		},
		{
			"code": "QJDXKB",
			"name": "Silke Horn",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "WVNMPG",
			"name": "Paula Gonzalez Avalos",
			"avatar": "https://pretalx.com/media/avatars/WVNMPG_opng10Z.png",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/WVNMPG_opng10Z_thumbnail.png",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/WVNMPG_opng10Z_thumbnail_tiny.png"
		},
		{
			"code": "HVSNHD",
			"name": "Larissa Haas",
			"avatar": "https://pretalx.com/media/avatars/HVSNHD_qOTHnaa.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/HVSNHD_qOTHnaa_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/HVSNHD_qOTHnaa_thumbnail_tiny.jpg"
		},
		{
			"code": "9EPNQG",
			"name": "Dr. Kristian Rother",
			"avatar": "https://pretalx.com/media/avatars/9EPNQG_TTM8mnl.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/9EPNQG_TTM8mnl_thumbnail.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/9EPNQG_TTM8mnl_thumbnail_tiny.jpg"
		},
		{
			"code": "J9DJ83",
			"name": "Hendrik Niemeyer",
			"avatar": "https://pretalx.com/media/avatars/J9DJ83_I5rJQpf.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/J9DJ83_I5rJQpf_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/J9DJ83_I5rJQpf_thumbnail_tiny_8EntNEI.jpg"
		},
		{
			"code": "L8YCSG",
			"name": "Akshay Ballal",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "SYPCGN",
			"name": "Einat Orr",
			"avatar": "https://pretalx.com/media/avatars/SYPCGN_wS6Z8hb.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/SYPCGN_wS6Z8hb_thumbnail_default.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/SYPCGN_wS6Z8hb_thumbnail_tiny.jpeg"
		},
		{
			"code": "NUFKS8",
			"name": "Dr. Evelyne Groen",
			"avatar": "https://pretalx.com/media/avatars/NUFKS8_y9ltPUp.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/NUFKS8_y9ltPUp_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/NUFKS8_y9ltPUp_thumbnail_tiny.jpg"
		},
		{
			"code": "937CJZ",
			"name": "Daryna Dementieva",
			"avatar": "https://pretalx.com/media/avatars/937CJZ_R4XBJui.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/937CJZ_R4XBJui_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/937CJZ_R4XBJui_thumbnail_tiny.jpg"
		},
		{
			"code": "ZLLGER",
			"name": "Alexander Hopp",
			"avatar": "https://pretalx.com/media/avatars/ZLLGER_mAa8fYb.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/ZLLGER_mAa8fYb_thumbnail_default_IJRN9ni.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/ZLLGER_mAa8fYb_thumbnail_tiny.jpg"
		},
		{
			"code": "LSUVUD",
			"name": "Adrian Šošić",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "BQKRWQ",
			"name": "Danica Fine",
			"avatar": "https://pretalx.com/media/avatars/BQKRWQ_MHUF7uf.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/BQKRWQ_MHUF7uf_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/BQKRWQ_MHUF7uf_thumbnail_tiny.jpg"
		},
		{
			"code": "BPA78X",
			"name": "Florian Bruhin",
			"avatar": "https://pretalx.com/media/avatars/BPA78X_7lU3SPR.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/BPA78X_7lU3SPR_thumbnail.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/BPA78X_7lU3SPR_thumbnail_tiny.jpg"
		},
		{
			"code": "7YTCGE",
			"name": "Ruben Arts",
			"avatar": "https://pretalx.com/media/avatars/7YTCGE_F24UFc1.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/7YTCGE_F24UFc1_thumbnail.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/7YTCGE_F24UFc1_thumbnail_tiny.jpg"
		},
		{
			"code": "AYDHS9",
			"name": "Rotem Tamir",
			"avatar": "https://pretalx.com/media/avatars/AYDHS9_H3NxWEc.png",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/AYDHS9_H3NxWEc_thumbnail_default.png",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/AYDHS9_H3NxWEc_thumbnail_tiny.png"
		},
		{
			"code": "YPZZ3S",
			"name": "Rahkakavee Baskaran",
			"avatar": "https://pretalx.com/media/avatars/YPZZ3S_2ARmOJL.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/YPZZ3S_2ARmOJL_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/YPZZ3S_2ARmOJL_thumbnail_tiny.jpg"
		},
		{
			"code": "WV3US9",
			"name": "Daniel Hepper",
			"avatar": "https://pretalx.com/media/avatars/WV3US9_uWb9vIx.JPG",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/WV3US9_uWb9vIx_thumbnail.JPG",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/WV3US9_uWb9vIx_thumbnail_tiny.JPG"
		},
		{
			"code": "3CXHP7",
			"name": "Franz Wöllert",
			"avatar": "https://pretalx.com/media/avatars/3CXHP7_nqaEbER.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/3CXHP7_nqaEbER_thumbnail.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/3CXHP7_nqaEbER_thumbnail_tiny.jpg"
		},
		{
			"code": "7GY7XH",
			"name": "Cosima Meyer",
			"avatar": "https://pretalx.com/media/avatars/7GY7XH_Js5SOKe.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/7GY7XH_Js5SOKe_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/7GY7XH_Js5SOKe_thumbnail_tiny.jpg"
		},
		{
			"code": "HCWQZW",
			"name": "Jesper Dramsch",
			"avatar": "https://pretalx.com/media/avatars/HCWQZW_H2mkmrg.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/HCWQZW_H2mkmrg_thumbnail.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/HCWQZW_H2mkmrg_thumbnail_tiny.jpg"
		},
		{
			"code": "PSWRAP",
			"name": "Raana Saheb-Nassagh",
			"avatar": "https://pretalx.com/media/avatars/PSWRAP_qn1d2rf.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/PSWRAP_qn1d2rf_thumbnail_default_e7lmGXl.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/PSWRAP_qn1d2rf_thumbnail_tiny.jpeg"
		},
		{
			"code": "HECXGZ",
			"name": "Bogdan Girman",
			"avatar": "https://pretalx.com/media/avatars/HECXGZ_ZxTZ22y.png",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/HECXGZ_ZxTZ22y_thumbnail_default.png",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/HECXGZ_ZxTZ22y_thumbnail_tiny.png"
		},
		{
			"code": "L7SDGZ",
			"name": "Anja Pilz",
			"avatar": "https://pretalx.com/media/avatars/L7SDGZ_RCss5jt.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/L7SDGZ_RCss5jt_thumbnail_default.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/L7SDGZ_RCss5jt_thumbnail_tiny.jpeg"
		},
		{
			"code": "BZY9AN",
			"name": "Irena Grgic",
			"avatar": "https://pretalx.com/media/avatars/BZY9AN_CLaF2al.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/BZY9AN_CLaF2al_thumbnail_default.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/BZY9AN_CLaF2al_thumbnail_tiny.jpeg"
		},
		{
			"code": "9NYEDM",
			"name": "Alessandro Romano",
			"avatar": "https://pretalx.com/media/avatars/9NYEDM_hXkevkp.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/9NYEDM_hXkevkp_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/9NYEDM_hXkevkp_thumbnail_tiny.jpg"
		},
		{
			"code": "UD3JDR",
			"name": "Jamie Coombes",
			"avatar": "https://pretalx.com/media/avatars/UD3JDR_pQElCy4.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/UD3JDR_pQElCy4_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/UD3JDR_pQElCy4_thumbnail_tiny.jpg"
		},
		{
			"code": "KZSJAZ",
			"name": "Semona Igama",
			"avatar": "https://pretalx.com/media/avatars/KZSJAZ_ZhEbzCH.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/KZSJAZ_ZhEbzCH_thumbnail_default_d7AySwf.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/KZSJAZ_ZhEbzCH_thumbnail_tiny.jpg"
		},
		{
			"code": "BJ3JTQ",
			"name": "Anastasia Karavdina",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "9HDESG",
			"name": "Smera Goel",
			"avatar": "https://pretalx.com/media/avatars/9HDESG_gCyt2FY.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/9HDESG_gCyt2FY_thumbnail_default_WDrCclL.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/9HDESG_gCyt2FY_thumbnail_tiny.jpg"
		},
		{
			"code": "DCTDRA",
			"name": "Sebastian Folz",
			"avatar": "https://pretalx.com/media/avatars/DCTDRA_K4QdCQP.JPG",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/DCTDRA_K4QdCQP_thumbnail_default_MeqD56R.JPG",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/DCTDRA_K4QdCQP_thumbnail_tiny.JPG"
		},
		{
			"code": "HWZVSQ",
			"name": "Nico Kreiling",
			"avatar": "https://pretalx.com/media/avatars/HWZVSQ_AYYtX1X.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/HWZVSQ_AYYtX1X_thumbnail.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/HWZVSQ_AYYtX1X_thumbnail_tiny.jpg"
		},
		{
			"code": "9FLCR9",
			"name": "Martin Seeler",
			"avatar": "https://pretalx.com/media/avatars/9FLCR9_8EWueN1.png",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/9FLCR9_8EWueN1_thumbnail_default.png",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/9FLCR9_8EWueN1_thumbnail_tiny.png"
		},
		{
			"code": "DUSVE9",
			"name": "Jens Nie",
			"avatar": "https://pretalx.com/media/avatars/DUSVE9_x6pgG1p.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/DUSVE9_x6pgG1p_thumbnail.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/DUSVE9_x6pgG1p_thumbnail_tiny.jpg"
		},
		{
			"code": "ST3QCB",
			"name": "Katie Richardson",
			"avatar": "https://pretalx.com/media/avatars/ST3QCB_Duk0V2b.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/ST3QCB_Duk0V2b_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/ST3QCB_Duk0V2b_thumbnail_tiny.jpg"
		},
		{
			"code": "93VSJ9",
			"name": "Kateryna Budzyak",
			"avatar": "https://pretalx.com/media/avatars/93VSJ9_AMl8Nas.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/93VSJ9_AMl8Nas_thumbnail.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/93VSJ9_AMl8Nas_thumbnail_tiny.jpeg"
		},
		{
			"code": "WLLGPM",
			"name": "Tilman Krokotsch",
			"avatar": "https://pretalx.com/media/avatars/WLLGPM_MUTJ0a9.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/WLLGPM_MUTJ0a9_thumbnail_default_5mi9MW2.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/WLLGPM_MUTJ0a9_thumbnail_tiny.jpeg"
		},
		{
			"code": "ED3NBU",
			"name": "Thomas Mayer",
			"avatar": "https://pretalx.com/media/avatars/ED3NBU_8FsU28V.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/ED3NBU_8FsU28V_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/ED3NBU_8FsU28V_thumbnail_tiny.jpg"
		},
		{
			"code": "CFQECP",
			"name": "Carsten Frommhold",
			"avatar": "https://pretalx.com/media/avatars/CFQECP_nkjg8Fh.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/CFQECP_nkjg8Fh_thumbnail.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/CFQECP_nkjg8Fh_thumbnail_tiny.jpg"
		},
		{
			"code": "G9FDBT",
			"name": "Tim Head",
			"avatar": "https://pretalx.com/media/avatars/G9FDBT_0krrzKt.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/G9FDBT_0krrzKt_thumbnail.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/G9FDBT_0krrzKt_thumbnail_tiny.jpg"
		},
		{
			"code": "LT7LHM",
			"name": "Dr. Maria Börner",
			"avatar": "https://pretalx.com/media/avatars/LT7LHM_GglaO1L.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/LT7LHM_GglaO1L_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/LT7LHM_GglaO1L_thumbnail_tiny.jpg"
		},
		{
			"code": "FTZPWC",
			"name": "Sonam Pankaj",
			"avatar": "https://pretalx.com/media/avatars/FTZPWC_Hy2fN3X.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/FTZPWC_Hy2fN3X_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/FTZPWC_Hy2fN3X_thumbnail_tiny.jpg"
		},
		{
			"code": "A7ACFE",
			"name": "Sanket Verma",
			"avatar": "https://pretalx.com/media/avatars/A7ACFE_CWefmUa.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/A7ACFE_CWefmUa_thumbnail.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/A7ACFE_CWefmUa_thumbnail_tiny.jpg"
		},
		{
			"code": "8F38DV",
			"name": "Alexander CS Hendorf",
			"avatar": "https://pretalx.com/media/avatars/8F38DV_QTtqqiS.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/8F38DV_QTtqqiS_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/8F38DV_QTtqqiS_thumbnail_tiny.jpg"
		},
		{
			"code": "LJLEJV",
			"name": "Dominik Falkner",
			"avatar": "https://pretalx.com/media/avatars/LJLEJV_FI3vXdO.png",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/LJLEJV_FI3vXdO_thumbnail_default.png",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/LJLEJV_FI3vXdO_thumbnail_tiny.png"
		},
		{
			"code": "KSM737",
			"name": "Jannis Lübbe",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "K9B9W9",
			"name": "Katharine Jarmul",
			"avatar": "https://pretalx.com/media/avatars/K9B9W9_gUIiN9l.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/K9B9W9_gUIiN9l_thumbnail.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/K9B9W9_gUIiN9l_thumbnail_tiny.jpg"
		},
		{
			"code": "VFC8XU",
			"name": "Tim Lenzen",
			"avatar": "https://pretalx.com/media/avatars/VFC8XU_kd3aCQ8.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/VFC8XU_kd3aCQ8_thumbnail_default.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/VFC8XU_kd3aCQ8_thumbnail_tiny.jpeg"
		},
		{
			"code": "BH89AW",
			"name": "Guadalupe Canas Herrera",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "TP9PQN",
			"name": "Martin Stancsics",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "AU3UXW",
			"name": "Dr. Homa Ansari",
			"avatar": "https://pretalx.com/media/avatars/AU3UXW_OcIs0b7.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/AU3UXW_OcIs0b7_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/AU3UXW_OcIs0b7_thumbnail_tiny.jpg"
		},
		{
			"code": "LMCW3N",
			"name": "Natalie Beyer",
			"avatar": "https://pretalx.com/media/avatars/LMCW3N_EBxGvLE.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/LMCW3N_EBxGvLE_thumbnail_default_q6SZ9To.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/LMCW3N_EBxGvLE_thumbnail_tiny.jpg"
		},
		{
			"code": "LZQCXY",
			"name": "Vince Nelidov",
			"avatar": "https://pretalx.com/media/avatars/LZQCXY_N07lcjz.png",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/LZQCXY_N07lcjz_thumbnail_default.png",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/LZQCXY_N07lcjz_thumbnail_tiny.png"
		},
		{
			"code": "79EEXA",
			"name": "Frank Hutter",
			"avatar": "https://pretalx.com/media/avatars/79EEXA_1PzAEHn.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/79EEXA_1PzAEHn_thumbnail_default_z3fsWvO.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/79EEXA_1PzAEHn_thumbnail_tiny.jpg"
		},
		{
			"code": "8ZWEGR",
			"name": "Wolf Vollprecht",
			"avatar": "https://pretalx.com/media/avatars/8ZWEGR_3X2GOK0.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/8ZWEGR_3X2GOK0_thumbnail_default_Wzv4uMi.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/8ZWEGR_3X2GOK0_thumbnail_tiny.jpeg"
		},
		{
			"code": "GUNHRW",
			"name": "Ian Ormesher",
			"avatar": "https://pretalx.com/media/avatars/GUNHRW_To0TrvK.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/GUNHRW_To0TrvK_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/GUNHRW_To0TrvK_thumbnail_tiny.jpg"
		},
		{
			"code": "QHTKP7",
			"name": "Raphael Hviding",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "M3HBER",
			"name": "Tim Bossenmaier",
			"avatar": "https://pretalx.com/media/avatars/M3HBER_wZ0zzq9.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/M3HBER_wZ0zzq9_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/M3HBER_wZ0zzq9_thumbnail_tiny.jpg"
		},
		{
			"code": "SGPHNQ",
			"name": "Frank Rust",
			"avatar": "https://pretalx.com/media/avatars/SGPHNQ_lYMnbDJ.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/SGPHNQ_lYMnbDJ_thumbnail_default_UweXooM.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/SGPHNQ_lYMnbDJ_thumbnail_tiny.jpg"
		},
		{
			"code": "KEUJ9U",
			"name": "Marco Gorelli",
			"avatar": "https://pretalx.com/media/avatars/KEUJ9U_SQaluhL.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/KEUJ9U_SQaluhL_thumbnail.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/KEUJ9U_SQaluhL_thumbnail_tiny.jpg"
		},
		{
			"code": "BGPPXA",
			"name": "Marcelo Trylesinski",
			"avatar": "https://pretalx.com/media/avatars/BGPPXA_OrIJlid.JPEG",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/BGPPXA_OrIJlid_thumbnail_default.JPEG",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/BGPPXA_OrIJlid_thumbnail_tiny.JPEG"
		},
		{
			"code": "JJ8BUD",
			"name": "Mika Naylor",
			"avatar": "https://pretalx.com/media/avatars/JJ8BUD_6aWJpf4.png",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/JJ8BUD_6aWJpf4_thumbnail_default.png",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/JJ8BUD_6aWJpf4_thumbnail_tiny.png"
		},
		{
			"code": "E7TWUS",
			"name": "Michael Platzer",
			"avatar": "https://pretalx.com/media/avatars/E7TWUS_Nt86mBw.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/E7TWUS_Nt86mBw_thumbnail_default.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/E7TWUS_Nt86mBw_thumbnail_tiny.jpeg"
		},
		{
			"code": "UZ9VMC",
			"name": "Thomas Prexl",
			"avatar": "https://pretalx.com/media/avatars/UZ9VMC_PQp5R4u.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/UZ9VMC_PQp5R4u_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/UZ9VMC_PQp5R4u_thumbnail_tiny.jpg"
		},
		{
			"code": "AZ7FNH",
			"name": "Simonas Černiauskas",
			"avatar": "https://pretalx.com/media/avatars/AZ7FNH_bf7aRPo.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/AZ7FNH_bf7aRPo_thumbnail_default_zNHvk35.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/AZ7FNH_bf7aRPo_thumbnail_tiny.jpg"
		},
		{
			"code": "BZNSWG",
			"name": "Florian Teutsch",
			"avatar": "https://pretalx.com/media/avatars/BZNSWG_E8n9UpR.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/BZNSWG_E8n9UpR_thumbnail_default_tY2j9oa.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/BZNSWG_E8n9UpR_thumbnail_tiny.jpg"
		},
		{
			"code": "YTUJ88",
			"name": "Illia Babounikau",
			"avatar": "https://pretalx.com/media/avatars/YTUJ88_5mSDi6i.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/YTUJ88_5mSDi6i_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/YTUJ88_5mSDi6i_thumbnail_tiny.jpg"
		},
		{
			"code": "D7HNKK",
			"name": "David Maier",
			"avatar": "https://pretalx.com/media/avatars/D7HNKK_dLkAsSd.png",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/D7HNKK_dLkAsSd_thumbnail_default.png",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/D7HNKK_dLkAsSd_thumbnail_tiny.png"
		},
		{
			"code": "B7CMVH",
			"name": "Frank Hoffmann",
			"avatar": "https://pretalx.com/media/avatars/B7CMVH_2Mx6k0x.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/B7CMVH_2Mx6k0x_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/B7CMVH_2Mx6k0x_thumbnail_tiny.jpg"
		},
		{
			"code": "F7DPMR",
			"name": "Malte Klemm",
			"avatar": "https://pretalx.com/media/avatars/F7DPMR_5s216Wt.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/F7DPMR_5s216Wt_thumbnail_default.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/F7DPMR_5s216Wt_thumbnail_tiny_WsFRfLH.jpeg"
		},
		{
			"code": "EE9T8A",
			"name": "Ariane Djeupang",
			"avatar": "https://pretalx.com/media/avatars/EE9T8A_eDnr91a.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/EE9T8A_eDnr91a_thumbnail_default_ZQMpIki.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/EE9T8A_eDnr91a_thumbnail_tiny.jpg"
		},
		{
			"code": "WP7K8V",
			"name": "Alexander Uhlig",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "FZKG9N",
			"name": "Ines Montani",
			"avatar": "https://pretalx.com/media/avatars/FZKG9N_5iBQp5R.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/FZKG9N_5iBQp5R_thumbnail.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/FZKG9N_5iBQp5R_thumbnail_tiny.jpg"
		},
		{
			"code": "HQ9CRY",
			"name": "Doreen Sacker",
			"avatar": "https://pretalx.com/media/avatars/HQ9CRY_mO2JeIu.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/HQ9CRY_mO2JeIu_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/HQ9CRY_mO2JeIu_thumbnail_tiny.jpg"
		},
		{
			"code": "A7QPAE",
			"name": "Eric Thanenthiran",
			"avatar": "https://pretalx.com/media/avatars/A7QPAE_3TUy7e7.png",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/A7QPAE_3TUy7e7_thumbnail_default.png",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/A7QPAE_3TUy7e7_thumbnail_tiny.png"
		},
		{
			"code": "NMACLQ",
			"name": "Tereza Iofciu",
			"avatar": "https://pretalx.com/media/avatars/NMACLQ_M0SmHO9.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/NMACLQ_M0SmHO9_thumbnail_default.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/NMACLQ_M0SmHO9_thumbnail_tiny.jpeg"
		},
		{
			"code": "7BDJCR",
			"name": "Francesco Calcavecchia",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "TSXAJM",
			"name": "Paloma Oliveira",
			"avatar": "https://pretalx.com/media/avatars/TSXAJM_QLTKVNh.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/TSXAJM_QLTKVNh_thumbnail_default.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/TSXAJM_QLTKVNh_thumbnail_tiny.jpeg"
		},
		{
			"code": "GMGGWH",
			"name": "Christian Liedl",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "97XB7E",
			"name": "Rodel van Rooijen",
			"avatar": "https://pretalx.com/media/avatars/97XB7E_4d88FIl.png",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/97XB7E_4d88FIl_thumbnail_default_RPqU3TL.png",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/97XB7E_4d88FIl_thumbnail_tiny.png"
		},
		{
			"code": "YL8CRG",
			"name": "Dr. Yves J. Hilpisch",
			"avatar": "https://pretalx.com/media/avatars/YL8CRG_u0EcvAG.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/YL8CRG_u0EcvAG_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/YL8CRG_u0EcvAG_thumbnail_tiny.jpg"
		},
		{
			"code": "RFERPK",
			"name": "Elena Ouro Paz",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "GCAKSZ",
			"name": "Chris Aivazidis",
			"avatar": "https://pretalx.com/media/avatars/GCAKSZ_Tempisc.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/GCAKSZ_Tempisc_thumbnail_default.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/GCAKSZ_Tempisc_thumbnail_tiny.jpeg"
		},
		{
			"code": "NYBL9E",
			"name": "Laura Summers",
			"avatar": "https://pretalx.com/media/avatars/NYBL9E_5PTdV1E.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/NYBL9E_5PTdV1E_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/NYBL9E_5PTdV1E_thumbnail_tiny.jpg"
		},
		{
			"code": "UDHJSP",
			"name": "Stanislav Zmiev",
			"avatar": "https://pretalx.com/media/avatars/UDHJSP_JIPG5fp.JPG",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/UDHJSP_JIPG5fp_thumbnail_default.JPG",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/UDHJSP_JIPG5fp_thumbnail_tiny.JPG"
		},
		{
			"code": "Z8HXML",
			"name": "Yuliia Barabash",
			"avatar": "https://pretalx.com/media/avatars/Z8HXML_xn1gnuK.png",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/Z8HXML_xn1gnuK_thumbnail.png",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/Z8HXML_xn1gnuK_thumbnail_tiny.png"
		},
		{
			"code": "7H3JY8",
			"name": "Orell Garten",
			"avatar": "https://pretalx.com/media/avatars/7H3JY8_5lKuNhM.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/7H3JY8_5lKuNhM_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/7H3JY8_5lKuNhM_thumbnail_tiny.jpg"
		},
		{
			"code": "CSHKRY",
			"name": "Dennis Weyland",
			"avatar": "https://pretalx.com/media/avatars/CSHKRY_hDrOCF9.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/CSHKRY_hDrOCF9_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/CSHKRY_hDrOCF9_thumbnail_tiny.jpg"
		},
		{
			"code": "MUAVLE",
			"name": "Azamat Omuraliev",
			"avatar": "https://pretalx.com/media/avatars/MUAVLE_GBfWBIN.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/MUAVLE_GBfWBIN_thumbnail_default.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/MUAVLE_GBfWBIN_thumbnail_tiny.jpeg"
		},
		{
			"code": "RTUMVM",
			"name": "Dr. Irina Smirnova-Pinchukova",
			"avatar": "https://pretalx.com/media/avatars/RTUMVM_znDxfQb.png",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/RTUMVM_znDxfQb_thumbnail_default.png",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/RTUMVM_znDxfQb_thumbnail_tiny.png"
		},
		{
			"code": "DS3TQU",
			"name": "Clemens Hübner",
			"avatar": "https://pretalx.com/media/avatars/DS3TQU_q2Okxq8.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/DS3TQU_q2Okxq8_thumbnail.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/DS3TQU_q2Okxq8_thumbnail_tiny.jpg"
		},
		{
			"code": "8QDF3Q",
			"name": "Matthias Niehoff",
			"avatar": "https://pretalx.com/media/avatars/8QDF3Q_69zfLRB.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/8QDF3Q_69zfLRB_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/8QDF3Q_69zfLRB_thumbnail_tiny.jpg"
		},
		{
			"code": "KFGF9T",
			"name": "Alexander Fischer",
			"avatar": "https://pretalx.com/media/avatars/KFGF9T_0TgysAR.JPG",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/KFGF9T_0TgysAR_thumbnail_default.JPG",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/KFGF9T_0TgysAR_thumbnail_tiny.JPG"
		},
		{
			"code": "KZEU3C",
			"name": "Ben Brandt",
			"avatar": "https://pretalx.com/media/avatars/KZEU3C_yuSp9yK.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/KZEU3C_yuSp9yK_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/KZEU3C_yuSp9yK_thumbnail_tiny.jpg"
		},
		{
			"code": "ERZXBC",
			"name": "Anthony Harrison",
			"avatar": "https://pretalx.com/media/avatars/ERZXBC_CxPQkBx.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/ERZXBC_CxPQkBx_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/ERZXBC_CxPQkBx_thumbnail_tiny.jpg"
		},
		{
			"code": "LGPEHF",
			"name": "Moritz Althaus",
			"avatar": "https://pretalx.com/media/avatars/LGPEHF_zvD1YGO.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/LGPEHF_zvD1YGO_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/LGPEHF_zvD1YGO_thumbnail_tiny.jpg"
		},
		{
			"code": "SHADQ3",
			"name": "Brain Aboze",
			"avatar": "https://pretalx.com/media/avatars/SHADQ3_1rUzC4j.JPG",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/SHADQ3_1rUzC4j_thumbnail_default.JPG",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/SHADQ3_1rUzC4j_thumbnail_tiny.JPG"
		},
		{
			"code": "PDSUUK",
			"name": "Elizaveta Zinovyeva",
			"avatar": "https://pretalx.com/media/avatars/PDSUUK_XK8lPmS.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/PDSUUK_XK8lPmS_thumbnail_default_LjPPNaZ.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/PDSUUK_XK8lPmS_thumbnail_tiny.jpg"
		},
		{
			"code": "WBTYPT",
			"name": "Fawaz Ghali",
			"avatar": "https://pretalx.com/media/avatars/WBTYPT_PBPzQCN.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/WBTYPT_PBPzQCN_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/WBTYPT_PBPzQCN_thumbnail_tiny.jpg"
		},
		{
			"code": "7HCKTC",
			"name": "Juan Cruz Martinez",
			"avatar": "https://pretalx.com/media/avatars/7HCKTC_xveYGF7.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/7HCKTC_xveYGF7_thumbnail_default.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/7HCKTC_xveYGF7_thumbnail_tiny.jpeg"
		},
		{
			"code": "7QVZDD",
			"name": "Emily Woods",
			"avatar": "https://pretalx.com/media/avatars/7QVZDD_zJqJiNo.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/7QVZDD_zJqJiNo_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/7QVZDD_zJqJiNo_thumbnail_tiny.jpg"
		},
		{
			"code": "PTZEZA",
			"name": "Julian Beck",
			"avatar": "https://pretalx.com/media/avatars/PTZEZA_P3ccTBL.png",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/PTZEZA_P3ccTBL_thumbnail_default_UEg7CxM.png",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/PTZEZA_P3ccTBL_thumbnail_tiny.png"
		},
		{
			"code": "8SZGZW",
			"name": "Isabel Drost-Fromm",
			"avatar": "https://pretalx.com/media/avatars/8SZGZW_Byqma2O.png",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/8SZGZW_Byqma2O_thumbnail.png",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/8SZGZW_Byqma2O_thumbnail_tiny.png"
		},
		{
			"code": "SJPXAQ",
			"name": "Jako Rostami",
			"avatar": "https://pretalx.com/media/avatars/SJPXAQ_5P4Zusw.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/SJPXAQ_5P4Zusw_thumbnail_default.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/SJPXAQ_5P4Zusw_thumbnail_tiny.jpeg"
		},
		{
			"code": "TVU8C7",
			"name": "Felix Leon Buck",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "LCEK33",
			"name": "Luca Baggi",
			"avatar": "https://pretalx.com/media/avatars/LCEK33_94a2JTa.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/LCEK33_94a2JTa_thumbnail.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/LCEK33_94a2JTa_thumbnail_tiny.jpg"
		},
		{
			"code": "SS7YVE",
			"name": "Sam Kaveh",
			"avatar": "https://pretalx.com/media/avatars/SS7YVE_NbiW0Kr.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/SS7YVE_NbiW0Kr_thumbnail_default.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/SS7YVE_NbiW0Kr_thumbnail_tiny.jpeg"
		},
		{
			"code": "D7XC7V",
			"name": "Leandro von Werra",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "TP9MH3",
			"name": "Jonas Böer",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "BPXQUH",
			"name": "Anette Haferkorn",
			"avatar": "https://pretalx.com/media/avatars/BPXQUH_8rvYJ0Z.png",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/BPXQUH_8rvYJ0Z_thumbnail_default.png",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/BPXQUH_8rvYJ0Z_thumbnail_tiny.png"
		},
		{
			"code": "Y3GHEB",
			"name": "Andy Kitchen",
			"avatar": "https://pretalx.com/media/avatars/Y3GHEB_BenaIPR.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/Y3GHEB_BenaIPR_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/Y3GHEB_BenaIPR_thumbnail_tiny.jpg"
		},
		{
			"code": "MQ7JUZ",
			"name": "Tanu",
			"avatar": "https://pretalx.com/media/avatars/MQ7JUZ_aLFD3YZ.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/MQ7JUZ_aLFD3YZ_thumbnail_default.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/MQ7JUZ_aLFD3YZ_thumbnail_tiny.jpg"
		},
		{
			"code": "XDSGYW",
			"name": "melhin",
			"avatar": "https://pretalx.com/media/avatars/XDSGYW_fVP9Ya2.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/XDSGYW_fVP9Ya2_thumbnail_default.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/XDSGYW_fVP9Ya2_thumbnail_tiny.jpeg"
		},
		{
			"code": "FNLJZD",
			"name": "Carlos Trujillo",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		},
		{
			"code": "EACXYX",
			"name": "Iryna Kondrashchenko",
			"avatar": "https://pretalx.com/media/avatars/EACXYX_VKiz23C.png",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/EACXYX_VKiz23C_thumbnail_default.png",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/EACXYX_VKiz23C_thumbnail_tiny.png"
		},
		{
			"code": "LDZFAV",
			"name": "Arne Grobrügge",
			"avatar": "https://pretalx.com/media/avatars/LDZFAV_9t8ZISl.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/LDZFAV_9t8ZISl_thumbnail_default_18GmgU4.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/LDZFAV_9t8ZISl_thumbnail_tiny.jpeg"
		},
		{
			"code": "NWAQCX",
			"name": "Oleh Kostromin",
			"avatar": "https://pretalx.com/media/avatars/NWAQCX_aiMHOjX.png",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/NWAQCX_aiMHOjX_thumbnail.png",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/NWAQCX_aiMHOjX_thumbnail_tiny.png"
		},
		{
			"code": "9CX9CB",
			"name": "Anna-Lena Popkes",
			"avatar": "https://pretalx.com/media/avatars/9CX9CB_cJ2hJM2.jpg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/9CX9CB_cJ2hJM2_thumbnail.jpg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/9CX9CB_cJ2hJM2_thumbnail_tiny.jpg"
		},
		{
			"code": "EKLLGL",
			"name": "Anna Varzina",
			"avatar": "https://pretalx.com/media/avatars/EKLLGL_lpNJ1YY.PNG",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/EKLLGL_lpNJ1YY_thumbnail_default.PNG",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/EKLLGL_lpNJ1YY_thumbnail_tiny.PNG"
		},
		{
			"code": "VMEMAF",
			"name": "Emek Gözlüklü",
			"avatar": "https://pretalx.com/media/avatars/VMEMAF_jOyaomI.jpeg",
			"avatar_thumbnail_default": "https://pretalx.com/media/avatars/VMEMAF_jOyaomI_thumbnail_default.jpeg",
			"avatar_thumbnail_tiny": "https://pretalx.com/media/avatars/VMEMAF_jOyaomI_thumbnail_tiny.jpeg"
		},
		{
			"code": "WEJ8W7",
			"name": "Noah Hollmann",
			"avatar": "",
			"avatar_thumbnail_default": "",
			"avatar_thumbnail_tiny": ""
		}
	]
}